{"data": [[{"title": "Deliberately picking fights with the community (or about other communities) is a violation of the civility rule. (self.entj)", "likes": "65", "comments": "65", "content": "I've been seeing these pop up a lot lately, so I guess it's worth mentioning here. Likewise, I will not tolerate contempt for individuals solely based on their type. \nIf you're going to hate somebody, hate them for something they've said or done, not for the general gist of their personality.\n\n"}, {"title": "The Super ENTJ: Trick list (self.entj)", "likes": "117", "comments": "31", "content": "I was curious what other ENTJs learned through their growth and development.  Please share your insights.  I've listed a few of mine.\n\nStay reserved.  People already are intimidated by you, when you argue with someone it will crush them.  Use silence and body language more often than words.\nFocus on one goal that matters most to you and let that be the basis of everything you do, never forget the main goal and see how everyone fits into that one goal.\nRead as much as possible to equip yourself with knowledge and strategy.  Especially The Art of War by Sun Tzu.\nWhen you interact with people, realize that everyone has a skill and admire that skill when you speak with them.\nStay sober, you have way too much confidence and have no problems being sociable and you're too focused on goals to be distracted by drugs or alcohol.\nHit the gym everyday.\nMeditate on the goal you want to achieve and envision it coming true.  Usually I do it throughout the day, but it's most effective when I dedicate time towards it.  There is always an answer to a question after these meditations but I can never seem to put into words the question or the answer, it's abstract.\nSpend time in nature to fulfill some emotional need that we lack from human interaction.  Again this one seems like a waste of time before getting there, but once you're there you understand there is some part of you that is missing, the Sensing or Feeling side and nature takes care of that pretty well.  Especially basking in sunlight.\nSometimes doing nothing and/or walking away is the best move.  \"If it is to your advantage, make a forward move; if not, stay where you are.\" - Sun Tzu from The Art of War.\nTo-do lists are your bread and butter.  Check them off on the reg.\nMinimize, simplify, and consolidate as much as possible.  You have lofty goals and not enough time.  It's as simple as deleting phone numbers, downsizing your wardrobe, getting rid of unnecessary monthly subscriptions.\nDelegate often.  We are tempted to micromanage everything (because we're so god damn efficient) however your employees will hate you for it and this will cause disturbance in the harmony of the team, which will effect the bottom line and the quality of the product or service.\nMaster learning the other MTBIs in order to recruit the right team players and communicate more effectively.  Also can be used to help others achieve their goals.\nUse your NT to hone in on indicators of emotions because you obviously cannot feel them as much as others.  But to get by and not come off as some cold blooded ruthless asshole, you can learn to react and set someone at ease by using logic.  Making people feel good helps you in the end and you gain more support to further your cause.\nGood work needs to be inspired, encouraged, and nurtured.  It doesn't hurt but actually helps saying \"Thank you\" or \"Good Job\" just a bit more often.\nThe last and ultimate one is to accept that it is lonely at the top.  Realize that YOU are your own audience.  Live on your own terms and move your cause forward.\n\n\n"}, {"title": "A poetic description of ENTJ (self.entj)", "likes": 0, "comments": "2", "content": "You are a screaming crowd, the rush of adrenaline pushing you further. The words I will not give up, a business contract with all signatures in place. You are droplets of blood-red ink, and the glint of sunlight off a reflective glass building. You are the gory beauty of a sunset before a storm, the soft certainty of a plant blooming each year. You are a mountain threatening to crumble, and a young tree that refuses to snap in the wind. You, ENTJ, are the confounding fluidity of Strength.\nSource\n\n"}, {"title": "NT brains (self.entj)", "likes": "13", "comments": "26", "content": "Do you ever think ENTJ’s are the stupidest out of the other NT’s? We just have much better social skills and will power that allows us to sufficiently climb hierarchies better \nNot saying we’re stupid, I just think other NT’s wield stronger intellectual power than us\n\n"}, {"title": "struggle with close social distances (self.entj)", "likes": "6", "comments": "11", "content": "I hate it when ppl stand close to me or touch me. Normally I keep my distance, but some ppl come and sit next to me to where our bodies touch. I don't mind some close distance with my close ppl who we can hug or sit very close to me. But it's been a struggle where most ppl don't respect my private space. Is there anyone who has the same problem, and how do u deal with it.\n\n"}, {"title": "Conflicting enneagram to ones MBTI (self.entj)", "likes": "6", "comments": "12", "content": "Just took a quickie little internet enneagram test out of curiosity.  I received the number 8.   \nI don’t have the anger issues or the “doesn’t work well with others” that it hints are possible.  \nSo I went looking to read the other number descriptions and I was curious how they interplay with MBTI.\nAre they separate or are they a tool to further laser point in on a personality? \nCould I just as easily have been an ENTJ type 6? (The description of that is a total opposition to my own way of being but is it a thing that an ENTJ can be a type 6 or type 2 or any type really?)\n\n"}, {"title": "I'm losing my ability to remember little things (self.entj)", "likes": "33", "comments": "41", "content": "18 M ENTJ here\nSo recently in the past year or so I would say that I have grown a lot. I am finding success in almost everything I do and have been quite productive. I have learnt a few skills, gotten a lot fitter, and done almost everything I think had to be done. Also got complete control over my porn addiction.\nBut one thing that has happened during this time is that I kinda seem to forget little things a lot. I misplace my phone more frequently, i make commitments and forget that i did, i have lost a few things as well and I can't seem to remember an episode or game that I played a week ago. And this problem just seems to increase day by day while I have been making some significant gains as a person.\nSo here are two questions:\n1-) Did something similar ever happen to any of you?\n2-) HOW can I overcome this???\n\n"}, {"title": "INTP. Just Here To Ask Questions Of People Who Actually Get Things Done. (self.entj)", "likes": "10", "comments": "10", "content": "Honest question: How would you advise an INTP with and infinite storm of grand/theoretical ideas but little work ethic to go about getting things done?\n\n"}, {"title": "What child are you? (self.entj)", "likes": "22", "comments": "67", "content": "I’m a middle child, and we are usually known as mediators and fair which I think applies to a lot of middle childs. What is your sibling life like?\n\n"}, {"title": " Are ENTJs really serious about relationships or do they prefer to play the field? (self.entj)", "likes": "8", "comments": "18", "content": "As far as I know ENTJs are rather dedicated and loyal when they enter a relationship as they don’t like to waste their precious time and care immensely about keeping their partner happy. So would it be fair to say that the likelihood an ENTJ would cheat is rather low? And when it comes to a single ENTJ, would they put effort into courting someone if they actually don’t care? Do they enjoy playing the field just for the pleasure of it or is wasting their time on various dead end pursuits beneath their ambition? Lastly, would an ENTJ keep their options open and keep multiple people on a string, each of which are under the impression they are special or exclusive, or is that also too much energy to expend?\n\n"}, {"title": "Entj dads, how do you describe the relationship with your kids? (self.entj)", "likes": "13", "comments": "18", "content": "I'm happily married to my entj husband  and our parenting styles differ so much that  I was wondering if it's an ENTJ thing or just him. I'm an INFP  and when I  met him, he had 2 kids and I was surprised to see he  wasn't playing with them, telling them bedtime stories etc. when they were there in the weekends. (I did)\nThe kids turned out fine, they study at high end universities but  it seems I miss them more than he does. As long as they are doing fine, he's ok with it. He doesn't need to see them often while I always ask when they are coming over again. \nWe have a young daughter together.  He leaves all the parenting to me. and I do enjoy being a mom!\n But he'd rather go on trips with me than as a family.\n He hates playgrounds etc. Would you see \"Harvey Specter \" running around with his kids in a playground? That's what he's like.. \nHe's not a warm, playful, funny dad, he is a dad that takes care of his family and he is very good at that. Is this typically ENTJ?  I'm not complaining, lol, just want to know if it's an entj thing! I love my husband!!😊\n\n"}, {"title": "Why are you guys on Reddit? (self.entj)", "likes": "26", "comments": "34", "content": "So, the typical image of an ENTJ is someone constantly and relentlessly pushing towards their goal, 100% no-nonsense, never ever doing anything that could ever possibly be perceived as a waste of time.\nObviously, stereotypes aren't reality, but stereotypes often come from some small amount of truth, so with that said, why are you ENTJs even on reddit? What do you hope to gain from being on Reddit?\nI'll start.\nI am just plain obsessed with Jungian psychology. That's the main reason. I only created this account just for the MBTI subreddit. I do hope to use what I learn here for self-improvement and effectively communicating with others who are a different type from me, but my primary reason is just that I love this topic.\n\n"}, {"title": "Worried for ENTJ boyfriend (procrastination, stress) (self.entj)", "likes": "9", "comments": "24", "content": "Quarantine seems to be taxing on a lot of people. Not being completely fine at the moment is rather understandable. Even with this in mind, I can't help but being worried by the change I witness everyday in my ENTJ boyfriend since we have been in lockdown (we live together). \nIn normal conditions, he would wake up fairly early in the morning, go to the gym, go to work, have a lot of interactions, and get home generally satisfied with his day. Of course, now the routine is pretty different for all of us, me included. Though, it looks particularly different for him: he never wakes up before 10 (or even 11), and most days he does not exercise nor get some work done, at all. I'll specify he does look happy on a surface level: he laughs with me, intimacy is great, we do activities together (cooking, watching something, etc.) - but I keep sensing he's stressed deep inside for his unproductiveness, and does not want to show nor to cope with this sentiment. \nSometimes he would give out clues. \"Ah, today I tried to get some work done, but I found a bug in my code and got demotivated quickly\", or, \"I'm lucky you are with me in this period, or I wouldn't have any structure at all in my day\" -- which does not sound like him at all: normally he's so busy during the day that we would hardly find time to interact. I would argue he has always been the one with the most solid structure among us two. Also, I have a dear ENTJ friend as well, and while he now does complain about the lack of social interactions, he never lost his productivity at work. This may bias me, of course, but it somehow tells me that an ENTJ would not lose his grip on his goals even during such a quarantine.  \nAnyway, my boyfriend avoids talking about these things on a deeper level, and may even look upset if I try to address the topics (thus, I stopped doing that).\nSo, I am looking for your advice now: \n1) Am I overthinking all this? Being an INFJ, I may easily assume things about his feelings. I would prefer to hear that there is not need for me to worry, and in this case we can ignore point 2 and 3.\n2) If I have indeed reasons to be worried: should I try to help him, or should I let him figuring things out by himself? I trust his capacities a lot, so this may be a viable option.\n3) If I should try to help him: ...how? Maybe help is not even the right term here; I would at least like to support him as best as I can.  \nExcuse me for the wall of text. I hope you are all doing well.\n\n"}, {"title": "Entj memes are so damn funny (self.entj)", "likes": "16", "comments": "3", "content": "That's all\n\n"}, {"title": "Did you have trouble deciding on your career? (self.entj)", "likes": "16", "comments": "28", "content": "I’m 20M entj studying mechanical engineering in college. \nFor a long time, I was quite unsure of what I wanted to study, since I’m interested in so many different subjects (math, philosophy, foreign language, physics). I eventually decided on engineering, as it encompasses many of my interests. While I’m definitely interested in engineering, I could see becoming bored only working as an engineer, so I eventually plan on going to graduate school and studying either law, medicine, or math.\nIs it common for entj’s to have many interests and to be indecisive on what to study? What did you study/are studying? Do you have many interests outside of work?\n\n"}, {"title": "Former INTJ Transforming to an ENTJ Need Mentorship (self.entj)", "likes": "8", "comments": "22", "content": "Hey guys! \nSo I’m a 23 year old black female fresh out of university (last year) and I’m in need of mentorship. I have goals and ambitions and while I’m working hard to achieve all of them, I know I need help with steering my personality towards the right direction. I’ve always had an intimidating aura about me and lots of people have commented to me that I tend to be arrogant and self-absorbed even though I was only trying to be direct and straightforward etc. Growing up, I always thought I was introverted, but it was more like a “phase” brought on by childhood trauma etc etc. Now, I just call myself a “reserved extravert”. I’m in a transitional period and I need sorta like a big brother/big sister ☺️✊🏾\n\n"}, {"title": " Tips for developing Te (self.entj)", "likes": "21", "comments": "76", "content": "Hello guys, INFP here. I've been trying to apply my MBTI knowledge in a more practical way for self development. That said, I am specifically coming to to you for tips in how to develop my extraverted thinking function. So I'd appreciate your thoughts on this and would like to hear about your experiences using Te, so I can have an idea of what I should do to integrate it more in my daily life. Thank you in advance :)\n\n"}, {"title": "Are all ENTJs always a little pervy (self.entj)", "likes": "10", "comments": "56", "content": "And a little shamelessly too? Idk please discuss\nThe ENTJ I know seems to cycle through and make a tonne of female acquaintances. And goes around liking a lot of selfies on their Instagram (ya ok I stalk so what I was having feelings for him then not anymore I guess), then tells me he’s not crazy about sex. What gives?\n\n"}, {"title": " ENTJ with ADHD spouse? (self.entj)", "likes": "6", "comments": "4", "content": "Hi there, I'm married to an ENTJ. I'm not here to complain about him; he's mostly great. Would just like ENTJ input on how to manage expectations and communication. I've read the ENTJ relationship articles out there, and want more specific input.\nWe've been married for nearly 10 years and I've had executive dysfunction for the last year or two(not lifelong like ADHD, sorry for clickbait title but it's more recognizable), probably brought on by having a second child and a recently incapacitated elderly mother, and therefore tons to do and an extreme lack of time to myself (I'm INFJ and grew up with virtually unlimited time to myself; was an only child and my one surviving parent worked multiple jobs.) I notice unfinished tasks as much as he does, but can't get through everything with kids hanging off of me and making messes and needing help with every damn thing. I've tried Strattera and Dexedrine, and they don't help much, except in giving my condition some legitimacy in his eyes (if a doc is willing to prescribe me something, then it's not just me being lazy).\nI know that efficiency is one of the things he values most, but the more I stress about being inefficient (according to his criteria), the less I can get done. Also, I'm an NF, so I'm going to get distracted; I can't turn this shit off.\nHe often says things like \"look at this whole list of tasks I've accomplished and you're not even done with xyz\". Or he will tell me to do something when I'm in the middle of doing it.\nAre any of you in relationships with 'inefficient' people who are trying but have real obstacles, and have you found effective ways to support them so that they actually improve, rather than just criticizing them and shoving your efficiency and their failure-in-your-eyes in their faces on the regular?\nAdditionally/alternatively, how would you suggest I communicate to him that his micromanaging is effing debilitating?\nMany thanks\n\n"}, {"title": "I’m looking for an ENTJ mentor (ISTJ) (self.entj)", "likes": "27", "comments": "28", "content": "Hello! This may be a long shot but as the title states, I’m searching for an ENTJ mentor. I admire the way you guys live, ability to see the big picture, and I want to learn. A little bit about me to get started.. I tried to keep it short and sweet:\n\nFemale 22 y/o\nMBTI: ISTJ\nEnneagram: 3w4\nGraduating Marketing major\nAreas of Growth : Becoming more efficient/sticking to routine, business topics/trends/investing, general advice about life situations etc.\n\nPersonality (not sure if I this interests you)\n- Very driven but can get sidetracked at times\n- Blunt/straightforward but, can sugarcoat\n- Enjoys going out at times but most of the time stays in\n- Focused on self-improvement\n- Perfectionist (trying to fix this)\n- I enjoy blogging/about to learn coding\n- Recently been reading a lot of news/industry trends\nEtc.\nFeel free to ask any further questions if you’d like to vet.\n\n"}, {"title": " INTP wanna learn about female ENTJs (self.entj)", "likes": "2", "comments": "34", "content": "hello everyone (sorry i can't edit the header and i meant no offense with \"female\" so don't get offended ladies)\nso as you  guys probably know that INTPs are obsessed with learning and gathering informations\nme, an INTP is currently interested in learning about your type\nso if anyone wanna have any kind of deep conversations u can pm me (my socializing batteries are over filled and i gotta discharge them somehow)\nand here's a simpy introduction (i am nothing special just someone who wanna feed his learning desire)\nyou can call me Dexter, 21yo, INTP, 4w5, student\ni am simply a typical INTP, interested in everything wanna learn about everything but will end up doing nothing\nI have been doing some researches about astral projection lately and would like to know what u guys think about it\ni am also into electronics and mechanics and i am working on a 3D printer (dunno when i will have the motivation to finish it)\nand I love making things and creating useless stuff (I spend my days watching videos and reading articles about random DIY projects)\n\n"}, {"title": "How do you assert yourself as a leader? (self.entj)", "likes": "9", "comments": "16", "content": "Well I couldn't find a proper subreddit to post this, and I thought, well, you guys are a natural at this so I'll ask you. \nSo I created a productivity group where we would share our goals and motivate each other to accomplish them. Well it feels difficult to manage a group of people when they all have a mind of their own. They don't respond when they're supposed to and everything is so disorganized. I sometimes feel impatient but hold back because I don't want to be perceived as bossy. I kinda feel like quitting this but I don't want to.\nHow do you guys do it? How do you lead a team? What do you think is most essential in a leader?\n\n"}, {"title": "What personality type do you not get along with? (As a entj) (self.entj)", "likes": "29", "comments": "90", "content": "Hello entj, I’m just your average entp trying to gather information for a project!\n\n"}, {"title": "ENTJ/INTP relationships (self.entj)", "likes": "19", "comments": "27", "content": "Anyone watch Money Heist? The Professor is an INTP and the Agent Raquel an ENTJ. It’s a great show and I don’t wanna ruin it  but they get together but she doesnt know they’re rivals (also I haven’t finished it. Don’t fucking ruin it) \nThe anime Death Note Light is the ENTJ and L is the INTP. Light thinks he’s god with this death note and L suspects it’s Light but can never prove it and they’re both all trying to outsmart each other \nAlso another podcast I listen to The Dick Show is the relationship between close friendship of an ENTJ and an INTP. Unfiltered hilarious conversation about random hypotheticals or overly exaggerated realities about current events (10% political 60% comical pop culture 30% funny guests with weird messed up stories about their lives) and rarely but sometimes deep conversations that are still funny at the same time. \nLook up Conan O’Brian and Jordan Schlansky on YouTube it’s also a funny ENTJ/ INTP friendship only difference is Conan makes fun of Jordan because, duh they’re in the comedy business. Most ENTJs don’t wanna upset their INTP friends unless it’s fair criticism. At least that’s how I’m sure the majority of us are \nI’m not here to argue if you think I’m mistyping and please don’t argue, because idc, but does anyone else know of other shows/podcasts/ movies that show/demonstrate something similar to an ENTJ / INTP relationships? \nPs to INTP’s I love you’s\n\n"}, {"title": "not sure about being an ENTJ (self.entj)", "likes": "3", "comments": "7", "content": "Im 14 y/o female. I've been identified as an INTP when I first learned mbti, but digging deeper into it and looking at others INTPs I hardly relate.  I consider myself an introvert, I drain pretty easily with some people, but INTPs and INTJ seemed too calm to me sand I am easy annoyed by some people easily. Am I missing something about x00x functions? . I spend a lot of the time online and I enjoy texting as I enjoy rl conversation. I also enjoy memes or \"what your ... based on your mbti\". I know more of INTPs  kind of stuff.\n\n"}, {"title": "not sure about being an ENTJ (self.entj)", "likes": "4", "comments": "1", "content": "Im 14 y/o female. I've been identified as an INTP when I first learned mbti, but digging deeper into it and looking at others INTPs I hardly relate.  I consider myself an introvert, I drain pretty easily with some people, but INTPs and INTJ seemed too calm to me sand I am easy annoyed by some people easily. Am I missing something about x00x functions? . I spend a lot of the time online and I enjoy texting as I enjoy rl conversation. I also enjoy memes or \"what your ... based on your mbti\". I know more of INTPs  kind of stuff.\n\n"}, {"title": " How do ENTJs deal with a LDR? (self.entj)", "likes": "3", "comments": "10", "content": "I understand ENTJs are more action-orientated and acts of service would probably be one of their key love languages alongside quality time. For example, I find words of affirmation an important factor for me and would like to know how often does an ENTJ find themselves emotive in their everyday language with their SO or with someone they are talking to or are with particularly in a long distance relationship. It would be interesting to understand people’s experiences in a LDR and how they deal with it.\nThanks in advance.\n\n"}], [{"title": "Intellectual curiosity (self.entj)", "likes": "8", "comments": "5", "content": "I've noticed that most NT types are often labeled as intellectually curious, and despite the \"commander in chief\" stereotype, I find that I am just as intellectually curious as other NTs. I have often had an insatiable thirst for understanding and knowing the 'whys' of  a subject. It could be an established rule or structure, a company's strategy or actions, a scientific fact, the way people think or what they did, or a certain way or method of doing something- the list goes on.\n\"Why doesn't a company just expand to this market, create this product, or do 'this' to expand and be more profitable\", \"why do people think a certain way\", \"why does this math equation work like this\", \"why don't people do x given the circumstance instead of doing y\", etc.\nI suppose the difference would be I'm more curious about the 'why' part instead of 'how' part. Questions such as: \"why isn't it done this other way?\", \"why don't we just do this?\", \"why is something done this way?\". Basically intellectual curiosity.\nDoes any other ENTJs relate? Or am I just drifting into ENTP land?\n\n"}, {"title": "Any advice on starting small business? (self.entj)", "likes": "15", "comments": "7", "content": "I'm planning to start but I'd like to hear your advice on it. What were the issues? How did you start? What did you start? What methods could help? \nI'm good at counting and predicting things but in general I haven't studied business yet. Sure thing I want to devolop it in the future, so It has to be flexible or It has to give opportunites to start something more beneficial.\nLet me know what you think.\n\n"}, {"title": "ENTJ new test for me from this website (self.entj)", "likes": "1", "comments": "10", "content": "​\nhttps://preview.redd.it/tpj3zshyg7w41.jpg?width=629&format=pjpg&auto=webp&s=d46632071bbe6fd25bac1b15ee38f01de3472697\n​\n\n"}, {"title": "new mbti chat!! (self.entj)", "likes": "8", "comments": "8", "content": "hi!!  i just started a new mbti chat but we don’t have any entjs yet!  would love if any of you would like to join 🖤 it’s called “mbti cafe “ on telegram \nhttps://t.me/mbticafe\n\n"}, {"title": "Quarantine (self.entj)", "likes": "29", "comments": "20", "content": "So, question: How do you guys deal with this quarantine? What effect does it have on you?\nWhile I am neither bored, nor have any issues with myself that just now came to light, I am finding it increasing difficult to do everything in one house, sometimes one room. I have always been someone who enjoyed cafes, offices, libraries... just a regular change of scenary, it made me more productive. Also, as a workoholic, it was good for me to keep work and home separated as much as possible, otherwise I’d never relax.\n\n"}, {"title": "Can’t tell if I’m an ENTJ or ENFJ (self.entj)", "likes": "7", "comments": "23", "content": "Hello. I am 42% thinking and 58% feeling so based on that i am an ENFJ. however, i personally do not know which personality i identify with more. I am going to list some of my traits and plz help me decide. \nextremely ambitious: most people refer to me as the most ambitious person they know and i definitely see it. if i want something, i will plan on ways to get it and follow through with my plans. \nhighly values thinking: i believe emotions are easily misguided and should not be trusted with. for example, i decide who to vote for using an algorithm i made. i score each candidate on every issue in two categories: 1) stance AKA how much i agree w the person and 2) implementation AKA how willing the person is to compromise/how realistic is it. then i list the issues in order of importance to me (healthcare might be 25% of the score while education is 30%). then, i vote for the person with the highest score. \nloves knowledge and learning: i truly, genuinely love learning. whenever i think of dying, the first thing that comes up in my mind is that i’ll have to stop learning. \nunderstands people: i am able to read people extremely well and know what they are thinking. i also love talking to people and i know how to make them feel happy, sad, etc. \nempathy: i am able to understand things from other’s perspectives and relate to what they’re going through, even if i have never gone through it myself. \ni am currently stuck and don’t know which i am. any ideas?\n\n"}, {"title": "How did you develop your Ni? (self.entj)", "likes": "4", "comments": "10", "content": "I think it's crucial for good ENTJ development but I seriously need some tips on how to actually 'work' on the function.\nVery thankful for any replies.\n\n"}, {"title": "Disillusionment (self.entj)", "likes": "9", "comments": "10", "content": "I don't know since when but I think more and more people are trying to make concepts/ideas more difficult than they sound. This is most certainly a ploy/tactic aimed to cause confusion and disallow others to engage the topic.\nHowever, the more I tried to research/ study that topic, its allure has slowly faded and all that is left is disillusionment. I was deeply disappointed with how \"simple\" it is.\nThis is, of course, a rant but feel free to share your similar frustrations.\n\n"}, {"title": " What type of content do you guys appreciate most? (self.entj)", "likes": "5", "comments": "7", "content": "I want to make self-development content geared more towards you guys and INTJs because I feel like you two types would be the most receptive to my introverted thinking. It would stimulate you and provide you with a helpful perspective moving forward.\nWith that said, I was wondering what sort of self-development knowledge you guys like best? Do you find any interest in learning about processes, how to approach experiencing reality, and how to take in data (ex. critical thinking)? I've been thinking of making videos geared towards thinking about reality differently, dividing the self into thoughts, sensory experiences, and emotions, and giving very brief 3 minute videos explaining summarized and researched self-help techniques through these 3 divisions, but framed through a sort of sci-fi reality-bending storyline.\nIn terms of how to make profit, I was thinking of making free e-books that are 10-pages long and then three short 30-100 ebooks to be sold. If you have any better ideas of how to tailor it better for you guys, I'm all ears!\n\n"}, {"title": " ENTJ mother, in need of advice (self.entj)", "likes": "22", "comments": "99", "content": "Hey guys (and girls)\nI have come here to seek for advice because... I am a young individual and as you know, the more you ask, the better you learn.\nMy mother is an ENTJ, and... I usually feel overwhelmed when I have to speak myself. No no no, don't get me wrong. I think she is a very nice and kind person but... She doesn't know how to... Express her feelings and every time someone from work made her feel bad, she goes out of her way to interrupt me and inflict great deal of damage on my morale because she doesn't know what her words feel like.\nI am an INFJ and I don't really talk much but I think deeply about things. I hate nobody and I love everyone. I believe there aren't bad people. Just people who are misunderstood. I am one to always try to help when someone is feeling bad, reacting emotionally or rationally, depending on the case. I really like thinking when I am on my own. I enjoy reading things like what Plato said. I like to think on oblivious things, ones that are dark and thoughtful.\nI am 18 years old (well, almost) and I want to explore every personality type, because I want to make myself a business in the future. I want to know how to talk to everyone. I want to be the good guy who can be \"perfect\" (if that's how you call it). I just want to know how to talk to my colleagues and I will treat them as equals. I don't like hierarchy and abusing power over others. I want to be the type of person who helps everyone with any of their struggles - emotional or not. I want the office to feel like a big family of 1000 people. I just need to know what to do to achieve it. I get tired after very long conversations, though. My mother can lead long conversations on end without being tired at all.\nIn conclusion I want to say I love my mother and I think she is a very brave person. She needs more attention than what I can provide and it takes more than 5 hours of talking to get to her emotions and help her stop holding grudges. How can I help her faster and... Without risking too much of hurting myself in the process?\n\n"}, {"title": " What's the worst thing one can do to entj? (self.entj)", "likes": "2", "comments": "29", "content": "Hi l really want to know what is it someone can say or do to entj to completely mess them up . What was it that hurt u or caused emotional breakdown.  What was it that made u think about your priorities and the way u look at stuff?\n\n"}, {"title": " Would you date someone with expensive taste? (self.entj)", "likes": "0", "comments": "32", "content": "Edited for more details:\nHer regular parties are $20000 (not birthdays, xmas, thanksgiving, valentines...just a regular party).\nPurses $5000.\nOnly eats at 5 star restaurants.\nCan grow resenting to bitter if you are just low maintenance n are ok with simple life.\nVacations are minimum $4000.\nEdit: bitter as far as you don’t need much from life. Like you can see she is getting into resenting phase. You are low maintenance n simple boring things keep you happy. You don’t need much at all from life while she is busting her ass. She is making 6 figure n your happy with basic avg pay. She is ambitious n ur just stay at home chill.\n\n"}, {"title": "Regret. (self.entj)", "likes": "52", "comments": "15", "content": "I've been learning about machine learning in python and it made me realize a really simple concept that we might forget. Our lives are made up by 2 independent variables and 1 dependent variable when it comes down to success. The dependent variable being Y: Happiness and the two independent variables being X1: Things that you would regret doing and X2: Things that you would regret not doing.\nLinear Regression Model\nI think if you can keep in mind or be aware of these variables, you might be able to succeed in most scenarios, which would lead to happiness and satisfaction. I guess the main takeaway is to do more things you would regret not doing. Doing less of what you'd regret doing is also important because you waste less time, and have more reserve to focus on doing more of what you want to actually do. It's an easy simple way to reach your full potential.\nTL;DR: Do more things you would regret not doing, and do less things you would regret doing.\n-Steve Dobbs rambling\n\n"}, {"title": "Dealing with other people's emotions - avoid or attack? (self.entj)", "likes": "15", "comments": "15", "content": "I work very closely with a couple of people who are quite emotional. They often simply focus their attention on whatever is causing them anxiety, rather than on what needs to be done. They also react with extreme emotion in stressful situations or when receiving criticism. This is quite exhausting for me.\nUnlike some ENTJs I have learned to accept the emotions of others and I do understand that not everyone has the luxury of being able to set emotions aside (or use them productively) in order to achieve their goals. \nUnfortunately I find myself avoiding interactions with these people, or avoiding important discussions, simply because I don't want to have to deal with what are (in my view) rather childish reactions. I love to solve problems, but not when I have to fight through layers of emotions first. Honestly, I don't see it as my responsibility to regulate their emotions for them.\nDoes anyone else find themselves in this situation? If so, do you have any tips or suggestions?\n\n"}, {"title": "Any fellow ENTJs from Australia?? (self.entj)", "likes": "8", "comments": "4", "content": "Where are my aussie entjs hiding??\n\n"}, {"title": "Dating introverts? (self.entj)", "likes": "10", "comments": "25", "content": "Anyone dating an introvert? I like the idea of dating a IxxP. I’m 30 now, male, ENTJ. 20s were filled with extroverts. Love to hear feedback! I’m gravitating to ISFP\n\n"}, {"title": "I want to know... (self.entj)", "likes": "7", "comments": "6", "content": "How do you guys have your personality and gender when you post? How do I make mine visible too?\n\n"}, {"title": "Am I Being an Over-dramatic ENTJ? (self.entj)", "likes": "38", "comments": "63", "content": "I cut it off with my best friend for a couple main reasons:\n\nShe made fun of me when I ended my freshman year of high school with a 4.3GPA and 3 varsity letters (field hockey, basketball, soccer)\nShe publicly ridiculed me on social media sophomore year about how I would never hang out with her because I was too big of a nerd and always studying.\nWhen I showed her my goal journal (which was something HUGE because I like to keep mind private) she said \"You think you're going to make any of these? You don't need to think about career or life right now so why are you? Come on just be a kid, you're already acting like a 40 year old man\". (This was also right in the midst of committing to college where we HAD to think about our careers)\nShe told our friend group \"Adelaide isn't hanging out with us that much because she told me she doesn't think we're good enough for her.\" Which I never said in the least bit, I told her that I wasn't hanging out with them because of homework and soccer practice.\nCalled me \"ADHD brain\" (I have ADHD but only about 3 of my friends know it) all summer because when we went to the pool I would want to swim but she would just want us to tan but I had soccer practice every day in the summer and didn't want to spend anymore time in direct contact with the blazing sun. Then she would constantly say how bad I looked in a bikini because of my soccer tan lines and muscles- even though she knows I want to go D1 for soccer.\nSenior year during winter finals she tracked my location where I was studying at the library and took a Snapchat picture of me and captioned it \"Workaholic- accepting new best friend applications\" because I refused to put on a bikini and go out into the snow with her.\n\nI am a stark ENTJ and my ex-best friend obviously is not, she doesn't like to work hard she just likes to have fun. Am I being too harsh when I cut her off? I told her I didn't want to see her anymore because I didn't want to be around people who didn't support my goals and understand that I like to work. Should I have kept her around to be someone that helps me relax? I'm only 17 and a senior in high school so anyone who has experience in this I would love any advice on friendships.\n\n"}, {"title": "Being agreeable (self.entj)", "likes": "20", "comments": "16", "content": "Does anyone else not identify with the depiction of ENTJs as ruthless?\nI can be ruthless in some situations, but my default operating mode is to be pleasant, engaged and to listen to others. Not pleasant in a meek way, but respecting others for who they are and giving them my full attention if they talk to me, while also enforcing boundaries where needed based on the person/situation.\n\n"}, {"title": " Subreddit for self discovery (self.entj)", "likes": "2", "comments": "1", "content": "Hello!\nWe are a couple of guys who have started an MBTI subreddit. We have made it because we think that all the other MBTI subreddits are more about having fun and less about advice, at the expense of encouragement for personal growth. We aim to fill that neglected niche of people who want to grow as a person. \nThis subreddit is different from the others in how we prioritize personal growth, better communication, advice, and a deeper understanding of ones self. We want to be where you can go to help each other out and better understand what makes us different, and what we all share in common. We are aiming for everyone to be friends(even when we disagree), and where you can ask questions about different types or about day to day things that affect you. \nPlease come on ever and join the community!\nSubreddit: r/personalityinOrder\n\n"}, {"title": "ENTJ's jobs (self.entj)", "likes": "17", "comments": "47", "content": "Hello, fellow ENTJ's\ni want to ask y'all what your careers are? as of right now, i am in law school and i feel like this is the right career path for me to take! the competition, the ambition, the thirst to be the best; it feels like im on cloud 9. I feel like i can do whatever i want and there is nothing that can stop me. I get really excited ;), just by thinking about my accomplishments or the accomplishments i can achieve. i just want to know if y'all are happy with your careers?  what careers do y'all currently have. And if y'all aren't in the correct career, what are you willing to do it acheive greatness?\n\n"}, {"title": "INTP Male looking for a date (self.entj)", "likes": "5", "comments": "39", "content": "On the outside, always looking in\nWill I ever be more than I've always been?\n'Cause I'm tap, tap, tapping on the glass\nI'm waving through a window\n\n"}, {"title": "\"The world wants to hold the key to your confidence in their pocket\" - do you guys agree with this statement? (self.entj)", "likes": "12", "comments": "4", "content": "This is a statement I've always believed in. Especially when accused of being cocky or too full of myself which fair enough is valid criticism but then look at it this way:\nSociety is always preaching about confidence and self-love but then only want you to show it on their accord. The world only wants you to start feeling yourself when they say you can not when they want you to. When you're \"worthy\" of high acclaim socially or in other context thats when the world wants to accept your self love, anything before that is apparently arrogance and a lack of humility. \nThe world wants to hold the key to your confidence in your pocket. When in reality its your key and belongs with you to bring out whenever you feel like it\n\n"}, {"title": "If you ever feel bad, at least you're not a lazy ENTJ (self.entj)", "likes": "92", "comments": "20", "content": "If the topic is something I'm even slightly interested in, I will bulldoze through it with great efficiency and laser-guided focus. But if I don't care? Then I end up being the laziest fucker on the planet. \nFeel like when other types are procrastinators its not that big of a deal. But as an ENTJ, I end up feeling like a completely useless waste of human life lol\n\n"}, {"title": " Date with an ENTJ (self.entj)", "likes": "24", "comments": "23", "content": "I guess it was more of a hookup. As soon as the ENTJ entered my apartment he walked around and examined my furniture, asking me why I placed it how I did. Then he explained how it could be placed in a way that was more efficient space wise. Then he told me about the business he was starting, and finally we discussed my finances and how I could be more efficient with my savings. He also looked in my closet and was appalled that I purchased a fur coat with a credit card, and explained how I would be paying much more than the value since I did that. \nI asked him his type, he said ENTJ. \nJust thought I’d share with you all, this was probably the most by-the-book ENTJ I’ve ever met.\nEdit: damn, hopefully this didn’t seem insulting! He was a stereotype without all of the good stuff. No harm or judgement intended!!\n\n"}], [{"title": "Annoyed by feelings? (self.entj)", "likes": "11", "comments": "9", "content": "I (entj fem)am just wondering if anyone else in the ENTJ' s feel frustrated with having feelings towards someone ? I quite often feel, that I am somewhat annoyed by how deeply I feel for my partner. I even sometimes hate it, I do not know how to handle that kind of feeling thing. Don't get me wrong, my otherhalf is amazing. He is a great partner, but as soon as I realized I actually want him in my plans and in the picture, I got this feeling of  hating  it just very little. ( I guess more from the point of thag I have to consider his needs aswell from now on before making crazy big carreer or other decisions.\n\n"}, {"title": "Fellow Female ENTJ at Work (self.entj)", "likes": "10", "comments": "14", "content": "Backstory: 24F ENTJ trying to get that promotion next year\nQuestions: Do you feel like you have to work harder than men your age (or younger) to be recognized at your workplace? And how do you balance between being 'nice' and being 'effective'?\nI learned some hard lessons with my previous boss (male, probably INFP) who thought I was too arrogant and aggressive because I would argue with him over the practicality and why we should not take on EVERY task someone asks us to do for too little business impact. Although I completed so many impactful projects, you can guess that my performance evaluation wasn't great.. largely in the 'being a people person' area. After that I resort to being nice and agreeable and quite afraid now to come off as a bitch, although it puts me in an uncomfortable situation because I can't speak my mind. So what advise do you have? Do I have to put on this nice girl mask until I get promoted to be someone's boss? How do you get recognition from men at work while at the same time not be a hard bitch?\n\n"}, {"title": " What is your process for assessing the long term prospects of a romantic partner? What makes you feel sure about pursuing a romantic relationship with someone? How do your actions towards a partner (or potential partner) change when they’ve passed your assessment? (!) (self.entj)", "likes": "7", "comments": "11", "content": "Asking for individual ideas, not generalised ENTJ ideas.\n\n"}, {"title": "[Relationships] Advice on dating INTP (self.entj)", "likes": "26", "comments": "28", "content": "The story so far...\nI met a female INTP at college and we quickly became friends. She didn't want to date anyone with the same major as her, (She had the rule long before we became friends, it wasn't a way to turn me down specifically or anything like that) but now that quarantine is here and we won't have any classes together next semester I told her I was interested in pursuing a relationship, and laid out the most important reasons why. My reasons were that we have good convos, make each other laugh, and she's hot (which got a laugh). She didn't say no or yes, but we continued to spend time together and we text most days.\nBecause she's an INTP I know she's slow to come to decisions, so I told her I was willing to go slow and that she could take her time. Any advice on pursuing/dating INTPs?\n\n"}, {"title": "You Can't Do It. (self.entj)", "likes": "17", "comments": "45", "content": "ENTJ's how do you respond to someone telling you, \"You can't do it.\"\n\n"}, {"title": " PersonalityinOrder, Learn about your type and other types (self.entj)", "likes": "1", "comments": "3", "content": "Hello!\nWe are a couple of guys who have started an MBTI subreddit. We have made it because we think that all the other MBTI subreddits are more about having fun and less about advice, at the expense of encouragement for personal growth. We aim to fill that neglected niche of people who want to grow as a person. \nThis subreddit is different from the others in how we prioritize personal growth, better communication, advice, and a deeper understanding of ones self. We want to be where you can go to help each other out and better understand what makes us different, and what we all share in common. We are aiming for everyone to be friends(even when we disagree), and where you can ask questions about different types or about day to day things that affect you. \nPlease come on ever and join the community!\nSubreddit: r/personalityinOrder\n\n"}, {"title": "Older ENTJs Advice for the Young ENTJs (self.entj)", "likes": "6", "comments": "17", "content": "Older ENTJs, what is your advice to an 18 year old ENTJ like me entering adulthood?\n\n"}, {"title": "Do you feel like you have Relations of Benefit with ENFPs? (socionics). (self.entj)", "likes": "4", "comments": "4", "content": "Where ENFP is your Benefactor (giver) and ENTJ is the Beneficiary (recipient). \nhttp://www.socionics.com/rel/bn.htm\n\n"}, {"title": "ENTJ in relationships, advice? Thoughts? (self.entj)", "likes": "3", "comments": "14", "content": "I am currently talking to an ENTJ guy and it has been pretty great so far but I just wanted to glean some further insight on how ENTJs function within and view relationships. I am also curious on the dynamics between ENTJ and ENTP (my type) in a romantic setting, whether it’s a truly viable match and what common strengths and weaknesses are found in this specific pairing.\n(This next part is just about my particular experience and observations and is not necessary to read in order to provide relevant insight but rather is just here as a deeper and more personal base of information to draw from)\nSo far as I’ve observed, we innately get along very well and he’s hardly brought up any concerns of his own. But, with my overactive mind, I have picked out all sorts of issues and started many arguments with him, which I think it’s great that it’s incredibly comfortable and easy to discuss concerns with him, but it’s almost as if to fully capture his attention I have to provide a relevant problem for him to solve as well as the threat of me being dissatisfied. We each are quite independent and enjoy our freedom which is a strength in my eyes, but even so, since I unpredictably experience bursts of energy and inspiration, I find myself begging for his attention in these moments and becoming frazzled when I can tell he’s preoccupied or disinterested in my predicament. He is much more focused on practicality and is not usually motivated to indulge my abstract inquisitions which can leave me feeling rejected. I like the prospect of a relationship with him as we relate on so many fronts, provide a unique type of intellectual stimulation for each other, each have the desire to build something meaningful and productive, and would be an absolute power couple, but I can’t help but wonder if our fundamental differences would ultimately fracture a relationship and whether that’s unavoidable or if there are things that can be done to successfully remedy them.\n\n"}, {"title": "How to deal with laziness (self.entj)", "likes": "31", "comments": "18", "content": "Hello there. Based on the functions I am pretty sure I am an ENTJ, though I sort of dismissed that idea for a long time because I definitely don't act like a normal ENTJ. Primarily, I suffer from Chronic laziness and procrastination. I am currently 17 years old, and was diagnosed with ADD when I was 13.\nI almost never do school work because it seems like a waste of time to me. I have some ideas for projects I want to work on, like a YouTube channel for example, but I just can't get myself to sit down and focus on it and get shit done.\nI also don't have much of a goal for my life. I have a general idea of what I want to do, but nothing concrete. I think knowing what I want out of life would help me out greatly.\nAny ideas on how I can get my on track?\n\n"}, {"title": "ENFP, or ENTJ with ADHD? (self.entj)", "likes": "5", "comments": "10", "content": "I'd love some help here! I wanted to know if you think I am an ENFP, or an ENTJ with ADHD.\nWhy do I have this question?\n\nI first did the MBTI in high school at got ENFP.\nAt 27 I became a district leader for Verizon and they had me take the MBTI, and got ENFP again.\nI'm 30 now, and took a leadership position with Tesla, took the MBTI and got ENTJ.\nRead a lot about ENTJ online, and resonated a lot with me.\nHave always thought I was an ENFP, because I have those hyper emotional moments (I have ADHD too, unmedicated currently) and because I tested ENFP twice now.\nContinuing to get ENTJ on online tests.\nI love rational thinking, it's very very important to me, but I also make majority of my decisions with high emotion behind them, and justified by the logic/rationale. ENTJ's appear to be very robot like rational/logic thinking, and this is where I get behind ENFP more. However at the same time, highly emotional people and decisions can make me sick... :(\nI am 100% spot on ENTJ parenting description of the 16 personalities website. I am 0% ENFP parenting on the 16 personalities website. (Girlfriend was quick to laugh at how spot on ENTJ parent like I am, Authoritative, strict expectations of my kids, but for the desire to make them highly successful people.\nI talk a lot. (maybe ENTJ talk a lot too?) Or maybe that's just an ADHD exclusive.\nI am very inclusive to everybody I meet. I very much was the guy in \"every cliche\" in high school and got homecoming king. But at the same time, I do also only prefer to surround myself with those who are on the page as me career/personal growth wise.\nEverything on ENTJ description is 100% spot on to me, and my girlfriend was just laughing so much at how she could think I was an ENFP. The ENTJ that doesn't resonate with me is the \"strict\" rational/logic thinking, and heavy organization. I am huge on rational thinking and logic, but its equal if not slightly under putting other peoples emotions into the mix of my decisions. I am highly organized and detail oriented, but only in the work place. At home its my INFJ who's nagging me to get on the dishes and take the dogs out all day.\n\nI had never really dug into ENTJ before, but as I read it (on the 16 personalities website) a lot of it resonates with me, however ENTJ is painted as basically \"The brash asshole\" and I feel I have more emotion and empathy towards others than that. However after reading the typing to my INFJ girlfriend, and then reading through a ton of ENTJ/INFJ relationship posts online, she gave me a 100% without a doubt I am an ENTJ, so now I am confused on which one I am!\nOn the ENFP side, as you can see I like to use words like \"I feel\", when speaking. In the workplace, I am highly ambitious for leadership positions. It would be and had been in the past very difficult to be in a subordinate position for me. I have an intense ambition in the workplace, and have no issue with firing people (I call it, letting people realize they've fired themselves), or with having difficult conversations. I feel the emotions in my gut around a difficult conversation I have looming with an employee, but it's never stopped me or altered the conversation I had planned. I really resonated with ENTJ identifying processes and making them more efficient, coaching and improving those around me and that's one of my standout features in my corporate success thus far.\nMy girlfriend (Long time girlfriend, we have kids, just aren't into marriage) after reading her the ENTJ, and ENFP blind, chose ENTJ on every single category. I even asked her if I was more like Steve Jobs, or ellen degeres, will smith or gordon ramsey etc.. and she chose the ENTJ celebrities. I also admit I resonate with them more too, but I am struggling with the fact that I am not empathetic, and an asshole.\nThe only other holdup is that I have to work for time management and routines. It is not a natural process for me like it should be with an ENTJ, however that is also a thing with ADHD. To be clear, I am obsessed with time management, and workplace productivity/organization. Almost obsessed with it, but it's something I can't do naturally, as I get sidetracked easily. I am big picture oriented, but also obsessive about the details. Thanks for staying with me this long if you have. I resonate with certain things on ENFP, but when it comes to the workplace, and parenting in particular, I am 0% ENFP, and 100% ENTJ according to all the descriptions and research I've done on it.\nTLDR: Read the bullet points above and determine if I'm an ENFP, or ENTJ with ADHD.\n\n"}, {"title": "How do you trust your gut feeling? (self.entj)", "likes": "5", "comments": "5", "content": "introverted intuition is super powerful tool.\nI don't trust my gut feeling, and when I do, things becomes much worse.\nBUT there are few times where I don't have any option to choose other than trusting it, these REALLY FEW times I almost never get It wrong.\nSo what would you suggest to an ISTJ to be able to emulate strategic Ni? how can I develop It?\nWhen I use Si/Ne axis to predict the future I feel much more comfortable and confident in my decisions, how can I feel the same for my unconscious Ni/Se axis? is this even possible?\n\n"}, {"title": "How many of you are ENTJ-A vs. ENTJ-T? (self.entj)", "likes": "8", "comments": "9", "content": "View Poll\n\n"}, {"title": "Having really tough time with controlling my anger and ambition (self.entj)", "likes": "12", "comments": "12", "content": "Even if you don’t have hard times with your anger management can you please help me find the best solution for this weakness because it’s hurting me both emotionally and physically. \nMy hands start to shake, my breathing tempo goes crazy and I see red when someone or something beats (or angers) me at anything. And that nearly ALWAYS makes me lose or hurt someone. I looked at some articles and book summaries but idk..\nENTJ traits shows that emotions like anger don’t usually drives/motivates us because ENTJs now better..and that’s true I see it with my eyes every day here. \nThat’s why I decided to post this here in the ENTJ subreddit.\nMy questions are:\n-Have you ever had problems with your anger or ambition?\n-If you’ve had did you try to fix it? How did it go? Were you successful at the end?\n\n"}, {"title": "Learning is living (self.entj)", "likes": "4", "comments": "2", "content": "I believe that learning is a discipline and the objective of this art is to know how to think. By knowing how to think, you are limitless in what you can learn. Learning also never stops. It does not stop after school, it does not stop after you get your first job, and it does not stop after you become CEO and king of the world. You need to apply learning in order to truly understand, grow, think creatively, and appreciate any subject. It allows you to be adaptable to all kinds of situations, be unrestrained in your options and pursuits, and find fulfillment in your new adventures. It is a way for you to progress and discover meaning in life. In this sense, learning should be a habit and a never-ending constant, not a means towards an end. \nLearning is an universal skill that can be applied to every aspect of life. You can learn art to understand the underlying meaning of a painting to appreciate its beauty. You can learn a language and history to vicariously experience the complexity of another culture. You can learn philosophy to dive into the depth of your inner world. Learning also allows you to excel in any new job or stay ahead of the curve in a new industry. If you are competent in only one skill, then you will only be able to thrive in that niche. If you are competent in learning, you will excel in any subject and expand the horizon of possibilities and paths in your life. Those with poor learning skills will be unable to grasp new subjects, lower their ceiling for potential and growth, limited in their choices in life, and unable to understand and thus appreciate what life has to offer. \nKnowing how to learn is like wearing a pair of glasses that gives you perfect vision. It allows you to see your surroundings clearly. You are sure of the colors, shapes, sizes, distances, and functions of the world around you. With perfect eyesight, you know you can walk down a certain path because you can see what lies ahead, you know you can jump over a fence because it’s not that tall, you know not to anger your neighbor’s dog because you saw it biting a stranger, you know you can sail to the island a mile away because you can see how close it is and have seen with your own eyes others do it with ease, and you know a butterfly is reborn after struggling to break out of its chrysalis because you have seen the time lapse of all the stages leading up to its transformation. You are unbound by what you can do and imagine, be able to appreciate new experiences, and understand and piece together all the parts of the world and how it works because you are able to see them clearly. No matter where you venture in life, you will be able to fully soak in the new experience, be aware of your new surroundings, take in the exciting potentials of the new journey, and grow as a person.\nWithout glasses, you will have a poor vision and can not see clearly the world around you. It appears blurry so you are unable to see reality, you can not comprehend what the world looks like, and you have no idea of what is possible. This hinders your imagination of what you can do, your growing knowledge of the world, and the level of fulfillment you get from new experiences. You are afraid to walk down on a pathway because you can not see what lies ahead of you, you are scared to paddle to the island across from you because you could not see how close it is, how calm the sea is, and how easy it is for others to make that journey. You do not dare explore the world outside the comfort of your home. Without glasses, you will be confined to the comforts of your home and afraid to step outside. Even if you were to pursue a new adventure, you will fail to adapt to your new surroundings, expose yourself to danger, be incapable of seeing and understanding your new journey, and thus unable to have any meaningful experience and self growth. \nLearning is just like being able to see. If you know how to learn you can then adapt to any situation, experience, and cycles of the world, even if they have never happened before- your potential in life is infinite. Therefore, learning should be a discipline, habit, or virtue, and not a phase. It makes you grow as a person and makes you adaptable to the waves of life. If you know only one skill, you rely on that knowledge to thrive and you are confined to the circle of that niche world. If you know how to learn, then you are able to step outside, pick up new skills, knowledge, perceptions, and expand your circle of possibilities in life. You will be able to adapt and excel no matter what you choose to do, where you choose to go, and no matter the difficulties you face. \nIf you know how to learn and think, you will continuously absorb and grow as a person as you chase after your dreams and your vision of what life should be. Eventually you will completely fill the jar of your life with marbles of beautiful, meaningful, and fulfilling memories and appreciation of the world. \n\n"}, {"title": "That was unexpected (self.entj)", "likes": "6", "comments": "8", "content": "I am back on Reddit after an extended vacation.  I thought I would check and see how others are doing.  \nI think I expected smooth sailing during our households quarantine.  I (embarrassingly) of course had everything ready years in advance, have a house full of introverts and tons and tons of work to keep me busy and out of everyone’s solitary way.  \nWhat I hadn’t counted on was my household of introverts losing their ship.  \nI haven’t had the time to touch my work or enjoy the massive time bonus.  I suddenly have had to become an untrained therapist, concierge, and full time maid.   \nI thought they would be in their element but they seemed to have all lost their minds a bit.  The waves of emotions coming off my introverted family members is all over the place. Their insomnia, restlessness, has amped up.  \nSo I am working double the amount I was before.  They have never really wanted to hang out with me in the past but now I can’t seem to go from one room to the other without them needing me for something or wanting me to entertain them.    \nI love them, and I guess gotta do what needs to be done but is anyone else experiencing anything kinda similar?\n\n"}, {"title": "How do you see the difference between ENTJ's parent Ni and critic Ne? (self.entj)", "likes": "7", "comments": "15", "content": ""}, {"title": "Reading habits (self.entj)", "likes": "11", "comments": "9", "content": "So, I'm working on processing something out and figured I'd dump my thoughts here and bounce things off y'all.\nI've got a friend that's a fascinating ENFJ - amazing writer, avid reader, crafts beautiful abstract worlds that I, honestly, don't always follow or get but it's a trait that I don't have and I'm exploring Fe through him. \nAnywho, we were talking about the reading and he's always asking me if I've read this or that. I've explained to him before that I'm not one who enjoys reading, so he verbally painted me a picture of what he experiences when he reads - tried to take me on the journey of it if you will and I'm just like...'yeah, I don't get that feeling and I don't share that experience.' \nIt got me thinking about the books I have read; most of my high school experience was dealing with SparkNotes and absorbing the infokormation there where many of my teachers legitimately thought I read the book fully because the reports I wrote and I was knowledgable in subsequent conversations over the books. (That is, when I actually participated in school and wasn't skipping classes). \nI've got a fairly nice collection of manga though, and I spent a lot of time reading manga and now that I'm older, and reflecting on my reading preferences, I realize that I preferred manga because it was a more efficient way to absorb a story versus having to read words to paint the picture. \nI haven't read manga in a while and I maybe read (listened to) one book last year, but that's mainly just for fiction stuff. For information, facts, data, I usually research and skim read to absorb what I need in order to understand something, but I also don't really read non-fiction either. I listen to a lot of things and read articles, etc - I find whatever avenue suits me best in the most efficient way to get the information I need. 🤷‍♀️\nAnyways, just curious what y'all's reading habits are or if anyone relates.\n\n"}, {"title": "A sentimental moment (self.entj)", "likes": "34", "comments": "8", "content": "I wish I could be more. I'm doing the best with what I have and the cards I've been dealt. I don't regret anything and I use my time as effectively as I possibly can. I face fear and I take action. But I wish I wasn't human. I know I have to accept it, mental and physical health. But they feel like handicaps. I wish I could do more and possess absolute control over my being. No amount of failure could upset me as much as realising how limited I am in this incarnation. When I die I hope the guy upstairs reincarnates me into something infinite.\nExperiencing a sentimental moment of emptiness.\n\n"}, {"title": "ENTJ & ENFP relationship (self.entj)", "likes": "13", "comments": "22", "content": "I’m an ENTJ female my crush is an ENFP. Do you guys any advice?\n\n"}, {"title": " Another attempt to explain Fi (self.entj)", "likes": "7", "comments": "3", "content": "Emotions in general are never completely inherent, and there always is some external source responsible for catalyzing the appearance of any emotion one has. However, Fi enables any person to have a very savvy finger on the pulse of how external stimuli can affect their own emotional state.\nMuch like Ti is able to detach pure knowledge for knowledge's own sake from external application of that knowledge, Fi is able to detach pure  emotions from the external catalysts for those emotions.\nThe distillation/detachment of emotions from their external catalysts can lead to some pretty cool effects, where an Fi user can use certain  stimuli (in the form of thoughts, experiences, surrounding environment, ideas, memories, etc.) to trigger any emotion at will.\nYou can compare this to how Ti can distill/detach ideas from their external  application in reality, and they can use certain stimuli (in the form  of ideas, axioms, facts, memories, experiences, surrounding environment,  etc.) to reach any logical conclusion at will.\nThis is what xxFPs refer to when they talk about \"organic\" or \"inherent\" emotions, which leads to phrases like \"you just gotta FEEL it from  within\" or \"tap into the fire within you\", etc.\nThat entire process is simply going through the 'bank' of experiences one  has (either past experiences like memories, or present experiences like  certain objects in one's surroundings) and linking a set of experiences  to an emotional state.\nSo when your FP friend has all these arbitrary demands that seem to make no  logical sense such as \"I don't wanna do X, I like Y better\", it probably is because they've figured out that activity Y contains the right  combination of catalysts to maximize their  enjoyment/productivity/internal emotional stability (whatever the FP  friend is looking for at that point in time).\nIt's probably apparent that this process can easily lead to emotional  fragility if unchecked, as it's very likely that FPs can spoil themselves by putting themselves in the optimal environment for their emotional state at all times, which leads to a lower tolerance for discomfort.\nPart of Te development in an FP is willingly putting themselves in more uncomfortable  situations so they can develop emotional \"callouses\", so to speak, and broaden their range of what's comfortable for them. \nOn the flip side of this, Te Doms' calices are so strong, and they've expanded their range of comfort so wide, that they don't have enough of a way to distinguish what affects their emotional state from what doesn't, because in making every experience \"bearable\" or \"comfortable\", they don't know how to differentiate more comfortable situations from less comfortable situations (until after the fact).\n\n"}, {"title": "ENTJ Programmers (self.entj)", "likes": "29", "comments": "59", "content": "Hey there to all my fellow brethren. I am a 20 yo ENTJ and I want to become a programmer but I struggle to focus for long periods of time and there are days when I don't do anything at all. Just procrastinating. I want to see how you guys became programmers and what was your process. \nTell me your story, it would be greatly appreciated.\nWith lots of love to all of you.\n\n"}, {"title": " Is 50 cent character in Starz Power Tv show an Entj? (self.entj)", "likes": "3", "comments": "1", "content": "Is Kanan played by 50 cent in Power an Entj?\n\n"}, {"title": "inquiries about entjs for a comic (self.entj)", "likes": "6", "comments": "14", "content": "I'm creating a comic in which I want the protagonist to be a morally ambiguous entj, if any of you could dm me so I can describe the concept and ask for the advice I would really appreciate that,\nif not, please leave some general tips for writing an entj in the comments\n\n"}, {"title": " Any ENTJ males here with a ENFJ wife/gf?? (self.entj)", "likes": "4", "comments": "3", "content": "My husband and I just discovered our personality types. As it turns out, we’re as similar as we thought we were except I “feel” more and of course he’s more “logical” ... My question is: how is your relationship going? What types of things do you do for each other to appeal to the emotional/logical sides? Any suggestions on how your partner could make your life easier or more positive would be appreciated. If you or your partner battle any type of mental illness, I am especially interested in getting your feedback.. TIA\n\n"}], [{"title": "I am both ENTJ & ENFJ. How do I handle that? (self.entj)", "likes": "0", "comments": "14", "content": "I am 56% thinking and 44% feeling, which is probably why I am not as \"blunt\" as the internet describes ENTJs (unless it's a serious situation affecting my plans, future, projects, efficiency, or time, then I AM A FUCKING MONSTER).\nBut what else should I know about myself? Maybe regarding that I switch between ENTJ & ENFJ depending on the situation?  \nhttps://preview.redd.it/arj2na2necv41.png?width=1211&format=png&auto=webp&s=0b9c2aaf9b59fe756eaf4cceb88b3a09e76597b4\n\n"}, {"title": "ENTJ style? + Movies (self.entj)", "likes": "4", "comments": "33", "content": "So I'm 21 yo male ENTJ that likes such interiors:\nhttps://drive.google.com/open?id=1rePmg8CG0or5_GdaIq5oHkP5PgvjWSaN\nI really will make my home to look like that one day - Do other ENTJs like this too?\n​\nAnd I also like movies that have such style, people and all:\nAmerican Pastoral 2016\nLegend 2015\n​\nDo you know any movies that also suit such style? I love them!\n\n"}, {"title": "What Factors Best Predict MBTI Type? (self.entj)", "likes": "5", "comments": "3", "content": "Good Afternoon ENTJs, \nI am interested in studying what types of factors often correlate to MBTI type. In other words, what stereotypes are most likely to be true of MBTI types in terms of hobbies, interests, and relationships? Your input as an ENTJ is greatly appreciated.\nIf you want to participate in this brief survey (more than likely only 3 minutes). I would appreciate your input. You will be able to see the results after you complete the survey. Thank you so much for your time!\nhttps://docs.google.com/forms/d/e/1FAIpQLScirNg2LqQGnJWjvxbVQGOmwRRKFJMUMI7PSZykZSrN1FHOYg/viewform?usp=sf_link\n\n"}, {"title": "Do ENTJs hate texting! (self.entj)", "likes": "38", "comments": "63", "content": "One of my best friends I’ve known for years is ENTJ and will rarely respond. It’ll take him a day or two. And even then he will only respond to the last question. It makes me feel not valued. \nBut then we will see each other in person and he will be totally fine and we will laugh and have fun etc. \nWhy is that? How can you tell an ENTJ appreciates you as a friend what are the signs?\n\n"}, {"title": "Being Ambitious (self.entj)", "likes": "11", "comments": "20", "content": "So I recently found out I'm an ENTJ, and then I read through these posts and I saw that I could relate to a lot of them. I don't know much about perfection, but I was an ambitious kid. I always wanted to be the best and beat the best. I set myself huge expectations, of which I have achieved some, but couldn't with others.\nA while ago, I had to introduce myself to my English class in college, and when asked about my aims in life, I said it was to beat the biggest company there is my field of interest, Computer Science. I was told by my friends that it's impossible and I'm being too ambitious. We've all read about someone being ambitious and it being their downfall. But I believe being ambitious isn't a bad thing. Gives you a driving force. I am highly ambitious and I don't think it is a bad thing, but I've been told otherwise always. \nI know I've set a difficult goal to myself, but I'm determined to get it done. It's been done before, and I'll do it again. Is this a wrong attitude? Is being ambitious a bad thing? Should I change this?\n\n"}, {"title": "ENTJs - What songs do you have on repeat in 2020? (self.entj)", "likes": "12", "comments": "37", "content": "I can't stop listening to Jay Z's \"Can I Live\" and Mobb Deep's \"Shook Ones Pt. II.\" Throwbacks aside, I also love The Weeknd's new album After Hours and Roddy Ricch's \"The Box.\" How about you guys? Comment below!\n\n"}, {"title": " Is it wrong to cut people off who don't share the same mindset as you? (self.entj)", "likes": "33", "comments": "25", "content": "I'm a young ENTJ, 19 years of age, so I don't have much life experience. But I know myself that I am always someone who has always wanted a little more out of life, in every way\nAs in I  want to achieve great things and I want to have fantastic experiences as well. As one of my favourite characters (Berlin from La Casa De Papel, a fellow ENTJ) says himself I wanna live life with no regret and   \"enjoy everything at the moment intensely\", living \"life as a fantastic dream [...] with great honesty, without abiding by conventions\". \nBut there are some people in life, you know, long time friends, who don't share these beliefs and vision as me and I feel weighed down by them. People who are just content with living life day to day in a simple and basic manner, kings of the comfort zone.\nAlthough I love them, I feel like I need to branch out from them to get what I want from life. Is this wrong?\n\n"}, {"title": "New Myers-Briggs dating app - So Syncd (self.entj)", "likes": "47", "comments": "31", "content": "Hi! It's Jess (INFP) here. I have recently set up a dating app and website based on Myers-Briggs personality types with my sister Lou (ESFJ). It's called So Syncd. One of my best friends is an ENTJ and she never fails to amaze me. I'm in total awe of your ability to achieve your goals (I have a real soft spot for ENTJs if you can't tell!). \nThe app has only just become available in the app stores (iOS and Android), but we've had thousands of sign ups already.\nFirstly, we wanted to let you know about it because we thought it might be of interest. We've had lots of people get in touch to say they are having some amazing conversations and they've never connected with such great people on a dating app. Most people aren't meeting up in person at the moment due to coronavirus, and of course, safety comes first, but the app usage has gone through the roof as people get to know each other better online and make meaningful connections.\nSecondly, we are refining the UI/UX at the moment and we'd really appreciate any feedback (either on here or at [hello@sosyncd.com](mailto:hello@sosyncd.com)).\nIt's totally free to sign up and it only takes a couple of minutes to do so, if you know your personality type already, which you guys obviously do! You also have the option of searching for specific personality types. You just need to search for So Syncd in the App Store or Play Store or follow the link to the website below.\nWe hope you are safe and well during this challenging time. Jess and Lou x\niOS app link: https://apps.apple.com/gb/app/so-syncd/id1495153823\nAndroid app link: https://play.google.com/store/apps/details?id=com.sosyncd&hl=en\nWebsite link: www.sosyncd.com\n\n"}, {"title": "Must-read books? (self.entj)", "likes": "6", "comments": "17", "content": "I enjoy reading, and have run out of stuff to read in this isolation period - Any books you guys would recommend? I don't like fiction.\n\n"}, {"title": "Any game plans with everyone under lockdown during covid? (self.entj)", "likes": "8", "comments": 0, "content": "Since ENTJs are natural born leaders and live in a world of possibilities where they see all sorts challenges...just wondering if you have any game plans n what are you thinking as far as how to move forward, or how to move forward if things don’t change?\n\n"}, {"title": "Always moving forward (self.entj)", "likes": "27", "comments": "15", "content": "I get excited by new things. Creating new projects, doing something no one has done before, initiating new opportunities, implementing and creating new structures. Like a machine that only moves forward and create progress in the world. Don't get me wrong, I don't like half assing something and I want everything I do to be perfect and complete, but once I've finished a project or implemented a structure, I always seek to for the 'next problem' or 'next project'. I have an urge to always move forward.\nI want to be the reason that drives the world forward. Doing new things, however minimal, that has impact on the world excites me. Whether it's in my personal life and creating events that we haven't done before or in work doing new projects. I don't know many ENTJs IRL besides one friend of mine, and he seems the same way, always doing something that he thinks has impact or meaning for the world or himself, initiating group events for something exciting, new, and fun, and seeking new opportunities and projects. It's like we don't want to get stuck in the 'ways things are', but just want to keep moving forward. \nI'm curious what you guys' thoughts on this are and whether you guys relate.\n\n"}, {"title": " Romance advise from INTP (self.entj)", "likes": "17", "comments": "20", "content": "Me, INTP(17M), have a huge crush on ENTJ(18F) for almost three years now. We're from same school and used to take same classes. I've always been so nervous around her all this time, and we never really talked to each other. She used to ask me math problems (she thinks I'm math genius), but I once unintentionally threw her paper away because I was extremely excited/afraid. She hasnt asked math problems ever since.\n  As an INTP, I did not realize my feelings. I prefered to stare from distance and there has been many times where just a sight of her made my day.I never wanted to ask her out, I had a big goal in my high school anyway. Right after I accomplished my goal, she was in last year of high school. Thats when I first realized I lost two years and now I have only a year, because she was going to study abroad upcoming fall. Also that was when I first knew my feelings for her grew into love. I regret not even being friends with her, we was nearly strangers. Part of the reason why we never talked is that I'm highly introverted and she doesnt really talk to people either (despite being extravert). \n  So I told my two best friends I really liked her, and they was totally shocked. They advised me to confess my feelings for her before too late. So I told her this March about it, and she said \"Wow. That was really unexpected. Hopefully see you after quarantine\". This answer was neither yes or no, and puzzled me ever since. \n  What ENTJ's mean by this? If someone who hardly talked to you confesses his feelings for you, what would you do? And should I ask her out on a date ? She's going abroad to study this August, and I think it's pointless to hang out with her now.\n\n"}, {"title": " Three questions: How do you learn best? What genre of stories do you like? What writing style suits you best in order to enjoy reading a book? (self.entj)", "likes": "5", "comments": "5", "content": "I'm planning or writing a book filled with individual short stories geared specifically for ENTJs. \nOutside of the pure stories, the book will include the path to growth, developing functions, and so on. It'll have actionable advice embedded into the stories. \nAlso, the advice won't be including the idea of functions. It'll just have pure situational perspectives which allow for self-awareness to happen just naturally.\nIn order to write this book in the best way possible for you guys, I'd appreciate if you answered the following questions: How do you learn best?  What genre of stories do you like?  What writing style suits you best in order to enjoy reading a book?\n\n"}, {"title": "Daily Questing (self.entj)", "likes": "3", "comments": "1", "content": "How much do you earn yearly, what do you do for income, and do you like what you do for income?\nIf you could be reborn, what would you ideally be doing in that life?\n\n"}, {"title": "Fear of loosing skills and virtues. (self.entj)", "likes": "4", "comments": "8", "content": "One of my greatest fears, which I face an unruly amount of is the fear of feeling that I'm losing skills or virtues I had gained. I am very self image oriented and that makes me very details about my tendencies and reactions to situations. I also tend to be very overthinking. I am also very future oriented and always working in aid of it, so when I was faced with situations like lisps during narrating a text aloud in class (lisp was due to my braces, but even knowing the cause didn't make the situations any better), and forgetting my vocabulary (spoken and written english is basically what I'll pursue for higher education, so I tend to be very sensitive there) makes me absolutely mad and helpless. I utterly detest this feeling and the more I keep thinking about it, the greater it has been happening to me. So fellow i/entjs, of you've faced a similar situation, please share your experiences, how you are going about it and possibly how you might have got rid of this tendency.\n\n"}, {"title": "Can your type change with age, or for any other reason? (self.entj)", "likes": "3", "comments": "5", "content": "I always tested ENTJ-T. But just recently, in our present shut down status, I took the MB test several more times, and it came up ENFJ every time. The description of the ENFJ (Mentor, Protagonist, Teacher), sounds a lot like the younger me. And I feel perhaps I morphed into the ENTJ-T (Commander, Boss, CEO) out of pure survival which I found myself in early in life, divorced with two kids, then having to go to college and secure a high powered job in Corporate America. Spent decades climbing the corporate ladder. Did quite well for myself, in fact! But now I'm in my early 60's and perhaps the real me is now coming back from the time I abandoned her decades ago?\n\n"}, {"title": "I seek progress (self.entj)", "likes": "6", "comments": "7", "content": "It has always a thing with me since I was very young (I'm still not quite grown up but nevertheless) to seek progress. Earlier it wasn't direct in my face that I was doing so , rather I'd constantly find myself taking quizzes and then searching up the meaning for their results and making the best out of them, and I still do so. This is the very tendency of mine that led me to find my mbti i.e. e/intj (ambivert, I fit perfectly well in both). So fellow entjs, would you say that you always find ways to grow and if so, how do you come about it?\n\n"}, {"title": "Slytherin, e/intj, 3w4, true neutral, what do you say? (self.entj)", "likes": "0", "comments": "2", "content": "I identify as a slytherin with my mbti being e/intj (Iam an ambivert and fit perfectly for the both).\nEnneagram wise I recognize as a 3w4. Being quite young I have yet to see the world and how all my personality traits would add up and hopefully work together in aid of me. So for the experienced readers, please do mention your opinions, tips, advices on how to grow progressively and make the best of what I have!\n\n"}, {"title": "Always in my own thoughts! (self.entj)", "likes": "58", "comments": "28", "content": "I have a hard time listening to (for example) pods because I’m always in my own thoughts. It’s hard to focus on external things because my thoughts are taking over and I “disappear” 100%! \nI appreciate watching people/things around me  and reflecting about their choice of clothing, body language and so on.\nBut most of the time I’m always occupied with my inner world and never get bored. \nDo you recognize yourself?\n\n"}, {"title": "Can we look like ESFP or ESTP’s when we’re at our best? I think so. (self.entj)", "likes": "8", "comments": "11", "content": "Love to hear your replies and thoughts on this one!\nI type as ENTJ but sometimes think and feel like an ESTP or ESFP. \nWhen I’m at my best, I leave work at the door, have a desire to progress into leadership roles (I’m in business, love working with people and numbers) see the people in my life that matter do well and assist where I can in their achievements. I also make time for hobbies and interests outside of work. Time Management is key. I found bringing Love and compassion into my values helped me find more balance and zest for life.\nENTJ, 8w7.\nCrush life your way and have fun. Wohoo!\n\n"}, {"title": "I feel like my family hold me back . (self.entj)", "likes": "20", "comments": "13", "content": "Everyone in my life is so lazy. It honestly worries me because it’s like fighting against a strong current all the time. My family can sit for 6 hours watching the TV every single day, some days they sit for 9 hours watching it in a single go. \nI am here trying to be successful yet my family constantly tell me , “slow down”. , “call it a night” etc. It pisses me off. And the worst thing is, when they feel like being productive it’s alright for them  get up early , it’s alright for them to get the job done , but because they feel like relaxing when I am working, they try and hold me back so they don’t feel guilty about relaxing.\nENTJs , you guys are known to handle situations like this well. What do I do ? I am trapped in this environment 24/7.\n\n"}, {"title": "Achievement unlocked. (self.entj)", "likes": "11", "comments": "6", "content": "Intelligence is important, but like anything else it can be made more efficient or improved upon. Just like goals, intelligence has a watershed moment. It's like an 'achievement unlocked', where you get access to a skill within that subject matter. And that is what my ramble is about today, how intelligence can be improved.   \nIntelligence can be increased through persistence and exposure to an idea until you hit a threshold. Being exposed to a certain idea helps you deduce and formulate a pattern on the subject matter. From there your intuition can function on autopilot even when you're not consciously thinking about the subject matter. Because the subconscious mind is able to detect patterns through exposure from the conscious mind. These patterns help you to think a certain way about the subject in ways other people are not able to see. Exposure and time is what builds your intelligence in the backburner. \nThere is no memory or retentive faculty based on lasting impression. What we designate as memory is but increased responsiveness to repeated stimuli. - Nikola Tesla. \n​\n https://academic.oup.com/cercor/article/16/5/609/276885 \nThis is why persistence is important when trying to achieve a goal. Persistence allows you to gain intelligence in the background. The longer you stick with a subject matter the more intelligent you become. I would like to clarify that I am not talking about wisdom. I'm talking about the creative and inventive faculties of the mind. Experience can help you become pseudo-intelligent and prevent you from making mistakes, but creative intelligence helps you become a forward thinker and design new pathways in uncharted territories. How the subject relates to world and nature, or how it can be manipulated in order to serve mankind and commercialize it to the masses. Time and exposure is what it takes to be able to get your mind to learn how to think.   \nTL:DR; Stick to a subject matter that you have interest in and get smarter.\n-Steve Dobbs rambling\n\n"}, {"title": "Do you ever need to “do it in the moment” (self.entj)", "likes": "62", "comments": "20", "content": "Like cleaning for example. Like you actually feel like cleaning, you’ll do it in the moment and if you don’t do it in the moment you know you’re not gonna do it later? \nOr get a great idea and write it down instantly or youll forget it and get annoyed that you forgot it later?\n\n"}, {"title": "How Many ENTJ’s Work Or Have Hobbies In The Arts? (self.entj)", "likes": "11", "comments": "39", "content": "I’ve been working as a musician for almost 5 years now. I was wondering if there were other ENTJs that work in arts or other unexpected career paths for an ENTJ. I guess people don’t expect ENTJs to work in the arts or be artistic. Tell me if you have a career path in the arts or something like that’s unexpected. What is your career path, what is your work like, and what do you do for your work?\n\n"}, {"title": "Started a soul-sucking job and I'm ready to quit. Am I being a pussy? (self.entj)", "likes": "15", "comments": "53", "content": "As an ENTJ I obviously don't do well at the usual \"clerk\" tasks. Previously, I was an entrepreneur but my company in the events business was slashed because of Corona. I still had a good time there, learnt a lot and was able to let go since this is obviously out of my personal control. No regrets whatsoever. I took an office 9-5 back home to pay the bills. Right now we are home officed but I think the day we have to go back to the actual office marks the day of my resignation.\nMost of my day work consists of copy and pasting data from documents into an excel document. This morning I had to copy and paste 100 files.... There is the occasional E-Mail to write. That's basically it and there is not a lot of room for more responsible tasks (because there are none).  I have to fulfill everything to my superiors minuscule requirements. They don't take any suggestions and I don't blame them as I am the new kid, why would they listen to me? \nMaybe I am being a pussy. I still get paid during a time where many people don't due to a black swan event. Seems like a first world problem and most people don't like what they are doing on a day to day basis. I don't want to be \"most people\", though.\nI have already developed some business ideas and a possible source of income for the time my own business won't provide any money. I feel like this is the path I am destined for, building great products, starting new ventures. When I listened to how people like Kevin O'Leary could not work for someone else, I feel exactly that. Much in the 8w7 way I feel like my own life is taken away by my job, I am not in control and I can't do what I like and what I am good at.\nI feel like all the unfulfilled potential, all the unbound ENTJ energy is being laid in shackles with every stupid, time-consuming meeting and every mundane task. This feels wrong with every fibre of my body. Money is the only reason to keep going but I am not someone who spends big on consumption.\nMy plan is to collect 1 or 2 more paychecks and then ride my unicorn into the sunset. I will have enough savings to \"fail\" for a few years and I am still young. What do you think?\nAs you can see in my history I also had the experience of seeing my father die quite suddenly. This has shown my, like nothing else before, that life is extremely short and can be taken away from you at any time in a blink. And there are limits to what parts of your plans you can fulfil before you land in a wheelchair or just die. So it is better to hammer away early at those goals. And we won't be young forever.\n\n"}], [{"title": "How do you plan stuff out? (self.entj)", "likes": "5", "comments": "7", "content": "Rigorously down to every last detail or you just wing it from time to time? \nMy question is how you manage sudden complications in any well thought out plan and if you just plan at the moment, then how do you manage deadlines and manage to acheive long term plans?\n\n"}, {"title": "After being BORED at home for a month, I've realized how boredom can teach me more about myself and what fulfills me (self.entj)", "likes": "2", "comments": 0, "content": "So many of us have been confined to our homes for some time now and but the truth is that there are only so many Zoom calls and shows on Netflix that you can watch before you’re utterly bored.\nI’ve realized that part of getting over boredom is to begin to get things done that give you a sense of pride or accomplishment. In other words, finding a way to progress with your goals and ambitions.\nOften when we have time on our hands, we fall into patterns of behavior associated with filler activity, otherwise known as “busy work”. We send countless emails, browse social media, or jump from task to task. Instead it would help to let our mind wander so that we can understand exactly “What is causing our boredom.” While boredom and the constant restlessness can be frustrating, I’ve realized that there are also a few benefits of it as well.\n\nThe mind relaxes and allows for more focus eventually\nWe start to think of how we can improve our lives\nWe begin to identify what is causing disappointment in our lives\n\nAnother thing that I want to highlight is the difference between doing and thinking. When we’re bored, we’re only thinking for the most part, but not doing things that are more aligned with our self-fulfillment.\nI break a lot of this down further here - https://www.youtube.com/watch?v=of6wP555A2M&feature=youtu.be\nLet me know if boredom has taught you anything more about yourself.\n\n"}, {"title": "are entjs bad boys? or bad girls? (self.entj)", "likes": "3", "comments": "21", "content": "what hobbies, habits and traits are considered as bad boy or bad girl?\n\n"}, {"title": "High Five? (self.entj)", "likes": "4", "comments": "1", "content": "Anyone here also take the OCEAN (Big 5) Personality test? I'm curious to see if there are any correlations between the two tests.\nThere are 5 dimensions to their test: \nopenness (open to experience) \nconscientiousness (self discipline/ organization)\nextraversion (gaining energy from others)\nagreeableness (agreeing with others) \nneuroticism (prone to stress) \nFor myself, I scored over 84% on openness, conscientiousness, and extraversion. Then, I scored under 30% for agreeableness and neuroticism. \nI assume other ENTJs would score high on conscientiousness and extraversion, yet low on agreeableness. I am unsure about how other ENTJs would score on openness and neuroticism. \nIf you have taken both tests, I'd appreciate your anecdotes.\n\n"}, {"title": "An insightful description of Te-doms from an Fi user's perspective (self.entj)", "likes": "20", "comments": "9", "content": "Credits to u/blomjob for this wonderful story.\nImagine  a sleek and powerful commercial freight train. It has one job: pick up  cargo in Boston, carry it 570 miles to Charleston, making no stops along  the way, and then make the reverse. This train completes that trip  daily, with no problems, working with its conductor to improve its time  and carry load, inching towards perfection.\nThen  one day that train hits a cow in Pittsburgh. Completely pulverizes it,  turning it into an explosion of meat, bone and hide. The train puts on a  brave face, trying to stay its course, keeping in mind the smiling  faces of Charleston, diligently waiting for their cargo. Meanwhile sinew  and entrails start to gum up the machinery.\n“I  would’ve stopped if I had seen it,” the train thinks to itself, “next  time I’ll just be more observant, that will stop the problem.”\nThe  train diligently trudges onward despite the damage, still a gleaming  beacon of industry even bloodied and gummed. When the train gets to  Charleston the conductor hops out and starts to oil the engine, do  regular maintenance work and the like.\n“Hey  there’s cow in your train,” says a little boy with a pinwheel. “I think  that might be bad for it.” The conductor nods to the boy with a smile,  and tells him not to worry.\n“I’ve just checked the engine and the old beauty is in perfect working order.”\n“But there’s like, gross, bloody meat all up in the wheels and bands and things.”\n“I’m sorry, are you the conductor? Because I have a fucking striped hat and my pockets are full of conductor money.”\n“Okay I’m just saying-“\n“I know, it’s sweet of you to worry. But the train is okay.”\nAnd  with that the train picks up its cargo, and makes its way back to  Boston. It trudges through tunnels and hills, across beautiful vistas,  and it even gets a little wistful at the work it’s done. The conductor  keeps it steady and on pace despite not being able to understand why  it’s not quite running at full speed, but he compensates by doubling  down his efforts.\nWhen the train reaches Pittsburgh it hits another cow.\n“God  dammit,” the train thinks, slightly shocked, “I was BEING CAREFUL. WHO  KEEPS PUTTING THESE COWS IN THE ROAD? I work long hours, I grind the  rail everyday, just fine, and now suddenly out of nowhere I’ve got cow  guts in my beautiful machinery. It’s not fair!”\n“I  know it’s not fair,” says the conductor, who can hear the trains  thoughts for the purposes of the metaphor. “Fair doesn’t matter. Boston  matters, and we have cargo to deliver.”\n“NO. I think I want to hit a few more fucking cows,” says the train, in a needlessly terse tone.\n“You don’t mean that, you’re just upset. What you really want is Boston. Boston is where the trip to Charleston starts!”\nThe  train agrees and continues, somewhat hastily, towards the end of the  track. By this point the train is popping and snapping along, there’s so  much cow stuck in it that it might as well be traveling through four  feet of thick swamp mud. The train, exhausted pulls into Boston, and the  conductor is thrilled with another successful trip.\n“Okay, time to get back to Charleston,” says the giddy conductor.\n“What if there are more cows?” thinks the now traumatized train. “And fuck me, I’m barely moving here.”\n“Nonsense!  Let’s get back on the road!” But when the conductor flips his trusty  switches, the train just won’t start. “Now don’t be so difficult, I know  I’m flipping the right switches, we have a Charleston to get to!”\n“Maybe  it’s all the meat in your wheels and stuff,” says pinwheel kid, who now  lives in Boston. “I don’t think you ever really addressed that.”\n“Hey, brat, I love your pinwheel, but I think I know my train best. It can run just fine with the contents of two cows in it.”\n“Okay but you’re an hour late, and i know you have a pocket watch.”\n“Hey how about shut up?”\n“Look  I’m just a kid who likes trains and pinwheels, I’m no expert. But I  think taking a day off to clean your train would make it happier.”\nWith  a long pause the conductor weighs the pros and cons, and, realizing  that his train is slipping behind his standards, lets out a heavy sigh.\n“You  might be right kid. All I want is to get to Charleston quickly,  reliably and with minimal incident. If taking a day off to scrub my  train with a giant toothbrush or something is going to do that for me,  then that’s what I’ll do.”\n“I actually spend a lot of time poking dead things with sticks, would you like some help? I’m kind of a pro.”\nIn  the end, they fixed up the train, and it was better off for it. The  train never truly learned to avoid cows, because it had developed an  almost sick obsession with acting like it wasn’t going to hit them and  then hitting them anyways, but the conductor now knew to remove  carcasses when they came around.\nThe End\nFor  the purposes of this metaphor: The train: ExTJ, The conductor: Te, The journey: Getting shit done, The pinwheel kid: an FP pal with eyes\n\n"}, {"title": "ENTJ’s pursuing career in the scientific or medical fields (self.entj)", "likes": "26", "comments": "21", "content": "It’s clear as day that ENTJ’s strive for leadership roles and naturally fit into corporate world. But for those who decided to work in the scientific or medical field - do you feel like you chose the right career path? If so, what are your further future plans?\n\n"}, {"title": "How do you feel about flattery? (self.entj)", "likes": "12", "comments": "11", "content": "I don’t like it when people try to flatter me but I love flattering other people lol.\n\n"}, {"title": "Do you lose interest in something after achieving 80% competency? (self.entj)", "likes": "81", "comments": "31", "content": "Do you find that after learning a skill or ability to about 80% of perfection, do you rapidly lose interest as the challenge of working out the fundementals or how something works dimishes?   \nFor example: I wanted to learn to mix excellent cocktails, so i taught myself from reddit and books, with some youtube. I got competent enough to open a cocktail bar, without ever having worked in hospitality. Its a successful bar and business. But now it doesnt inspire me to go and run it because the challenge has disappeared, theres no excitement there anymore. Experience shows, it will never likely return to being enjoyable.   \nWhats your experience like with this?\n\n"}, {"title": "Diplomatic comebacks in group settings (self.entj)", "likes": "6", "comments": "7", "content": "What are your go-to techniques or phrases to rein someone or their point in in group settings, but diplomatically?\nI frequently find myself lacking patience in situations where I’m being challenged with irrelevant points or my boundaries are being crossed. Only problem, reacting angrily undermines me or my point and gives credence to the other party, irrespective of the fact that their point might not be not be valid or they’re deliberately trying to have a go at me.\nExample situations:\n1. Someone vehemently challenges something you said with their own, misguided view and tries to rile up the rest of the audience against you.\n2. Someone keeps interrupting a meeting you lead just to speak their own, unwarranted input.\n3. Someone makes a passive-aggressive remark about you or something you said.\n\n"}, {"title": " I am conducting some research. Are you guy **economically** not culturally more left or right wing (self.entj)", "likes": "7", "comments": "23", "content": "I am conducting some research.                              Are you guys economically not culturally more left or right wing\nView Poll\n\n"}, {"title": "Serious Question: If you have to choose another MBTI type to be, what would it be? (self.entj)", "likes": "21", "comments": "69", "content": "Read title. Also, don't say ENTJ.\nEdit: Why? \n\n"}, {"title": "Feeling lazy to start. (self.entj)", "likes": "5", "comments": "11", "content": "I cant get myself to start doing stuff i planned doing beforehand, like studying. Not to be understood wrongly i finish my goals after i start them but i mostly feel too lazy to start finishing my goals, so i mostly end up doing them the last second which turns into an inefficent and not healthy way of progressing towards a goal and getting a far from perfect result. So basically how do i start stuff without my lazyness stopping me\n\n"}, {"title": " ENTJ/ENTP at the same time? (self.entj)", "likes": "8", "comments": "18", "content": "So I did the the personality test like 2 years ago and it came out that I'm ENTJ. I did it once more about 1 month ago and it said ENTP.\n52% P and 48% J\nI got different results because it's so close. \nWhen I got my results I started getting deeper and deeper into the MBTI thing and I found out I don't fully relate to ENTPs, so I decided to join the ENTJ subreddit too. \nIt seems like I have traits from both. Both positive and negative. \nI'm not as disciplined as a true ENTJ, I procrastinate but not as much as a typical ENTP. \nI'm curious, adventure-seeking and innovative (I get tons of new ideas, mostly about business and tech).  [ENTP]\nI'm also analytical and I really like books (and you guys are by far the biggest readers) [ENTJ]\nI'm writing this post for two reasons:\n1. Are there any other people here with a close call on P or J ?\n2. I'm trying to procrastinate less (focus on my studies, workout more, do the boring daily tasks) and also reading more books (I read about 1-2 books/mo and I want to be able to read like 1 book/week). Any tips?\n\n"}, {"title": "Type B ENTJs (self.entj)", "likes": "3", "comments": "9", "content": "Do they exist? Or is this mutaly exclusive?\n\n"}, {"title": "I want a tshirt: “I don’t care I’m an ENTJ” (self.entj)", "likes": "2", "comments": "10", "content": ":)\n\n"}, {"title": "How do you handle ESFJ's? (self.entj)", "likes": "7", "comments": "11", "content": "Vying for leadership, ESFJ very narrow minded, loud, and least intelligent type on average.\n\n"}, {"title": "Lacking intimacy during social distancing (self.entj)", "likes": "3", "comments": "7", "content": "ENTJ (32,m) and I (22,f) are lacking intimacy during social distancing. Haven’t had sex since last month and since then we haven’t tried to be sexual. Is he just not interested?\nI do feel a bit insecure about this. How can I properly communicate this? \nI am struggling to even get things off on my own with the idea that he might not be as interested to even bring things up or consider our pleasures/intimacy as a couple and it’s lowering my drive.\n\n"}, {"title": "Procrastination (self.entj)", "likes": "23", "comments": "19", "content": "I know that we're not always associated with procrastination. However, I almost always leave my work until -- well, I won't say the last moment; it's more like the latest time at which I can start and be confident of finishing by the deadline. Earlier, I wasn't able to properly manage this tendency; now that I have more experience and control, I've been able to get reasonably good results with it. The trick is to be self-aware enough to know how long I'll actually take to complete the work itself. Is there anyone else here who does this, or is it just me?\nEdit: can't read gender symbols; changed my flair accordingly lol\n\n"}, {"title": " To all young ENTJs and non-ENTJs. (self.entj)", "likes": "119", "comments": "50", "content": "One common trait among ENTJs seems to be discipline. But what most people don’t know about us are the sacrifices we make to achieve our goals.\nThe difference between a champion and second place, is that champions put in the work even when they don’t want to. \nThis is one of the things I admire about Floyd Mayweather Jr. His dedication to a perfect boxing record came at a massive cost. He explained that rain or shine, he would be at the gym every day at 5am. He said he would’ve rather been at home sleeping or watching a movie, but he trained anyway.\nThat’s what discipline is all about. Doing the things you absolutely don’t want to do, but doing them anyway.\nRest days are fine. They are used strategically. We are human and need rest.\nBut all in all, we’re miserable most of the time, but it’s a good kind of miserable. Because after putting in hundreds and hundreds of painful hours perfecting our craft or making money, we like hearing “Nice ride”, “I love your house”, or “You’ve been working out.” \nMost of us on this sub don’t fancy too much what other people think, but a nice compliment never hurts, and it only reinforces that our sacrifices are never in vain. \nDo exactly thing you don’t want to do. Yeah, you’ll be miserable. But that misery will help you achieve great things. \nNamaste motherfuckers.\n\n"}, {"title": " INTP-T here,do you guys like intp? If yes why ? (self.entj)", "likes": "13", "comments": "11", "content": ""}, {"title": " Is every human capable of murder? (self.entj)", "likes": "12", "comments": "17", "content": "I'm a forensic psychology student & curious what different MBTIs think about this basic question. I'm asking on multiple MBTI subs. Please only answer if you are an ENTJ. Thanks!\nView Poll\n\n"}, {"title": "What's your greatest weakness? (self.entj)", "likes": "9", "comments": "22", "content": ""}, {"title": "PSA: It killed my soul to talk about my emotions with my SO (self.entj)", "likes": "6", "comments": "7", "content": "How uncomfortable do you guys get when faced with talking about your emotions? Of any kind. \nFor me, I literally get a physical reaction. Like shivers, feeling icky, or even nauseous. \nNow I have a SO. He's amazing (INFJ guy). I'm not used to his sensitive soul but I feel like it's what I need to develop. I recently had to tell him to communicate more with me because \"it makes me feel closer to him when we are apart\"  *blah* - even writing that felt weird. The lack of communication was reeeallly starting to bother me and make me think things that had no basis.\nI'm lucky because he listened and has messaged me every day since I told him how I felt. I guess explaining your emotions to people pays off but still feels weird. We've dated for a total of 6 months and haven't said the \"I love you\"'s yet so we'll see how that goes soon *ugh*.\n\n"}, {"title": " ISTJ AND ENTJ RELATIONSHIPS (self.entj)", "likes": "8", "comments": "15", "content": "Hey \nRecently reconnected with an old friend and he turned out to be An ISTJ \nwe get along surprisingly well although most of our conversations are debate filled \nBut I don’t mind it’s quite enjoyable to see things from his perspective \nI’m also developing a mini crush as well\nWhich is shocking cause most people I’m drawn to romantically are N types \nHe is the only ISTJ I know and so I’m curious \nLemme know as an ENTJ  if you have had any experiences with ISTJs and how they turned out \nEither romantically or In a friendship both as a female and male\n\n"}, {"title": " Social distancing in relationship (self.entj)", "likes": "4", "comments": "15", "content": "ENTJs , how do you keep connection while social distancing apart from your SO? \nDo you text and call more often on a daily basis?\n\n"}], [{"title": "“You don't have to love me. You don't even have to like me. But you will respect me.” (self.entj)", "likes": "24", "comments": "21", "content": "\nKelis, Bossy\n\nWhat are some quotes (from song lyrics, movie or otherwise) that sound quintessentially ENTJ? (Literally or in a tongue-in-cheek way)\n\n"}, {"title": "My dilemma- estj or entj (self.entj)", "likes": "6", "comments": "22", "content": "I have narrowed down my possible mbti types to entj or estj! (It’s possible that I am not entj or estj, too)Here is the key information below!\n-I am a almost antisocial extrovert.  I feel energized around people but I don’t talk to excess or prefer huge groups, I get frustrated easily when people are acting lazy or not trying to do better.\n-my best subjects are in order are science, English and history.\n-I am highly competitive, ambitious and driven.  I love competition and winning.  Everything in my life is working towards my goal and dream job.  I am very blunt and don’t care for others emotions. I am results oriented \n-I am logical and practical.  This makes me lean towards estj, although entjs can be practical.  Something that contradicts this is that I set unrealistic expectations for myself and others. I am not swayed by emotions and am very stoic. \n-I am disciplined and hardworking.  One thing that contradicts this is the fact that I don’t blindly follow people.  I do follow important rules, but I may bend smaller ones. I am very serious and intense and I have a very long attention span.\n-I am overconfident and not the greatest listener.  I am arrogant and sometimes tune out people.  I have a horrible memory and can be self-centered.  \n-I have great foresight and can predict future events. I have random aha moments where I just get a concept.  To go along with this, I plan for the future and prefer to have a schedule and I like order.\n-I often find myself in leadership positions and can be a control freak. I love giving speeches, too. I lead by example and can have a temper, but I am flexible.  I also try to make things more efficient by finding the best way to do something.  I am always trying to optimize the process.\nThank you so much for reading! Hopefully you have come to a conclusion, thanks again!\nEdit:added more about myself to round the description.\n\n"}, {"title": " This current situation (self.entj)", "likes": "9", "comments": "8", "content": "Is it derailing your plans? Corona, international travel limitations, economic plummet. I’m supposed to be starting my website for VA work, shooting portraits for clients, and networking with more other creatives in my nearest urban center like I planned for right now.\nInstead? I can’t reach anyone that isn’t locked up inside, no events, no friends. It doesn’t help I live on my own, and there’s curfews everywhere in my whole region. So, I’m just waiting and continuing with studies and workout routine, but without any of the inspiration and energy as before. \nI’m considered an essential worker so I’m still at the job every day, but just less productive. My efficiency score has gone down; I’m just not motivated as I see no real end goal long or short term for now. All my grand plans revolved around travel and filmmaking, but the future state of many countries and travel itself- is unforeseeable. thus I wait, but depression grows slowly yet surely. \nwhatabouts yourself?\n\n"}, {"title": "Created a Goal-Settting Platform (self.entj)", "likes": "10", "comments": "4", "content": "Hi ENTJ, \nFellow ENTJ-obsessive here, which is most likely the genesis of this project I'm building! \nAnyway, after setting an unfathomable amount of goals for myself that fell by the wayside, I  finally decided to build a social-platform specifically dedicated to goal-setting and tracking, all with social accountability in mind. My original goal was to create a place where I can keep track of all the goals I set for myself (which again, are many), and use the benefits of social accountability to hold me accountable to actually completing said goals. \nToday I launched a v2.0 version of the platform with some much needed updates and improvements, including Teams and better performance-tracking capabilities.\nSince y'all are highly goal-oriented and likely using this quarantine to indulge that ever-burning productivity fire within, it would be awesome to get your thoughts and feedback on where this tool is useful, and where it can improve. \nHere's the site: divuture.com (Diversify Your Future)\nI hope it can be of value to all of your for all of your personal and or professional goals, as well as be a resource for personal development! \nThanks a lot and stay sanitized,\nJake\n\n"}, {"title": "What do ENTJs think of ikigai? (self.entj)", "likes": "7", "comments": "3", "content": "Ikigai is a Japanese concept that means \"a reason for being\". \nThe word refers to having a direction or purpose in life, that which makes one's life worthwhile, and towards which an individual takes spontaneous and willing actions giving them satisfaction and a sense of meaning to life.\nIf you’re feeling lost or unsure about what your ikigai is, there are a number of ways to refocus your mind and purpose.\n“If you find yourself blocked because change is difficult, try adding some new thing to your life: a new hobby, new circle of friends, or a new job on the side,” Hector Garcia suggests.\nIn the culture of Okinawa, ikigai is thought of as \"a reason to get up in the morning\"; that is, a reason to enjoy life. In a TED Talk, National Geographic reporter Dan Buettner suggested ikigai as one of the reasons Okinawan's longevity. One of the five areas Dan Buettner has examined and presented in his book is Okinawa. He studied ikigai philosophy of the inhabitants and mentioned that the Japanese don’t have the desire to retire, people continue to do their favourite job as long as they remain healthy. \nThe word \"ikigai\" sually is used to indicate the source of value in one's life or the things that make one's life worthwhile. It reflects the inner self of an individual and expresses that faithfully, while simultaneously creating a mental state in which the individual feels at ease. Activities that allow one to feel ikigai are never forced on an individual; they are spontaneous, and always undertaken willingly, giving the individual satisfaction and a sense of meaning to life.\nIkigai, is, above all else, a lifestyle that strives to balance the spiritual with the practical.\nThis balance is found at the intersection where your passions and talents converge with the things that the world needs and is willing to pay for.\nWhat are your thoughts, ENTJs?\n\n"}, {"title": "Anyone here a paralegal or in the legal field? (self.entj)", "likes": "7", "comments": "6", "content": "A few months ago, my work had a work counselor come in and put on a career related event, I was given the MBTI test and I was told I was an ENTJ, which I am sure you already assumed since I am here. I am new to all this and thought this would be a good place to get some insight from those with more knowledge.\nWith everything going on, I have had time to think about things and realized I am completely unhappy and unfulfilled in my job. I've taken the past month to dig deep and research to figure out what I want from a career. I have gotten as far as realizing I would really enjoy a job in the legal field. \nIs anyone here a Paralegal or in another position within the field, besides a practicing attorney? I am interested in Paralegal jobs to start but know support roles can be challenging for some entjs and am hoping to get advice from those who were, or are in this role, and how did you fair? \nI am not trying to exclude attorneys but I am not yet committed to 3-4 years of school and debt before knowing it's something I absolutely want to do.\nMaybe I am putting too much into the MBTI test for assistance in helping me decide but hoping some insight would help me along a little.\nTIA!\n\n"}, {"title": " Describe how it is to be an Fi inferior (self.entj)", "likes": "12", "comments": "21", "content": "Hi people, I'm fairly new to MBTI and I've found out that I'm an Fi dom. I'm trying to understand how this function works and I've read quite a few articles.\nBeing an Fi dom i realised that this function is more natural to me so i wanted to understand it from a different perspective, from an inferior users perspective.\n\n"}, {"title": "What are ENTJs like as kids and when did you find out you were one? (self.entj)", "likes": "7", "comments": "12", "content": ""}, {"title": "Goal Execution Suggestions (self.entj)", "likes": "3", "comments": 0, "content": "Hey guys, so I've always been a super-ambitious person, and sometimes I'd make crazy goals for myself that I'd drop due to burnout or general disinterst.\nNow, I've gotten so much better at sticking with my goals as I've grown up, and I've definitely seen a lot of results in my life because of that.\nRight now, I make mini-systems with some of my goals (write x posts a day, study 80 questions a day, etc.). However, other things in life (such as school or work) do come up, so it can be hard to stick to these mini-systems after I fall off for a day or two because of other obligations.\nNow, the simple solution is to make these steps less demanding (80 quesitons to 40 or 20 questions a day), but then I feel like I'm not doing enough to accomplish my goals.\nShould I make a small minumum of work per day and do more if I have time? And how would I do this without feeling like I could've done more?\n(Also it's really cool to see everyone working for their goals in this  subreddit, a bunch of people typed me as an entj-xntj a few days ago and it makes a lot of sense).\n\n"}, {"title": " INTP-T here, is it hard offend entj? (self.entj)", "likes": "4", "comments": "8", "content": "Just curious my fellow intp told this\n\n"}, {"title": "How good is your imagination? (self.entj)", "likes": "19", "comments": "14", "content": "I’ve found that when I’m solving problems or thinking about something someone tells me, I can easily visualize what it is. \nAn example could be someone telling me “we’re a recycling company for new materials and fabrics”. I would be able to imaginatively think of the components of the company and how it operates- the collection of materials, recycling process, and manufacturing into new materials, etc. Then I could immediately identify the problem or think of the right solution- such as the key to the company is efficiency in breaking down and manufacturing the fabrics materials since the collection process could be outsourced. The manufacturing of fabrics would be their comparative advantage.\nNow the solution is very elementary and anyone can probably think of this.The key part is being able to imagine the scenario or problem and I attribute this to my intuition. Just wondering, how good is your imagination?\n\n"}, {"title": "What are your thoughts on chess? (self.entj)", "likes": "10", "comments": "44", "content": "Not an ENTJ here, but I thought it would be interesting to know. I read up that XNTJs do well at chess. Do you think it's the Te and Ni combination?\n\n"}, {"title": "4 class world order (self.entj)", "likes": "8", "comments": "63", "content": "ENTJ at Top management - presidents, prime ministers, CEOs, Managers for all industry types to provide vision and where things should head efficiently.\nENTP at Mid management at all bureaucracy and industry types. Translate ENTJ message to lower hierarchy in a playful manner. I am not so sure we need this type but they are NT so part of family.\nINTJ as dedicated workers who do their task without distraction and work on low level details under supervision of ENTJs. They are happy with deadlines given and salary.\nINTP as Ideas generators. We would breed them to think about new mathematical equations. They will be given all the time, resources and training to think at their own pace.\nWe don't need other types. They create religious problems, genocides, communism, family drama, and rigid social structure. Weed them out through genetic therapy.\nEdit: wow. So many non-ENTJ NTs on this sub!\n\n"}, {"title": "ENTPs make the best comedy (self.entj)", "likes": "3", "comments": "3", "content": "I subscribed to all types of YouTube channels of all kinds. Lately, I have noticed that most of the best comedy and entertainment channels I subscribed to are of ENTPs. This is a trend again and again. They have wonderful art. For example, MaximBady, P4Pakao.\n\n"}, {"title": "Fe as ENTJ (self.entj)", "likes": "9", "comments": "9", "content": "is there anyone here who also has exceptional strong Fe as ENTJ? or maybe another shadow function very well developed? How does this work for you?\n\n"}, {"title": "INTJ is the superior type. Also manga is the supreme fruit. (self.entj)", "likes": "2", "comments": "6", "content": "I met a lot of people and a lot of fruits. INTJ is god. Manga is effortless. All other fruits kneel for manga.\n\n"}, {"title": "The world doesn't care who you are, so adapt to the nature and timing of the world (self.entj)", "likes": "81", "comments": "3", "content": "I have been thinking about and observing successful people in the world and I've noticed that outside the notable and obvious traits such as intellect, drive, will, or other personal factors, one important concept is instrumental for almost all successful individuals. Adapting and doing the right things based what is happening in the world around them and where the world is heading towards - in other words, timing.\nOne key concept in \"The Prince\" by Machiavelli is that being adaptable to the times is what will lead to success. The analogy Machiavelli used was that an aggressive King will be a failed ruler who impoverish his nation and people if he were born in a time of peace, and a soft-nature and contemplative king will destroy his nation if he were born in a time of conflicts and wars.\nThis analogy in essence captures the key Machiavellian concept of adapting to one's situation and the timing of the world. A competent and successful king is one who is Machiavellian. He knows to be aggressive when he senses tension building up in the world around him and sees opportunities which allow him to attack and expand his nation. He knows to focus inward and expand social policies and the economy when in time period of peace and the world around him is stable and governed by alliances.\nI have observed that this notion is true in the real world as well. Those who constantly succeed in life makes the right decisions at the right time. The successful people we read about are the ones who went into the right industries at the right timing for where the world was heading towards.\nBill Gates or Steve Jobs who created their companies when the computer hardware and software industries were primitive and had potential for tremendous growth. Jeff Bezos who created a business on the internet because he saw how fast the internet industry was growing, or Larry Page who also started Google when the internet industry was taking off. Steve Schwarzman who created Blackstone because he saw the timing in the market was right and finance and Wallstreet was expanding rapidly and globally. The list goes on.\nPerhaps many successful individuals, including those I've mentioned above, did not make decisions based on Machiavellian reasons. They were dreamers and idealists pursuing their grand vision regardless of whether the world was truly ready for them or not. However, just because their reasoning wasn't Machiavellian doesn't mean what they did wasn't. In fact, I think that all successful people are Machiavellian in their actions despite some of them not being purposefully so.\nThe point is, being smart and successful is to be opportunistic and aware of the situation one is in and the timing of the world around oneself. Where is the world heading to, what are the right actions to take in this situation, is the timing right? This applies to workplace, schools, as it does in grander pursuits and ambitions in life. Be forceful with a coworker when you need to, take risks when the timing is right, listen attentively and be cooperative in tense situations at work or school, etc. Be entrepreneurial and pursue your dreams in life when the timing is right. For every one Steve Jobs who chased after their dreams of an ideal vision, there are many others who failed because they were born in the wrong time period or their dreams and ideas were too unrealistic and not right for what the world needed at that time.\nWe all have dreams and pursuits in life, and you need a force of will and strong ambitions to succeed, but the key to success is to be aware of yourself and the timing and the world around you. Take control of your own life. Be smart and adaptable so not to let your fate hang on to the hopes of the timing of the world or those around you.\n\n"}, {"title": "Let's speculate (self.entj)", "likes": "4", "comments": "14", "content": "Hey ENTJs,\nAnyone got any fun theories on stocks to keep an eye on at the moment? Not looking for serious investment advice, just wondering what everyone's intuition is telling them.\nI'm looking at infrastructure, expecting some big stimulus projects coming out of lockdowns. The context might be slightly different depending where we are, but would love hear some thoughts.\n\n"}, {"title": "On a high when on stage (self.entj)", "likes": "16", "comments": "9", "content": "Do you also feel on a high when ‘on stage’?\nFor example:\n\nPresenting to a large audience, e.g in a conference\nDelivering training or a class to a large group of people, preferably in a lecture format\nBeing in front of people in any capacity\n\nHad I known how to sing or dance, I’d probably have pursued a career as a pop star.\nThanks for coming to my ENTJ TED Talk.\n\n"}, {"title": "ENTJs are the brute force of nature (self.entj)", "likes": "10", "comments": "8", "content": "They accomplish anything they set their mind on. ANYTHING.\n\n"}, {"title": " INTJ here, how do I be less lazy (inferior Se)? (self.entj)", "likes": "9", "comments": "9", "content": "I recognize one of my major problems is not wanting to do shit, or rather, avoiding things that I believe would stress me out (e.g. situations where I'm not sure what I'm doing or I know would be a headache once I start them because it's never that simple there's always more problems that arise from the one), or things like getting up in the morning and exercising. I mostly attribute it to inferior Se. How do you guys use Se? Any tips on how to stop being lazy?\n\n"}, {"title": "Mastery in Money? (self.entj)", "likes": "2", "comments": "4", "content": "Would you say that it’s possible to ‘master’ the money game like you would with mastering say cooking? I just thought is this a ‘thing’? Idk, would do you think?\n\n"}, {"title": "Job Applicant Assessments as an ENTJ (self.entj)", "likes": "4", "comments": "3", "content": "I'm graduating from college this semester with a degree in finance and throughout my job search have encountered numerous applicant apptitude and personality tests built into the hiring process. I can't help but wonder if my traits as an ENTJ have disqualified my applications from moving forward in the process. Has anyone else had similar thoughts or experiences?\n\n"}, {"title": "How do I convince my ENTJ friend to take care of his health? (self.entj)", "likes": "22", "comments": "21", "content": "He's awesome. He gets shit done.\nAnd he gets shit done on ONE. HOUR. OF. SLEEP.\nI'm worried about him. He'll listen to my points about how important sleep and other things are, but he doesn't change his mind. Thankfully, he said that if I could figure out how to make him not sleep through his alarm without waking other people up, he will get sleep tonight.\nBut everything else right now is work. If it's not an asset, it's not worth his time. With the extra wage he earns from COVID (he works 8 hours a day, sometimes more), and taking extra classes to get an advantage in the business world, he sacrifices almost everything else to fit a behemoth of a schedule into his day, and I couldn't convince him otherwise.\n\n"}, {"title": "Any other ENTJ's feel like this? (self.entj)", "likes": "61", "comments": "30", "content": "Hello fellow ENTJ's!\nSo recently I have gotten into a relationship and realized that I am very insensitive(I knew this for most of my life but it has become painfully obvious to me recently). For example:\nWhenever something unfortunate happens and anyone, it could be my SO or even a friend, and they tell me about it, I often feel like I don't know what to say. I DO care, but I can't emotionally connect with it and have true empathy about the thing that happened to them. The thing about it though is that I really, truly do care. I just don't know what to say and usually resort to saying 'I'm so sorry to hear that, is there anything I can do to help?' but when I say this, it might seem like a pity 'I'm sorry to hear that' because that's what you're supposed to say when someone is grieving about something. \nThe part that I don't get is, why do I know I truly care and feel for them, but I can't find the words that make it sound like I truly mean it?\n\n"}], [{"title": "A poetic description of ENTJ (self.entj)", "likes": 0, "comments": "2", "content": "You are a screaming crowd, the rush of adrenaline pushing you further. The words I will not give up, a business contract with all signatures in place. You are droplets of blood-red ink, and the glint of sunlight off a reflective glass building. You are the gory beauty of a sunset before a storm, the soft certainty of a plant blooming each year. You are a mountain threatening to crumble, and a young tree that refuses to snap in the wind. You, ENTJ, are the confounding fluidity of Strength.\nSource\n\n"}, {"title": "NT brains (self.entj)", "likes": "14", "comments": "26", "content": "Do you ever think ENTJ’s are the stupidest out of the other NT’s? We just have much better social skills and will power that allows us to sufficiently climb hierarchies better \nNot saying we’re stupid, I just think other NT’s wield stronger intellectual power than us\n\n"}, {"title": "INTP. Just Here To Ask Questions Of People Who Actually Get Things Done. (self.entj)", "likes": "10", "comments": "10", "content": "Honest question: How would you advise an INTP with and infinite storm of grand/theoretical ideas but little work ethic to go about getting things done?\n\n"}, {"title": " Are ENTJs really serious about relationships or do they prefer to play the field? (self.entj)", "likes": "8", "comments": "18", "content": "As far as I know ENTJs are rather dedicated and loyal when they enter a relationship as they don’t like to waste their precious time and care immensely about keeping their partner happy. So would it be fair to say that the likelihood an ENTJ would cheat is rather low? And when it comes to a single ENTJ, would they put effort into courting someone if they actually don’t care? Do they enjoy playing the field just for the pleasure of it or is wasting their time on various dead end pursuits beneath their ambition? Lastly, would an ENTJ keep their options open and keep multiple people on a string, each of which are under the impression they are special or exclusive, or is that also too much energy to expend?\n\n"}, {"title": "struggle with close social distances (self.entj)", "likes": "6", "comments": "11", "content": "I hate it when ppl stand close to me or touch me. Normally I keep my distance, but some ppl come and sit next to me to where our bodies touch. I don't mind some close distance with my close ppl who we can hug or sit very close to me. But it's been a struggle where most ppl don't respect my private space. Is there anyone who has the same problem, and how do u deal with it.\n\n"}, {"title": "Conflicting enneagram to ones MBTI (self.entj)", "likes": "5", "comments": "12", "content": "Just took a quickie little internet enneagram test out of curiosity.  I received the number 8.   \nI don’t have the anger issues or the “doesn’t work well with others” that it hints are possible.  \nSo I went looking to read the other number descriptions and I was curious how they interplay with MBTI.\nAre they separate or are they a tool to further laser point in on a personality? \nCould I just as easily have been an ENTJ type 6? (The description of that is a total opposition to my own way of being but is it a thing that an ENTJ can be a type 6 or type 2 or any type really?)\n\n"}], [{"title": "Pretty chill rant (self.entj)", "likes": "56", "comments": "50", "content": "Sup fellow ENTJs\nSo this is a little rant / discussion topic about people\nI want to know if you get this in your life, as most of you know ENTJ's are pretty straight forward (main reason being we want to let people know exactly what we are thinking at the moment we talk to them), I run into the issue more often than not (except with other analyst types) where people don't seem to grasp the seriousness of stuff we say (I don't mean about being super serious people or anything) I mean stuff we say to people in general discussion.\nExamples:\n\nTo someone that annoys you saying something like: \"You are annoying to me because ...\" literally means whatever you are doing/saying grinds me on a super low level and you are quickly becoming someone I don't want to spend time with (because in general we will just ignore silly things and the fact that we speak up about something means we see this as a super serious thing).\nAsking people how they are doing: If we know you on a personal  level to an extent and we casually approach you and ask something like \"Hey are you ok?\" or \"How are you doing\" (obviously not in the context of a casual \"Hey how are you\" friendly greeting in the morning or something) it generally means we can see something is up and we want to listen to you (this also should be a sign that you are an important part of our lives as we generally will tell people we aren't close with to suck shit up) this means we actively saw something is up and are making an effort to comfort / help (yes I know this sounds too wholesome to be ENTJ BUT ...)\nSaying I love you (Romantic or Friendship): This is a serious one, most ENTJ's will probably agree most with this point but making acquaintances is a very simple task for us, we can adapt to whatever you might find interesting and get to know a bunch of people on a very shallow level (for a bunch of reasons that I will not discuss here today ;p) BUT if we actively spend time with you and want to spend a metric boatload of time with you (I know we also have a tendency to overindulge so we might overstay our welcome with most people) this generally means that we find you incredibly interesting and intriguing. This is when we will put in an insane amount of effort to keep you close, the next step is when we say something (this obviously only happens after we know you and feel like you could be in our lives for/ever - a long time) and we say something like \"I love you\" or \"You aren't a friend you are family\" this is something very serious as with us saying that we value you literally on the level that people value blood relation (or perhaps even more).\nSaying we don't want to talk about something right now: This one is tough, we want to listen to peoples problems cause we like feeling like that solid rock that people can lean on, but it takes quite a bit of trust for us to just casually talk about shit, the 2 best approaches for anyone else to us is to 1 respect what we say and let us try and deal with it on our own terms (this is not the most healthy option for us to be completely honest) OR if you can be more assertive than us make us talk to you (for me and most of the ENTJ's i know IRL you pushing us to talk shows us that you actually care), this is cause we will generally fight back and people that only want to know gossipy stuff about you will probably give up after a little bit of us fighting back where as people that really care about us will know that we are talking shit and dealing with something and then force us to cope with it. This level of investment from the other person shows us that we are valued and we will be much more likely to open up (but probably only if we have already started trusting this person).\n\nUsing these (not so) short examples the point I want to make is ENTJ's don't just say things to say things, when we say something there is more than likely at least a few reasons making us say something, whether it be in terms of affection or dislike and lastly on top of all this seriousness we will give you 110% of it, if we say you are important we will hit you with a lot of affection and time cause we see you as worth the investment, if we say you are a tool we will tell you and probably actively try and make you fix your shit OR avoid you cause we don't even think you are worth the time. \nWe are people of \"Quality vs Quantity\" so we tend to filter through people and only keep the ones we really think are worth it\n​\nTL;DR When we say things we really mean what we say and there definitely was a fair bit of thought behind the reason for saying it \nNow for the discussion part - Do you guys have similar experiences where people just don't seem to get what you are saying ? What kinds of topics cause this the most  ? Any random thoughts or input ?\n\n"}, {"title": "Anyone else learn through understanding process instead of memorizing? (self.entj)", "likes": "80", "comments": "34", "content": "I would process information and then ask why or how the solution/answer is that- to figure out the process. Then later on, I would not remember exactly the process of how I came to that conclusion but I would just come to “know and understand” the material/answer. It would actually take me more effort to try and explain again why/what the understanding process is as I’ve forgotten it.\nEssentially, when I learn, I’m not good at memorizing all the details but instead I look to figure out the process and then I would just “know and understand” the solution instead of being able to just memorize the process and solution- as if the process is vaguely in the back of my mind.\nNot sure if anyone else can relate.\n\n"}, {"title": "A short appreciation letter to all of the wonderful ENTJ's out there. (self.entj)", "likes": "113", "comments": "91", "content": "Dear ENTJ's,\nAs an INFP, I just want to let you know how much I appreciate your type. You all aren't just leaders, doers, thinkers and businessmen/women. You aren't just people who take action and do what needs to be done. You are also people of strong character, confidence, and people with a great capacity to understand and appreciate others, even if it is not in the conventional sense. You have the ability to see through situations without letting emotions cloud your judgement. You often don't feel human in a world full of feelers, you are so misunderstood. You may sometimes feel like you are nothing but a machine, but you are so much more than that! You do have feelings, you do get happy, sad, angry, scared, because you ARE a human, but you save this sacred part of yourself only for those who truly deserve to experience it. Your sentimental streak is strong and when you care about someone, you are fiercely loyal. You can hold amazingly deep and intellectual conversations, you are incredibly creative and can always be trusted to find the solution to a problem. You are amazing friends, family members, coworkers, artists, intellectuals, leaders, and lovers. This world is crazy, chaotic, lovely, and beautiful, and you are the ones who have the capacity to lead this world towards a better future. \nAnd for those reasons, you are my favorite type. \nI hope this helps you to feel a little better about yourself today! I truly do love you all!\nSincerely, an INFP :)\nEdit: Thank you so much for a platinum!!! I have never gotten this before, but honestly, I had a weird Raven Simone moment where I saw myself getting a platinum and then it just happened just now???? I don't deserve this at all, thank you!! You are all so wonderful!\n\n"}, {"title": "Last night I had an epiphany (self.entj)", "likes": "133", "comments": "26", "content": "We all have a “fire” deep down inside of us. \nIt pushes you to achieve more, it prompts you to always be prepared, and will never let you forget past failures/shortcomings. \nLast night I had this realization: that same fire that drives us to be “better,” won’t allow us to enjoy it when life actually is “better”.\nI was at a “daddy-daughter dance” put on by my little girl’s school. I tried to just “take it all in” for a minute. \nI thought to myself ”you made it. Despite your ‘unstable childhood’ and ‘lack of guidance’, you fucking made it. You have a wonderful wife that would do anything for you, you’re homeowner, and you’ve established a strong career for yourself. You’re with your beautiful 5-year old daughter who thinks you hung the moon. Is this dance a little over the top? Of course, but it’s what you expect from a private school. And hey, you’re here because you’re able to afford private school.”\nBut I just couldn’t. I couldn’t just relax and live in the moment. I was able to go through the motions, but in the back of my mind I knew the truth.\nYou see, the thing about that “fire” is it simultaneously feeds both our confidence and our anxieties.  \nIt’ll damn sure push you to achieve all you want, but it will also remind you that it could all be taken away. So you better do everything in your power to not allow that to happen. You need to prepared for any scenario, and control everything you possibly can.\nThe stress it gives is small, it’s just enough so that you’re constantly focused.\nWe do everything in our power to create the best life possible for our loved-ones, and we want nothing more than to solve every problem they have.\nIt’s the only way we know how to show we care. It’s the only way we know how to show love.\n\n"}, {"title": "Detachment from Ego (self.entj)", "likes": "78", "comments": "26", "content": "Something I've noticed about myself and other ENTJ's is that we tend to view ourselves as vessels that exist to be optimized and made as best as possible in all areas.  I think this leads us to being detached (to an extent) from our opinions and values on a personal level, which is the root of a lot of the stereotypes for ENTJ's.  What a lot of people perceive to be arrogance is really just us voicing opinions that we believe to be empirically correct after lots of research/consideration, not an extension of ego. \nFor example, I remember a time years ago in Middle School when a teacher prefaced the Greek myth of Narcissus by semi-joking to the class that the story would really resonate with me.  I was totally shocked and embarrassed by that at the time, as my thought processes were, and still are, not narcissistic in the slightest.   Looking back, my young and untamed assertiveness probably rubbed people the wrong way at times.  \nENTJ's are obsessed with self-improvement and making others better (basically striving for maximum efficiency), and I think a lot of the time this gets misconstrued as egotistical behavior.  Generally when we claim to be correct about something, or take a leadership position, it's because we think we're the best option in a particular scenario to maximize outcomes. Contrary to popular belief, I think a lot of us become fairly detached from our egos as we grow and mature.  This is part of why we hardly ever take personal offense to criticism and expect the same from others. \n​\nDoes this sound accurate to your experiences as ENTJ's? \n​\n\n"}], [{"title": "Empathy. (self.entj)", "likes": "116", "comments": "52", "content": "Can we stop with the whole ENTJs-Are-Sociopathic-Robotic-Narcississts-And-We're-Proud-And-Everyone-Else-Sucks dialogue?   \nRelationships with people are important. Circle jerking about how robotic and cold we are isn't healthy, and doesn't really serve a purpose. Acknowledging that we sometimes struggle to tap into our empathetic sides is totally fine, but I'm really disturbed by the way this subreddit glorifies it. It's not a badge of superiority. It's a characteristic that can cause us harm if we don't actively acknowledge the damage it can cause to our own lives and to those around us.   \nLearning about your MTBI type isn't the same as taking a \"Which Harry Potter Character Are You?\" quiz on facebook. You're not stuck being Neville Longbottom and that's that. Learning about our MTBI types is an opportunity for personal growth and development. It's a chance to learn about our strengths, but also to address some of the challenges our personality types bring to the table. And it's a chance to work towards tweaking some of our actions and behaviors associated with those challenges, for the sake of bettering our lives and the lives of those around us.   \nAnyway, just wanted to get that off my chest. It's been buggin.'\n\n"}]]}