{"data": [[{"title": " Behave like ENTP online, awkward as an INTP irl (self.entp)", "likes": "11", "comments": "8", "content": "I've noticed that on Online medias, I do like to socialize and meet new people. Share videos, make calls, begin conversations with strangers, debate random stuff, troll and stuff.\nBUT, in real life I remain a Introvert bastard, only talking when someone talks, avoiding contact at all. And  the major stuff  : Dislike of Physical contact.\nI have no idea whether this is Inferior Si, or if I'm just fucked up mentally, but I dislike friendly intimacy, like touches that people do when laughing together, hugs, pushes, taps, you get it. \nI mean, when I got into college, I was super social, talking to everyone, but as soon the \"physical plays\" like pushes, taps, etc, I taked that as bullying or so, due to past highschool experiences, and isolated myself.\nStereotype asides, I find this really weird, enjoying exploring the world and meeting people, doing stuff, being in parties, debating, but somehow reluctant of physical touch. I don't know if I'm INTP or ENTP only due do this duality.\n\n"}, {"title": " Keeping old stuff (from school, 'the past', etc) - do you fellow ENTPs tend to keep stuff like this? Do you ever go back to it and if so, do you toss it out much later? And any sense of nostalgia? (self.entp)", "likes": "18", "comments": "10", "content": "Hey, so I am currently confined to the house because of virus related lockdown and taking the opportunity to go all Marie Kondo and finally clear out my shit. I've been feeling for a long time that the amount of mess around me is a burden on my state of mental wellbeing*, as it seems quite 'oppressive' and so on... but somehow always a little too lazy to do anything about it. I left home at 18 and I'm now 37, and while I don't think I still have anything from the original \"my first place\", I have been in the habit of boxing up miscellaneous stuff and moving it from place to place, rather than purging as I went.\n[* I am always hyper-aware of my surroundings, have above average situational awareness and so on. It isn't anything \"new age\" about being burdened down by possessions but more literally that I don't have a clear field of vision... everything in a 180 degrees around me is mess.]\nIt's a major point of conflict between me and my (INTJ) partner, who has a much more \"minimalist\" approach, and also he went through a similar phase about 5 years ago in which he tossed out all his stuff and basically started again. He doesn't understand why I would keep anything from exes, school, etc. (He also doesn't see how it is possible to remain friends with exes, which is a whole other thing!)\nI wouldn't categorise myself as a \"hoarder\" -- although my house (when I lived on my own) might have resembled some of those 'Hoarders' tv programs it's a different motivation ... often I just can't find the energy to throw things out, but when I get into the mood for it I am quite happy to toss things. I don't hold on to them just because \"this might be useful in the future\" or \"fear of scarcity\" or stuff like that. If I could pay a \"professional declutterer\" to come and help me out I would, but my INTJ-partner insisted that I need to work through this myself rather than take the 'shortcut' of throwing money at it and getting someone else to do it for me. (He's said similar things about \"outsourcing\" the mental work of doing something myself to others in other situations as well. He believes very much that you have to \"work through\" the thing rather than just offload it, in order to Be Better.)\nSo my question to you guys is - what do you think/feel about holding on to relics of the past? It could be things like notebooks from school, old photos, letters, a few clothes that no longer fit (not a whole wardrobe's worth, and the motivation is in preserving the memory rather than thinking I'll actually wear them again). Even things like old files on computers, you know how it is when you get a new computer and have to copy all the files over from folders like 'backup 2 final'.\nMy mom kept all my old school stuff, and passed it on to me a few years ago. I'm not going to get rid of that, mostly because when I was reading it some of the stuff was really funny and/or I remembered it in some way and it was just a blast from the past.\nBut I have been tossing out and deleting stuff from the \"more recent\" past, say from about 10 years ago, that I did go through in a previous purge and decided to keep but now can't think why. Things that were related to me and my ex (long term relationship, 15 years) because although the relationship ended I still had fond memories of that time.\n(As an aside... I lost (in embarrassing circumstances) the memory card from my phone which had the last \"selfies\" my ex and I took of ourselves as he was leaving, as it was sort of a sentimental moment. I felt stupid about that, and vaguely emotional once but then nothing.)\nSometimes I've an urge to \"return to the past\" a bit (seems unusual for an ENTP on the surface (insert \"Is this Si?\" butterfly meme), but I am still sure of my type).\nLast year, for example, I went to a 20 year (has it been that long!) \"Class of 1999\" school reunion. I'd been looking forward to it for a while -- the reunion is held in the school itself, and I was curious to see how much had changed in 10 years (since I went to the 10 year reunion) and also, maybe, to \"re-experience\" some of the good things that went on there. Of course, it had changed a lot, but many of the places were still recognisable although they seemed much smaller than they had at the time (keeping in mind I was 17, not a kid, and pretty much the same physical height and size as I am now at 37).\n​\nTL;DR : how do you guys feel about 'nostalgia'? Do you feel any urge to keep old stuff, to 'return to the past' in some way? Have you tossed things and regretted it later?\n\n"}, {"title": " Avoiding manipulation? (self.entp)", "likes": "6", "comments": "9", "content": "Hey everyone\nSo lately I've been more conscious of the way I treat others and I'm starting to realize what a shitty person I really am. I have an INFJ boyfriend and I find that whenever I really want something out of him I fall into unhealthy manipulation tactics, then once it's all said and done I feel like a total asswipe and think about what I could've done differently.\nHas anyone else been part of this abuse cycle as the perpetrator? How did you break out of it and what are some first steps to take to change myself for the better? I don't like being part of the evil manipulative Satan stereotype, yet it's been who I am for longer than I remember, but I only realized it until recently.\n\n"}, {"title": " Iq and depression (self.entp)", "likes": "6", "comments": "6", "content": "I recommend watching from minute 50-60 but at around minute 53 jordan Peterson suggests that religion is for those that are stupid and dumb ppl should follow a more conservative approach. What do you guys think about that? \nAnd this leads me to wonder, are ppl with low iq more likely to have mental health issues and be in need of abstract systems like religion to help keep their moods regulated while the more intelligent people don't need it as much since they are more say, mentally durable and can withstand the hardships that are caused by the complexity of life simply by virtue of a high iq. Could be why ppl with high iq live healthier happier lives. Ik this is a dangerous thought and that ppl for some reason say smart ppl are more likely to have mental health issues and i don't think that might be the case. \nCan we try and view this other perspective? \nhttps://youtu.be/PqpYxD71hJU\n\n"}, {"title": " I wanna be friends with an ENTP (from INFP) (self.entp)", "likes": "33", "comments": "68", "content": "So, the ENTP I'm talking about is 16 year old male and he plays trombone with me in band and stuff. We're the only 2 trombones and I find it ironic that I'm closer to the 2 trumpets than my own section leader. I'm 14 female. \nI'm bad at socialising face to face but I'm good at talking online. Since we have been in quarantine for more than a month, I reached out to him, and asked random questions about himself and talked about trombone stuff, but his answers were usually pretty short. The only time we had a proper conversation was when we were talking about unis and colleges. \nBtw I do not have a crush on him. It's more like a squish. \nDoes he just hate me or smth? He's literally the only person I can't decipher. \nThank you in advance!\nPS ENTPs are so cool!!!\n\n"}, {"title": " Entp males holler @ me (self.entp)", "likes": "6", "comments": "19", "content": "So I've been filling the void recently with \"Community\" and it's definitely a new TV show obsession. Also, I cannot resist the charm of the lead man, Jeff (played by joel mchale) and I am sure he is an ENTP. \nI'm a 23 y/o INFJ female and had a really close ENTP friend I met in high school. We still love each other even though we don't hang out as often today. She was an outcast and other girls talk crap about her. But I never really cared because what I loved about her was her honesty and some girls (esp high school girls) just can't handle that shit and just can't read between the lines the way she does.\nAnyway I don't think I've ever met an ENTP male in real life, and I've really been into ENTP males I've seen on tv (characters, actors, comedians). Sad cause I hope I get to meet one of y'all irl. Y'all are smart, witty, real af and it's probs most in my fantasies but I would really just wanna get to know one.\nSo, to all entp males out there, have u been in relatio ships with infj females? How was it like? What did you like about her? From your own different perspectives, maybe you have some insights about infjs that would help them navigate through life easier? \nCheers, stay you! 🙏\n\n"}, {"title": " Do ENTPs get along with fellow ENTPs? (self.entp)", "likes": "8", "comments": "12", "content": "I never knowingly met another entp, but i have spoken to people who i suspect might be entp.\nI feel like we get along in one on one conversation, but i feel that if i were to be in a group it would feel like we're stealing each other's spotlights, since we'd both be \"the wild card\" and we both sort of thrive within groups of introverts, so i think that would go south pretty quick.\nWhat are your options on that?\n\n"}, {"title": " Any Assassins Creed fans in here? (self.entp)", "likes": "16", "comments": "13", "content": "Which is your favorite? Would you recommend it?\n\n"}, {"title": " So like what's the point? Just a place for ENTPs to have a friendly debate (or as other types call it \"a fight\")? (self.entp)", "likes": "3", "comments": "4", "content": "(Also do u think ENTPs and ESTPs are similiar? I find myself relate to both)\n\n"}, {"title": " Do You Think He (ENTP) Will Come Back to Get Me (INFJ)? (self.entp)", "likes": "35", "comments": "78", "content": "Background: I'm 32, he's almost 34. Known each other for 6 yrs. We're colleagues at a university in the college of engineering. I advise students; he's an engineering lab tech. He's currently using his employee tuition waiver benefits to get his master's degree.\nEvent that set things in motion recently: Last Nov. (2019), he and I hung out in his lab office, following an after-hours work mixer. Although we knew each other well enough in a co-worker capacity heretofore, this was the first time that we had uninterrupted time to talk.\nAnd wow, did we talk! We were also a bit tipsy. So I worked with my liquid courage, and admitted I had a crush on him. To which he answered by kissing me, and saying:\n\"What do you think I was trying to do 3 years ago when I invited you out for my 30th birthday?!\" (Summer of 2016)\nI wasn't able to join him back then, so I never found out that's what he was up to!\nAnyways, immediately after that he said in a nerve-wracked, word-vomit fashion:\n\"But...but...but...I can't go past this point, I'm super stressed out and spread thin between work, and getting my master's...and my sister's an asshole who's got 3 kids by 3 different guys, and I'm like their dad...and...and...\"\nI just prematurely reassured him that I was having a great time being in the moment with him, and I that I wasn't asking him for anything. And then we spent the rest of the night either in deep conversation, laughter, or making out till 2am on a work night.\nBUT...of course I want me some more of that sweet, sweet ENTP! He knows that now, and has restated his position of being spread too thin to start something new. He hasn't made any promises; he hasn't said yes, and he hasn't said no. He hasn't told me to wait, but he also hasn't said he's not interested.\nWe've gone out for drinks a couple times since then, and always talked animatedly for hours and end up making out. But we came to the agreement that we could not continue to torture ourselves like that.\nAnd now that we're in quarantine, we've come to the agreement not to text, because it just feels like the virtual equivalent of that torture. \nI'm the one who asked for that boundary when I said: \"If you should want to reach out for me, to open a window of romantic opportunity, I feel open and receptive to you.\"\nHere's some other things he's told me:\n\"I have ALWAYS found you VERY attractive.\" & \"You're hot.\"\n\"I've always thought we've had mutual attraction, chemistry, and banter.\"\n(When I asked him if and what he replays from our interactions):\n\"I recall our kissing is pretty damn synced, so it feels sexy and passionate. I always remember feeling insanely turned on by your body in all aspects. It's hard to hang out platonically, because our attraction is just so raw. Then when you add the mental stimulation, it gets heavy haha.\"\nThe timeline is such that (COVID notwithstanding), he will free up this December 2020, when he finishes his Master's. He will technically have the summer free, and part of me feels like he might slip and reach out then. Who knows?\nTurns out, I would also do well to hold out till the end of year, since I will be studying up a storm for 4+ months from July-Nov. to sit for the Certified Financial Planner exam. (He doesn't know this.)\nI think to myself, will he come back to get me?\n(And no, we didn't have sex...haha)\nEDIT: Thanks for reading, if you got this far. I know it's long, but this is what it took me to capture the situation :)\n\n"}, {"title": " Best extrovert for a romantic relationship with ENTP? (self.entp)", "likes": "9", "comments": "18", "content": "I see entp mostly paired with introverts,but as someone who preferes dating extroverts I wonder who do you think is the best match\n\n"}, {"title": " I Like 2020 (self.entp)", "likes": "17", "comments": "28", "content": "I don't know if it is an ENTP trait or not but I'm actually enjoying 2020 despite all the problems because I'm able to see the chaos around the planet. A lot of people are saying that 2020 is the worst year of their lives but I know that for me 2016 was just bad like I ended up getting extremely depressed the next year and I still feel like I basically lost the entirety of my 2 years (2016 and 2017). I just wanted to ask what are you guy's opinion?\n\n"}, {"title": " ENTP and ENTP (self.entp)", "likes": "95", "comments": "73", "content": "I'm ENTP, and my crush is also ENTP. We've both had a soft spot for a long time. And he's really my male self. So when I start showing feelings, he pulls back. And I get it, because I normally do this, too. Can you give me some advice on how not to scare him with emotion?  And is ENTP and ENTP actually a good idea?\n\n"}, {"title": " does pandemic humiliate people like entj? instead of the theater, the actors opened a vegetable shop (self.entp)", "likes": "8", "comments": 0, "content": "Their theater was closed, so they opened a greengrocer. \"Our viewers come shopping\"\nEscaping from the crisis, they changed clothes. A huge change - from the theater boards they got to the vegetable garden in the container. This is how the founders of the Katowice Iron Theater Marta Marzęcka-Wiśniewska and Piotr Wiśniewski took care of their safety during the pandemic. Although they are happy that there are clients, they miss the theater.\nThey can't play, so they opened a greengrocer. The actors' marriage shows how to avoid a coronavirus pandemic. Just like CleverFrame, which after more than 10 years of production of exhibition systems has switched to the production of protective helmets.\nMarta Marzęcka-Wiśniewska: All theaters, including ours, were closed overnight due to a pandemic. Us, me and my husband, this information was just on vacation. We released the premiere and went to rest for two weeks. We knew that when we came back the theater would be closed - which in turn meant canceling the performances and giving away money for the tickets.\nNot good information ...\nIt was an absolutely crisis and breaking situation for the theater. We were aware of the fact that everything will last a long time, so first you have to keep yourself and secondly keep the theater - because just because it doesn't work doesn't mean that it doesn't generate any influence. That is why you had to think about a business that would be able to somehow maintain and survive this time.\n\n"}, {"title": " Overdone topics and Aren't you tired of discussing over same concepts? Moral Realism, really? (self.entp)", "likes": "36", "comments": "20", "content": "Even beyond the point of stereotype, we ENTPs discuss, a lot.\nHowever lately i found myself explaining to someone why his intuitive moral compass at least isn't sensible and objective. Whether this is Moral Realism, Abortion Rights, or other basic concepts which were described in almost any way possible. Almost always I do win this discussions, but this happened to be a routine: telling the same sentences over and over again.\nThis may be because I am currently studying philosophy, but for a long time I haven't felt any challenge, breeze of something new and fascinating. Even more, I find myself  bored of these talks and decide to back off. I've tried doing this from other side (devil's attorney), but this doesn't help as it is still same topic.\nIs this normal for ENTP? Are you ever tired of winning debates? What are some Overdone topics in your opinion?\n\n"}, {"title": " How Strong Is Your Fe? Debating Whether I'm An ENTP? (self.entp)", "likes": "27", "comments": "52", "content": "MBTI has gotten me curious. And yeah, curiosity killed the cat but for a while, I was the suspect. :P\nBad humor aside, when it comes to functions I relate much more to Fe.  I'm very much about presenting an image. Appearing affable, and being outwardly affectionate. I'm extremely good at reading a room and being aware of and understanding the room. There are times when I've learned to have strong acting processes, using my social understanding to get something that I want.  I'm definitely caring and protective over people but I'm also fake and overly flirtatious which can make me seem inauthentic with how I feel. Half the time I have no clue dealing with my own emotions and it can cause me to spiral without understanding.\nI guess I'm also having a tough time grasping Ti exactly.  For example, I'm analytical. I enjoy understanding the 'why' to things, I like to understand how things work and how people think which helps me understand a bigger picture. Airplane seats are always blue?  Is it to display a feeling of relaxation?  Why is that people think this way? I'm going to find information to make them know things aren't as black and white as they seem. How can we bring more money back to this town?  If I act this way, will it display more confidence and boost my status?  I have an easy time talking to INFJ's and other Ti users while struggling to deal with high Te users and tend to feel put off by the privacy of Fi. Is this auxiliary Ti?\nI guess I'm wondering how strong Fe is for ENTP's and whether or not I am one or not. I have definitely made some emotional decisions for the people that I love, I do enjoy art and music, and I'm definitely not a robot, but I don't click with Fi.\n\n"}, {"title": " Lately I've been having trouble figuring out if I'm a entp or intp (self.entp)", "likes": "6", "comments": "17", "content": "What are same main differences to help me out?\n\n"}, {"title": " I’m too logical for a relationship (self.entp)", "likes": "11", "comments": "9", "content": "Shits annoying. I don’t express feelings or have felt deep attraction in years (I’m only 19). And I talk to so many girls regularly but don’t feel anything. Eventually, THEY don’t feel anything anymore because it’s just words and no sexual tension. They just find me funny or attractive physically but that flame fizzles out. It’s always a one-sided affair and I just like to talk to them about ideas, laugh, share our story. But I don’t usually care enough to flirt, to strike their emotions. So I’m stuck in this cycle. I’m not taking it a step further because I don’t actually care to.\n\n"}], [{"title": " Any evil entps in history? (self.entp)", "likes": "25", "comments": "21", "content": "Post evil entps who existed. Im trying to google them and i am having an hard time finding any.\n\n"}, {"title": " ENTP - INFJ conversations (self.entp)", "likes": "7", "comments": "4", "content": "Any ENTPs wanna share the best/funniest/cutest/weirdest/deepest (or whatever adjective you wanna use) conversation you've had with an INFJ?\nOr just a good story. I'm in the mood for reading something good lol\n\n"}, {"title": " The key to ENTPs is the \"bird holocaust\" model of life. It's a matter of setting things up so that one stone kills multiple birds. (self.entp)", "likes": "5", "comments": 0, "content": "An ENTP can be very good as playing positional chess with life. I am wondering do fellow ENTPs also do this?\n\n"}, {"title": " [Female ENTP] Older women can’t stand me? (self.entp)", "likes": "6", "comments": "9", "content": "So I’m a young entp female who just finished uni. I have been working in an office doing customer service for a few years now and I’m pretty good at my job (also overqualified since I now have a degree). However, the managers and supervisors who are women constantly bully me amongst each other and talk behind my back about the way I speak, my resting bitch face, my overall demeanour, etc. Friends and colleagues have even over heard these bitch sessions and told me about them. I know that I’ve  never said anything that could be taken the wrong way as I’ve always been afraid of expressing the way I feel to female authority figures as I’ve experienced problems with this before with female teachers and bosses at previous jobs. Instead, I’ve learned to keep my mouth shut and be agreeable to avoid conflict. \nOn one occasion, I was berated and called awful names by one manager during a one on one meeting about my performance simply because I don’t smile when managers say something to me while I’m on the phone to a customer. She said I was giving them dirty looks, when really I was just pre-occupied with doing my job and didn’t think giving a big smile was really necessary. This had NO effect of my customer service FYI. \nNow I do put a lot of thought into my appearance at work. Some male friends I have in the office have told me this bullying may be a result of jealousy but I disagree as there are other attractive women in the office who don’t get treated so badly by these women. \nThis is just the most recent example but my whole life I’ve experienced problems with my relationships with older female authority figures in my life such as teachers, bosses, and older female relatives. I don’t have this problem with women around my own age. Is this a common problem? How do you connect with other women and make them like you? I am a feminist and feel awful when I think about how much better I am at work when I have a male boss or manager.\n\n"}, {"title": " Opinions on meditation? (self.entp)", "likes": "39", "comments": "50", "content": "I've tried it, it's the most alright thing I've ever done\n\n"}, {"title": " SJW's = Sensor Judging Warriors? (self.entp)", "likes": "20", "comments": "26", "content": "[EDITED CAUSE I CUT MY POST IN HALF AND DIDNT NOTICE]\nNot trying to bitch just an observation (here it comes)BUUUUUUUUT..Anyone else noticed disagreements with SJ's tend to often go like this  (example is based around me trying to tell someone about fixing their shitty diet)\nSJ - I don't like being overweight, you've lost weight can you help me?\nMoi - Well you'll need to change what your doing have you tried cutting out XYZ? they all contribute to weight gain I've done that and seen great results.\nSJ -  What your doing is weird, i'm just gonna eat healthier\nMoi - By eating?\nSJ - Just having a balanced diet (they already eat this so called balanced diet)\nMoi - Which is producing these results you don't like...\nSJ - Whatever what your suggesting doing isn't normal your clearly wrong, I don't need your advice nevermind...\nObviously there's fault on my part as well in not catering to their communication style many have said its not related to MBTI but would still like advice on better ways of talking to these types as they seem to be the ones I typically just don't get along with. I want to help but my opinion keeps on falling on deaf ears because I'll eventually get perceived as an abrasive fuck. So how do you communicate harmoniously with SJ's?\n\n"}, {"title": " i hate ESTJs (self.entp)", "likes": "117", "comments": "97", "content": "god help me. do they want me to snort meth all day? I can accomplish more than them in sweatpants and a frown, why do they care so much about stupid shit. Hey, man, nice watch. Do you remember what we talked about 2 minutes ago?\n\n"}, {"title": " How can an introvert get into a relationship? (self.entp)", "likes": "3", "comments": "16", "content": "This is a general question. It's not about me at all. \nSo I heard that most girls prefer bad boys over nice guys but I feel like bad boys are more of an extroverted quality whereas nice guys is more of an introverted quality. So how can someone like an introvert become a bad boy when bad boys are usually like the alpha males. They say things the way they feel and never hold back. Maybe that's why a lot of introverts are struggling with finding a relationship because they get friendzoned for being a \"nice guy\". I want to know your thoughts. How can an introverted guy become a bad boy when it's an extroverted quality?\n\n"}, {"title": " What makes a person worth listening? (self.entp)", "likes": "8", "comments": "18", "content": "From my experience entps tend to not take people who speak emotionally or based on values seriously . But even when l am talking to them using logic and when l make very valid points they tend to brush it off like yeah u still don't make sense  . Idk they are probably very unhealthy\n\n"}, {"title": " What is your intake on entp mortality? (self.entp)", "likes": "9", "comments": "16", "content": "Guys . Hi. I am wandering what kind of people u are and where u stand on morality . How do u show love and affection or what do u do when u care about a person . Do u always put yourself first . What do u think makes a good person?\n\n"}, {"title": " What Myers-Briggs do you often get mistaken for or thought you were before you figured out you were an ENTP (self.entp)", "likes": "23", "comments": "48", "content": "I’ve seen a lot of ENTP’s say that they thought they were INTP’s before they took the test or that others think they’re introverted. But, most people I’ve talked to assume I’m an ENFP until I say that I’m an ENTP, and then those I’ve been in philosophy or debate with are like “ooooh yeah, that makes sense.” It’s interesting. I’m definitely an ENTP, but I think all the letters run on a scale and so I probably have a 45% F and 55% T. Which I think is convenient because I think it makes me an ENTP with a somewhat well developed emotional capacity. I don’t know, what about you?\n\n"}, {"title": " Which personality type do you not like? (self.entp)", "likes": "13", "comments": "51", "content": "Please tell me why you don't like them. I'm doing this for a project. FYI I'm a ENTP\n\n"}, {"title": " is mbti bs? (self.entp)", "likes": "8", "comments": "21", "content": "like i feel like this shit is pseudo science. Who actually proved any of this?\nWhere da fck do the population %s for each type come from. wheres the link to the survey?\nI feel like mbti explains like 50% of your real personality, its too bs to explain anymore.\nFor instance, I switch between entp and estp. how is that explained?\n\n"}, {"title": " what’s your zodiac sign as entp ? (self.entp)", "likes": "3", "comments": "27", "content": "Hi everyone, I (19F) just newly discovered that I was an ENTP-T type and I find it scary but funny accurate. Before that I was (guess i still am) into astro and I while reading entp description, I found a lot of accuracy regarding my astro chart... so I am really curious to see what’s yours !! \nI am : \nA Cap sun  ♑️\nWith an Aries moon ♈️\nAnd a Gemini rising ♊️\n\n"}, {"title": " How do I get attractive (self.entp)", "likes": "7", "comments": "13", "content": "Hey guys I'm an entp 19m, how do you get attractive ? I fall in the case of the good friend a bit too much to my taste\n\n"}, {"title": " Shameless Mbti types, Lip and Frank Discussion (self.entp)", "likes": "4", "comments": 0, "content": "My interpretations\nFiona: ISFP/Isfj, \nLip: Entp \nFrank: Entp (different subtype from lip)\nCarl: Entj, argued as an ESTP, but after “research” I see him as a clear entj\nIan: ISFP\nSteve: ISTP\nKevin: Esfp\nMickey: Enfj\nProfessor Youens: Entj\nKaren: istp\nDebbie: who cares \nLip and frank=both very very entp. Lip is a great way of showing an entp development in a “positive” way, Frank is an example of a very unhealthy entp, ex: Heath ledger as the joker, compare him to frank. Frank manipulates by using others emotions for his personal gain, lip manipulation is used through logic, to help others in a clear “right or wrong” way/ammoral. Lip learns has to balance Fe with Ne and Ti, and that’s when he becomes very balanced with his emotions and “logic”. Frank and Lip= always seen as very similar, but uses their cognitive abilities in different ways. Lip- the best interpretation of an entp I’ve ever seen, surpasses emotions, subliminally caring, has a “angry caring” trait, lip has the saddest story because of the potential he has and it is thrown down the drain due to him not being able to control his FE well in the beginning. Lip clearly does not want to do bitch work his whole life, but when his FE develops, it is able to show him what he truly wants. Example: adopting Xan, taking care of the family, being a mentor/sponsor to people in a rehabilitation process. I don’t believe lip was ever an entp who was meant to go “change the world” through his brilliance, which is clearly shown. He had a general “compassion” for doing what he believes if right or wrong. Entp like lip thought process: change the world, in his mind changing the world may not mean anything. Hey “I’m gonna die in 80 years and 200 years later will people even know who I was” probably not. He’s gets more fulfillment out of guiding others because he knows he can very well, the people he is close with is what means the world to him. Helping others reach their full potential= lips entp type, I would call it the “Entp Guardian”, Frank “Entp Anarchist/narcissist” sorry my thought process is all over the place but I mean come on, entp lmao. Anyone else wanna give their interpretation and understanding of what I mean by these subtypes of the entp MBTI type?\nAlso, Fiona=ISFP/isfj\nFiona: goes to lip when it’s a logic based situation, lip can manipulate her thought process by mixing logic and emotion. Example: Fiona talking to lip about going to jail with the Liam cocaine situation, notice how Fiona immediately reacts when Lip says “You almost killed Liam!!” Mix of logic and emotion, which makes her see his point clearer. After that, Fiona (ISFP/J) follows lip (entp) around like a dog, and agrees with everything he says/let’s him he in control \nFiona with Frank \nFiona: Manipulated by franks emotional manipulation, manipulates fionas emotions for his own personal gain. When she is in an unhealthy state, she does not listen to an ounce of what lip has to say, and goes to frank. The process starts, drinking, drugs, sex, basically Frank’s lifestyle. And she follows him around (again, entp) because she is manipulated into thinking every lifestyle choice he makes is right for her emotions. But she would never listen to an ounce of franks logic, even with all the emotion he manipulates her with \nBasically what I am trying to get at is that and ISFP/J and entp seem to have a relationship, that is literally like brother and sister. It’s a constant competition between them, but special type of caring for each other. Not only is it portrayed in shameless, but I have a friend who is also and ISFP, and it’s almost scary how her and I communicate, just like lip and Fiona do. A very understanding attitude that most other people do not see within those 2 types.\n\n"}, {"title": " I(ISFJ) am so mad at this ENTP right now - Advice needed (self.entp)", "likes": "3", "comments": "31", "content": "This guy I am seeing and I like to have debates (surprise surprise) and it is often about politics. For the sake of my question I'm not going to directly state my views or political party, as that's not the focus of this, and I don't want any comments below to derail into that.\nI'm VERY far leaning on the party I affiliate myself, where this ENTP is more moderate, swinging left and right depending upon the topic.  Despite how passionate I am about my own beliefs I do enjoy listening to the other side and what they say, and try to at least get where they are coming from.  This has lead to long political talks between the ENTP and I even though he know he won't change my mind.  That's fine.\nToday in text he says that he gives anyone with my party affiliation the side eye and that they are the more evil of the two parties. Now hold the phone.  There is a reason Superman and Captain America are widely considered ISFJs - we believe in justice and being good.  I was also shocked he would so casually give me, essentially, a label of 'evil' despite all of our talks. 'Oh, but he didn't say YOU, he said your PARTY.'  My party is in no way perfect but it is an extension of me and he knows that, and essentially, called me evil as a result.  I called him out on that and told him how that insults me, and to speak in absolutes is not fair.  You guys like being called on your bullshit right?  Well, I did that, and asked why he would lump me into something so awful.  Do you consider me to be evil?  A whole hour and a half later I get simply 'no.'  When I asked him to discuss it further he said he doesn't want to right now.\nIf this is the end of us so be it, but what the fuck, man?  Why would someone that will argue anyone into a corner suddenly back down from me when I ask for an explanation on why I am evil?  Is it because the conversation is suddenly feelings based as opposed to logic based?  Did I hurt his feelings?  I really like this guy as a friend and a whatever-we-are but this really pushed some buttons.\n​\nEdit: Typo\n\n"}], [{"title": " I wanna know what you fellow ENTP’s think (self.entp)", "likes": "7", "comments": "5", "content": "So essentially I was doing research into 5G towers and junk because some conspiracy theory Instagram page was like “yo, you do this I give you some clout” so I obliged. I found out that the frequency of radiation 5G towers admit falls into the Thermal radiation category. So it heats stuffs and prolonged exposures can increase risk of cancer. But my point is, is that, this means there will no longer be snow? It’ll melt it all before it touches the ground meaning winters will be rain only... which means global warming will be what people blame. I’m still very uneducated in this area so if anyone is please, enlighten me. So yeah, tell me what you think. Am I wrong? Did I screw up somewhere? Or am I dead wrong for not being too educated in the subject? Thanks for reading!\n\n"}, {"title": " hey, shouldn't we send the Chinese for this song: Imagine Dragons - Bad Liar? Oh I’ve been asking, for problems, problems.. (self.entp)", "likes": "5", "comments": "3", "content": "so, shouldn't we send the Chinese for this song: Imagine Dragons - Bad Liar? Oh I’ve been asking, for  problems, problems.. \nhttps://www.youtube.com/watch?v=I-QfPUz1es8\n\n"}, {"title": " En ondine as a job : how long till entpness makes me want to quit (self.entp)", "likes": "3", "comments": "2", "content": "Place your bets I’ll actualise it when I’m bored \nStarting Monday as my first job\n\n"}, {"title": " My thoughts are killing me. (self.entp)", "likes": "22", "comments": "11", "content": "Hello everyone,\nWell actually i don't know where to start x) and i'm sorry for my bad english in advance i'm french and I'm a 17F ENTP by the way.\nI wanted to ask you something , these last 10 months i felt like i'm fading away more like stressed trapped maybe \"depressed\" and paranoid that i'm starting to doubt my \"ENTPness\" lol and my mood changes 100000 times a day. i started to getting bored of people even the ones who care about me like i push them away ; not talking to them for 4 days or more , not replying to them , i don't know i just feel like they're so fake and boring that i prefer to be alone but i hate loneliness. I hurt so many people by just leaving them so i feel so manipulative and i hate myself so much for that. I crave human interaction but when i get it i just abandon them because i don't want them to abandon me first and i can't get the idea that \"they have people who are more important than me in their lives\" out of my mind , i want to be their priority and if i can't then byebye :/ then i find myself alone and i get depressed even tho i know I'M the problem.\nI feel like i didn't find the right people yet but i need them so much in my life right now , when i see some groups of friends outside enjoying their time together i envy them so much because my friends are like- whatever. i don't know if i can call them friends anymore even tho they consider me as their bff lmao. I was here for them everytime they needed me but i didn't receive anything in return. \nAm i the only one experiencing these things ? Is it a common thing for ENTP to feel this way ? I don't know what to do/think anymore and I'm sorry for bothering you all.\n\n"}, {"title": " The infamous jack of all trades, master of what? (self.entp)", "likes": "24", "comments": "26", "content": "Tell me about your profession, areas you’re properly skilled at, your ultimate talent. What do you do?\n\n"}, {"title": " Come to r/mbtiIntuitiveLounge for open ended discussions and talking about ideas :) (self.entp)", "likes": "3", "comments": "1", "content": "Hey guys, come r/mbtiIntuitiveLounge to sip on imaginary wine and have some open ended intuitivey chats, deep convos, and debates. Or just talk about life and exchange philosophies. It's open to sensors too. Do visit if you're keen!\n\n"}, {"title": " How are you dealing with quarantine, ENTPs? (self.entp)", "likes": "20", "comments": "43", "content": "See, for me, I’m shockingly doing very well with quarantine. I don’t really miss social interaction as much as I thought I would. Don’t get me wrong, I do FaceTime my friends nearly every day but I’m pretty happy being alone in my house and doing my usual hobbies. My anxiety has really calmed down and I feel pretty happy for the most part.\nHave you guys been dealing with it well too? If not, that’s cool too.\n\n"}, {"title": " Obama quote on free speech (self.entp)", "likes": "8", "comments": "3", "content": "“If you disagree with somebody, bring them in and ask them tough questions,\" he said. \"Hold their feet to the fire, make them defend their positions. If somebody's got a bad or offensive idea, prove it wrong. Engage it, debate it, stand up for what you believe in. Don't be scared to take somebody on. Don't feel like you got to shut your ears because you're too fragile and somebody might offend your sensibilities.”\nhttps://www.google.com/amp/s/reason.com/2016/05/15/obama-blasts-political-correctness-fragi/%3famp\nI feel very strongly about supporting free speech, and as an ENTP I have a hunch that many of you feel the same. Nothing pisses me off more then seeing college campuses(I.e. Berkeley) flip their shit and cause mass destruction to prevent someone with conservative views from speaking at their school. Fuck the first amendment I guess. As a high school senior going to a liberal college -inevitably -  I hope to god I’ll find my share of people who value free speech nearly as much as I do. On a related note, I could talk about how much I hate political correctness for hours, but i will refrain.\n\n"}, {"title": " Who do you want to be? (self.entp)", "likes": "12", "comments": "20", "content": "Since most of us tend to overthink everything, including our place in society, I'd like to hear your thoughts about that. Who do you want to be? What is the perfect version of yourself? \nI always imagine my self as this grande dame of politics and work towards that goal even if I am a total mess. \nI hope to hear your opinions.\n\n"}, {"title": " My favorite real life ENTPs: (self.entp)", "likes": "16", "comments": "42", "content": "Quentin Tarentino\nRichard Feynman\nSeth Macfarlane\nBill Maher\nFidel Castro\nLeonardo Da Vinci\nAnthony Bourdain\nJustin Roiland\nSatan\nMilo Yiannopoulos\nSam Hyde\nFrank Abagnale\nSocrates\nThoughts? Who would u add or remove from this list??\n\n"}, {"title": " Are you guys ever interested in topics that show you how to make sense of reality, your own human processor, how to process data efficiently, and how to take action with that awareness? (self.entp)", "likes": "3", "comments": "2", "content": "To rephrase, does self-improvement energize you?\nWould you go out of your way to learn that sort of thing, or not really?\n\n"}, {"title": " We are extraverts, but we only vibe well with introverts [LONG] (self.entp)", "likes": "190", "comments": "57", "content": "This is just a hypothesis, I have yet to truly experiment with this. And it isn't a catch-all rule, but perhaps a normative role. As an archetype, We hate small talk. We hate monotony. We form interesting thoughts before we share them more often than not. This is because before speaking our thoughts, we always give time to form them to an extent, whilst the average extravert might speak thoughts impulsively. And we always are able to communicate these ideals as we haven't any trouble articulating. \nWe can only get the quality of conversation from someone who scrutinizes their own ideals before speaking them. In other words, we only really get to express our labyrinthian thoughts to their truest extent with either an introspective extrovert (which is rare, maybe another entp, or perhaps an enfp, etc.), Or... An introvert.\nWe are not extraverted introverts, as the stereotype of an entp would have you believe. We are extraverts who crave the company of lots of introverts. We want to know lots of people, but only people who themselves do not know lots of people. We can make it just fine at a party, but we're always attracted to the quiet one. The introvert who's friends forced them out. Thus, our favorite party might not the the one swarming and buzzing with interaction, but the one with many circles of different groups, each quietly exchanging ideas amongst themselves. \n(Caveats):\nThis is not to say we don't like the company of other extraverts at all, because clearly many of us we do. And of course, no two people from even the same personality type are the exactly similar. And of course needs to be stressed that every personality type, regardless of stereotypes, is capable of being interesting in conversation. \n(/Caveats)\nBut this I believe to be a common truth: we are the extraverts of the introverts. We thrive on having many friendships and interactions, but the best friendships we have are the introverts. Personally, my favorite type is the infp. There's always some mind-blowing, emotional perspective waiting inside them that flips my whole perception of reality. They're beautiful lmao. \nIn short, tldr, we are extraverts who crave lots of social interaction, but favor that interaction to be with introverts. Extraverts are of course capable of satiating these conversational cravings we have, but we more often than not find our conversational niche for complex, abstract discussion to be fulfilled by introverts. So, we befriend lots of introverts, henceforth, we are the one type known to be an extroverted introvert \nSo yeah, thanks for coming to my Ted talk and all that. Now be another entp and argue with me cause that's why I love y'all lmao. And it's also possible that lots of others have been saying the same thing for a long time, but I felt like sharing my thoughts. \nTldr to a tldr: I'm an extravert ntp who has a thing for introverts and am projecting this on to all of you and that's about it.\n\n"}, {"title": " sometimes Si is a nightmare, sometimes a salvation ... (self.entp)", "likes": "5", "comments": "2", "content": "see in the case of tulip fever in the Netherlands in the 16th century .. because of the virus, tulip prices have risen to their maximum\nif not for Si, people would deal with speculation ... business should be based on reality and needs, not speculation ...\nthere the same entp ideas?\nthe second case .. wigi developed a way of spraying historic tiles from the last century with a hand pump ... but none of it was all because the gasket was silicone and was not durable ...\nthe whole plan gave nothing ...\nHowever, recently Wigi found a different pop with a different diameter and everything worked out\nconclusions: if it wasn't for Si, the problem would be solved many years ago and the whole idea of entp is in the trash ...\non the other hand, Si gives reality like in a tulip fever in the Netherlands ..\nwhat do you think about that ..?\nmaybe it's the same with Si for infj? how is it .. with you?\n\n"}, {"title": " Which mod wrote these rules? (self.entp)", "likes": "8", "comments": "3", "content": "I am genuinely concerned because they are completely pointless.\n\n"}, {"title": " What is your learning structure? (self.entp)", "likes": "10", "comments": "5", "content": "I noticed I'm not able to learn anything from the bottoms up. Usually you'll start with basics and some details and go up from there to the bigger picture. But I found out that the most effective way for me to learn is to start with the overview, then get into the areas/sections that interest me the most, and then go the the beginning to get the basics.\n\n"}, {"title": " How do you make freinds after being stuck in the shadow since childhood plus corona? Any advice is welcome. (self.entp)", "likes": "6", "comments": "3", "content": "Lost just got out of some mental illness asking if others have seen this.\n\n"}, {"title": " i am entp and she is isfp and i am confused. (self.entp)", "likes": "4", "comments": "2", "content": "i am entp she is isfp\ni google about it people telling this is a mess.\nwe are together for 6 months. and it feels good.She is quite and i like to talk about stuff,she is caring, doesn't offended with my offensive jokes(almost).\nher confidence level is always down and main always up so she tries to control my mouth infront of the others and i try to be more confident.i kinda feel loke bff but i like relationship that way.\nour likes and dislikes are different but i can talk about almost anything soo this it not a problem atleast right now. yeah she is childish. is this going to be changed? or I don't know why people say that this is not a good idea\n\n"}, {"title": " Changing dominant functions? (self.entp)", "likes": "5", "comments": "2", "content": "Question 1: Is it possible to switch out cognitive functions at will?\nQuestion 2: If so, could a person then theoretically have the ability to posses any dominant function that they wish at any time, as long as they are able to judge a situation well enough to decide which cognitive function is best suited to the scenario?\n\n"}, {"title": " Community for self discovery (self.entp)", "likes": "6", "comments": 0, "content": "Hello!\nWe are a couple of guys who have started an MBTI subreddit. We have made it because we think that all the other MBTI subreddits are more about having fun and less about advice, at the expense of encouragement for personal growth. We aim to fill that neglected niche of people who want to grow as a person. \nThis subreddit is different from the others in how we prioritize personal growth, better communication, advice, and a deeper understanding of ones self. We want to be where you can go to help each other out and better understand what makes us different, and what we all share in common. We are aiming for everyone to be friends(even when we disagree), and where you can ask questions about different types or about day to day things that affect you. \nPlease come on ever and join the community!\nSubreddit: r/personalityinOrder\n\n"}, {"title": " I got treated as if I were retarded for being ENTP (self.entp)", "likes": "5", "comments": "8", "content": "So today I had a meeting with 4 people (3 teachers and the principal) at school because I don't really get productive at school, basically because of typical ENTP behavior. The teachers were basically trying to say that I'm stupid indirectly. No one has these types of meetings either so I just felt like shit the whole hour and a half it lasted.\n\n"}], [{"title": "Why ENTPs and ENFPs can be mistaken (self.entp)", "likes": "14", "comments": "11", "content": "Maybe I'm stating the obvious but I was thinking about my interactions with a close friend who is an ENFP - she endeavours for social equity and seeks to fit situations to accommodate her feelings and those that she feels will accommodate others (Ne-Fi), while I strive for physical equity and seek to fit situations to those that fit my models for interaction; typically the laziest and most effective solutions (Ne-Ti). We can both be bullheaded, and we both try to find new ways to probe our understanding, but our priorities are different. What do you think? \nP.S. I'm not consistent or cliquey enough to know who won the recent \"war of the Ricks\" (cringe) and so what the rules currently are, but hopefully this is some kind of food for thought and relates enough to MBTI to satisfy either side, so yeah... anybody else identify with these differences?\n\n"}, {"title": " ENTP Commitment Issues (self.entp)", "likes": "9", "comments": "6", "content": "Been dialing in on myself recently and I'm slowly coming to terms with my fear of commitment.\nI see this in two significant areas of my life: Career and Romantic Relationships.\nAnyone else have these issues and how did you learn to mitigate them?\n\n"}, {"title": " Any ENTP women on here? (self.entp)", "likes": "21", "comments": "16", "content": "Why is there so many more male ENTPs than female?\n\n"}, {"title": " Hello brothers ..banned from mbti (self.entp)", "likes": "6", "comments": "13", "content": "Hello brothers ..been kicked out of r/mbti..mind if I squat here and ramble nonsensically?\n\n"}, {"title": " Help. My ENTP boyfriend wants to reconstruct Nazi Germany (self.entp)", "likes": "109", "comments": "82", "content": "and also he’s ignoring my texts. How do I get him to respond??? We were supposed to go fishing today and he hasn’t said a word. I’ve been digging through my belongings for a week to find all this fishing gear and I feel like I just wasted my time.   \nWhat do you think I should do?\n\n"}, {"title": " rant about entps (self.entp)", "likes": "6", "comments": "26", "content": "Not an ego stroking post.\nI always thought i was a entj but when observing myself  i found out i was most likely an entp ,i was so fucking disapointed , ive always had so many aspirations , and ambiton but at that moment i realized Most entps wont achieve anything meaningful in their lifes , they wont make it happen and take action on that idea that could be a 7,8,9 figure business idea or that project that could change lifes.Because to succeed you need focus ,consistency, patience and a good idea ,and entps are missing 3 of the 4.\n(source=any fkn successful entrepreneurlol)\nNow some of  you might say \"dOnT lEt 4 LettErs DeFiNe YoU\" and you would be right since we can manipulate our cognitive function , by partnering with people with consistency and focus and improving ourself through trial and error but most dont ever do this.\nThis is just a reminder that 98% of entps wont ever achieve anything that will be meaningful and if you want to be that 2% give it an all in for a lot of time or honestly dont even bother u wont achieve shit.\n​\nThanks for coming to my tedtalk\nPD: by lurking through this subreddit im always suprised when \"entps\"  are proud of being entps lol.\n\n"}, {"title": " ENTPs and relationships (self.entp)", "likes": "9", "comments": "10", "content": "Hello! Little ol' ENFP poppin in to ask a few questions. You may recognize me from r/MBTI as the 16 RPG artist ( I drew ENTP! ) and know that I'm writing a series that has the 16 personalities as their own characters. Problem is, I don't know any ENTPs in real life to ask them wwyd questions, so I'm here lol Any answers would be highly appreciated, thank you in advance! \n1) How do you rectify your mistakes? (Ex: you said something that deeply offended a coworker/SO)\n2) How do you handle deeply rooted fears? Do you try exposure therapy or try to avoid it? Something in between?\n3) Do you hold grudges against people? If so, how could someone wrong you?\n4) What would be your ideal date? [Unlimited budget, so go for it lol] \nThank you, thank you!\n\n"}, {"title": "ENTP Vs ENTJ (self.entp)", "likes": "5", "comments": "6", "content": "I thought I was ENTP but recently just decided to score myself again but this time I got \"you appear to have marginal or no (1%) preference of Judging over Perceiving\".\nWhat does this actually mean? Is it the type of thing where if I re-took the test in a different mood I may get another shift? I am a little down in the dumps today, is that the type of thing that can cause variance?\n\n"}, {"title": " my entp friend (23 M) is confusing my (22 F) poor, innocent, little crybaby brain. does he like me. (self.entp)", "likes": "7", "comments": "6", "content": "hello. i am actually already in a relationship. he is my boyfriends best friend and roommate. our relationship recently has not been easy. my bf has immaturity issues and bipolar, so he proposed to me and later took it back. long story short-we are working through it, but he has become unattractive to me due to excessive weight gain and his immaturity issues. he’s a enfp. such a sweetheart and so well-meaning. freaks out every time i hurt myself. he’s like a puppy.\nwell when he (my bf) proposed and said “sike,” his best friend and also my best friend (entp guy) kept staring at me—my friend group noticed. he stared at me so long that the conversation kinda hushed around us, but it could have been because he was looking at something behind me, was thinking, or he was drunk. he was my go-to person to talk to. he listened and listened. i asked what he would do and he told me he thinks there are lots of “goofballs out there”. since then, he will talk to me like a normal person but one time told me a joke and I took it the wrong way of what he meant. he said “i meant to say that you’re attractive”. i couldn’t tell if he was being sarcastic or joking—it just wouldn’t make sense for him to say that. he is very loyal but he has never had a gf yet. he wouldn’t pursue anything while i’m with my bf but has always joked about wanting to meet my parents. always brings this up. we joke about it a lot, but when i mentioned having a graduation party at my place and asked “are you sure you want to go if we can have it?” he’s like “yes, i’ll get to meet your parents”. he wants to meet all of our parents, but is especially persistent about mine. does he like me? i want to know this so i can address it correctly. also when you get the feeling that someone likes you, you just want to know. i hate the grey area. this is also a summary of what has been going on in the past 6 months, all of these signs have been very gradual. there are signs but he’s so unpredictable that things i 100% thinks he means are jokes, and things that are jokes he sometimes 100% means. \nthank you for reading. i’m also sure the lowercase letters bothered you. sorry.\nTL;DR: my bf and i have been struggling and have relied on a mutual entp friend a lot. this friend is also my bf’s roommate. he incredibly persistent about meeting my family and he make a joke saying that i’m attractive. he has always been very protective of me and i want to know if he likes me or not. there are signs but he’s so unpredictable that things i 100% thinks he means are jokes, and things that are jokes he sometimes 100% means.\n\n"}, {"title": " Can Someone Help Explain something? (self.entp)", "likes": "7", "comments": "3", "content": "What's this thing ive heard a few times about ENTP's supposed dislike for gymming and physical exercise like lifting weights etc??\nis this even true and if so how come?\nThanks!\n\n"}, {"title": " Counteracting laziness (self.entp)", "likes": "5", "comments": "3", "content": "what works for you? How do we put our Si to work?\n\n"}, {"title": " Tempus fugit : a brief history or powerlessness (self.entp)", "likes": "6", "comments": 0, "content": "Howdy fellas \nI was wondering if it happens to you to be angry at “time” \nWhat I mean by that is realising that no matter what you’re and always will be a bitch for time \nI just got my first job and soon my mum will leave to live on her own with my small bro and her boyfriend \nAnd I’m standing still once again contemplating my powerlessness in front of time \nI welcome change and yearn for it every second of my life but realising I have no choices to accept it without relieving them or exploring past possibilities fuels me with an intense rage \nAm I going crazy or do you guys felt at least once that ?\n\n"}, {"title": " How would you describe a 7w6 ENTP vs a 7w8 ENTP? (self.entp)", "likes": "14", "comments": "5", "content": "Are there are any clear differences between the two.  I know that 7w8s are more assertive and confident than the 7w6.\n\n"}, {"title": " Entp question of existence (self.entp)", "likes": "16", "comments": "9", "content": "how can we entps be successful in life, even though the possibilities we open up is infinite we have trouble choosing the one\n\n"}, {"title": " Is this normal? (self.entp)", "likes": "6", "comments": "2", "content": "My ENTP friend and I (ISFP) have an odd friendship. We do this thing where we won’t speak to each other for months and then one of us will suddenly turn up and we’ll catch up on life. Then, we’ll be complete strangers again for a while. It’s a never ending cycle.\nI’d like to hear what ENTPs think about this.\n\n"}, {"title": " How do you know that someone likes you? (self.entp)", "likes": "4", "comments": 0, "content": "Both as a friend and as something more than a friend. I don't really care, yet I don't know how to spot differences and that makes me angry. Like It would be kinda awkward to ask, on the other hand it would be interesting to know. Based on that knowledge I could better coordinate how to act in certain situations.\n\n"}, {"title": "Debating with myself lol (self.entp)", "likes": "16", "comments": "49", "content": "I’ve recently discovered my personality type by taking this cool little test. I don’t 100% trust the results tbh but I got ENTP. I’ve been seeing a lot of posts sense I started researching my personality type about TV characters and what their types might be. \nI see a lot of people talking about Rick and Morty claiming Rick is an ENTP and all of the other ENTP’s argue relentlessly that this is true lol. \nimo he exhibits introverted and extroverted traits and I feel like it shouldn’t be such an argument. Lol he’s a fictional TV show character. All of the personality types are amazing in their own ways and I don’t find any one of them more superior to the other which brings me to ask.. why are ENTP’s so adamant about being superior? Lol I just don’t get it honestly and it’s annoying to me. \nFuck superiority complex’s. Feeling superior only stunts growth.\n\n"}, {"title": " Am I being played (self.entp)", "likes": "3", "comments": "10", "content": "I know this community absolutely hates dating issues, however I need some like truthful advice that isn’t just “break up” lol. \nSo I (19f) and the person I’ve been dating for a few months (23m) have hit an awkward place recently. He’s the ENTP I’m an INFJ. Things were going really well and he introduced me to his best friend etc. He is very affectionate with me. We are dating exclusively. \nWe are both really busy people, I work full time and study astronomy part time (+ I am learning how to program in any free time I have at work and after uni work). He is currently doing his masters in CompSci. \nWe don’t spend much time together but conversations flow and he is very sweet to me. He is a bit flaky with showing up but he is very busy so I don’t really pay too much mind to it.\nHere’s where the issue comes: I expressed that I really liked him about a week back and he freaked out and said that he wasn’t sure if he could see something more serious at the moment and that he wanted to see how things went. He implied he didn’t feel as much for me as I probably did for him (taking this from the convo we had the next day). I basically wanted to know if I was wasting my time and he said he doesn’t know and can’t possibly know if I am. I never pushed for a relationship I simply expressed how I felt. I never asked for anything to be honest.\nHe feels guilty that I like him and see something serious while he isnt actually sure. He’s never been in a serious relationship before but has alluded that he wanted to try it with me before.\nHe wanted some space to think about things, I agreed that this was a good idea and we havent spoken for a week, not sure if he will actually reach out. To be fair to him he has exams coming up and he’s in his final year of his masters so he probably doesn’t want to think about this. I am fairly certain he is going to break up with me. My friends are saying I should dump him first but I dont want to do that. I’d feel evil to do that before such a big event that will shape his life. He is a good person and I dont actually want to start a fight or be petty. I want to hear him out. \nWhat could he actually be thinking right now? Just so I can better understand why he feels this way.\nTldr: dating an ENTP guy as an INFJ girl, he wants time to think about what he wants from the relationship in the future after 3 months of exlusive dating, we havent spoken in a week, what could he be thinking?\n\n"}, {"title": " ENTP dating ISFJ, compatible? (self.entp)", "likes": "8", "comments": "38", "content": "ENTP dating ISFJ, compatibility?\nI am an ENTP (well typed) and dating an ISFJ (poorly typed, but it seems to fit well)\nI am curious if this is a stable match over time.\nI normally date intuitives as I am not attracted to sensors but she kind of threw herself at me and was cute so I was like what the hell.\nShe is very kind and has good values but when we talk I don’t feel a connection. She just talks about her day or various facts/details she encountered that are generally unimportant in the grand scheme of things. I kind of nod and pretend to understand then go about my day. We have similar perspectives on life and how we want our future to look. She takes care of all my other needs and is loyal, I just don’t really feel interested in what she has to say. It often feels like a chore to conversate with her.\nHas anyone had a relationship like this? \nDo they last long term?\n\n"}, {"title": " PersonalityinOrder, learn about other types (self.entp)", "likes": "2", "comments": 0, "content": "Hello!\nWe are a couple of guys who have started an MBTI subreddit. We have made it because we think that all the other MBTI subreddits are more about having fun and less about advice, at the expense of encouragement for personal growth. We aim to fill that neglected niche of people who want to grow as a person. \nThis subreddit is different from the others in how we prioritize personal growth, better communication, advice, and a deeper understanding of ones self. We want to be where you can go to help each other out and better understand what makes us different, and what we all share in common. We are aiming for everyone to be friends(even when we disagree), and where you can ask questions about different types or about day to day things that affect you. \nPlease come on ever and join the community!\nSubreddit: r/personalityinOrder\n\n"}, {"title": " Don't you think that spicy economic war with China is certain? apparently their lab did not have standards, they first deceived French, and the infected bat was sold by hungry employees on the market? [what does the US say about this] reliable sources? (self.entp)", "likes": "5", "comments": "3", "content": "so, don't   you think that spicy economic war with China is certain? apparently their lab did not have the standards, they deceived the French, and the infected bat was sold by hungry employees on the market? [what does the US say about this] reliable sources?\nhttps://www.medexpress.pl/uploads/2020/04/Coronavirus-Graphs_-Worldwide-Cases-and-Deaths---W.jpg\n\n"}, {"title": " Career for ENTPs (self.entp)", "likes": "7", "comments": "17", "content": "I am a college student and still haven’t figured out my path 100% \nI wanted to hear what other ENTPs major/job are, and if you like it/would recommend it! (Out of/10) \nI was thinking of getting into interior design-for hotels and big corporate businesses, hotel management, or business/finance.\n\n"}], [{"title": " Do you trust your feelings? (self.entp)", "likes": "17", "comments": "11", "content": "I feel like my emotions are very erratic. I can be very sentimental about a person/place/thing for a while, but get distracted and after that I kinda forget about those feelings. Probably not related  to MBTI but I believe some of you might relate. For example: my cat died a couple of weeks ago, we had him for 13 years and I loved him. But after a few days it was as if he had never existed. \nI’m afraid that my feelings are very unreliable, like how do I know if I love someone? If I can forget about them so quickly. I was in love with someone for over a year before confessing, got rejected, cried for a couple of days, a month later I was like New Phone Who Dis. \nCAN you relate at all?\n\n"}, {"title": " ENTP and ENTJ relationship, thoughts? Advice? Warnings? (self.entp)", "likes": "3", "comments": "9", "content": "So I’m a female ENTP and I’m currently talking to an ENTJ guy. It’s pretty great but I’ve also taken note of a lot of fundamental differences that have already caused problems for us and so I’m wondering what you guys think of this pairing and whether it’s truly sustainable, what are the strengths and weakness, and are these differences detrimental or something that can viably be worked through and overcome?\nSome specific observations I’ve made:\n\nHe is very success oriented and practical which is great but at times causes me to feel rejected when he’s constantly preoccupied and disinterested in the abstract topics I bring up.\nSince we are both very private and unemotional, it’s nice to not have to deal with that but also it leads to misunderstandings especially as I tend to overthink everything and when I’m missing key data points from his perspective I might jump to misguided conclusions.\nI often start arguments with him to get his attention which is fine for right now but I believe this will wear on both of us over time.\nOn the positive side of the previous point, it’s very relieving to have the ability to say anything I want without fear of offending him and so I can be much more authentic and creative with my words as well as bring up any and all personal concerns I have. It’s quite refreshing and allows us to address and work through issues very efficiently. It’s a comforting dynamic that I greatly appreciate and adore.\n\n\n"}, {"title": " Do you think ENTP makes a good web designer? (self.entp)", "likes": "3", "comments": "2", "content": "I like to know any if ENTP is successful as a web designer or graphist?\n\n"}, {"title": " Mistaken identity? (self.entp)", "likes": "5", "comments": "14", "content": "I have identified as INTJ since the very first time I’ve taken a Meyers Briggs assessment. I’ve occasionally gotten ENTJ and ENTP. I recently took an assessment and got ENTP again. I guess my answers tend vary based on my mood and awareness. Obviously the two areas that change out are I/E and P/J. I’d love your feed back on where you think I fall.\nI vs E: I value alone time, but I love to spend time with people I care about and like. I can often be the last one to leave the party or stay much later than I planned. I do enjoy big events, concerts, fairs, and the like. I do not like people I find stupid or unaware/inconsiderate of those around them (bad drivers, aisle hogs at the grocery store, slow walkers taking up a whole path), those people give me anxiety and make me want to run away. I think for me the biggest factor is the people, who I’m around. I don’t enjoy small talk that is meaningless (weather, mundane details, things irrelevant to me), but will happily chat up a stranger on an interesting topic or shared interest. I have had careers in sales and hospitality and have always done really well. I enjoy public speaking and being on stage. I hate being sung happy birthday and do not like to show boat.\nJ/P: I get bored so easily. I am a Jill of all trades. I am good at most things and will try just about anything and peruse it passionately until I “conquer” it and then move on. I have gotten many licenses/certificates and then never did anything with them. I have moved 30+ times and have had just as many jobs (usually having been promoted, as well). I hate a schedule and like flexibility. I love lists and take tasks seriously when needed. I am a major procrastinator, but always get the job done. I do not study, but excel at exams. I am highly organized and everything must have a place. I like to consider all scenarios and think about possible outcomes, but I don’t make any decisions until I have to. I do get frustrated when someone changes the plans last minute without letting me know, but I think this has to do more with lack of consideration and being more concerned about myself.\nAny insights? Help a girl out!\n\n"}, {"title": " Learning is living (self.entp)", "likes": "6", "comments": "1", "content": "I believe that learning is a discipline and the objective of this art is to know how to think. By knowing how to think, you are limitless in what you can learn. Learning also never stops. It does not stop after school, it does not stop after you get your first job, and it does not stop after you become CEO and king of the world. You need to apply learning in order to truly understand, grow, think creatively, and appreciate any subject. It allows you to be adaptable to all kinds of situations, be unrestrained in your options and pursuits, and find fulfillment in your new adventures. It is a way for you to progress and discover meaning in life. In this sense, learning should be a habit and a never-ending constant, not a means towards an end. \nLearning is an universal skill that can be applied to every aspect of life. You can learn art to understand the underlying meaning of a painting to appreciate its beauty. You can learn a language and history to vicariously experience the complexity of another culture. You can learn philosophy to dive into the depth of your inner world. Learning also allows you to excel in any new job or stay ahead of the curve in a new industry. If you are competent in only one skill, then you will only be able to thrive in that niche. If you are competent in learning, you will excel in any subject and expand the horizon of possibilities and paths in your life. Those with poor learning skills will be unable to grasp new subjects, lower their ceiling for potential and growth, limited in their choices in life, and unable to understand and thus appreciate what life has to offer. \nKnowing how to learn is like wearing a pair of glasses that gives you perfect vision. It allows you to see your surroundings clearly. You are sure of the colors, shapes, sizes, distances, and functions of the world around you. With perfect eyesight, you know you can walk down a certain path because you can see what lies ahead, you know you can jump over a fence because it’s not that tall, you know not to anger your neighbor’s dog because you saw it biting a stranger, you know you can sail to the island a mile away because you can see how close it is and have seen with your own eyes others do it with ease, and you know a butterfly is reborn after struggling to break out of its chrysalis because you have seen the time lapse of all the stages leading up to its transformation. You are unbound by what you can do and imagine, be able to appreciate new experiences, and understand and piece together all the parts of the world and how it works because you are able to see them clearly. No matter where you venture in life, you will be able to fully soak in the new experience, be aware of your new surroundings, take in the exciting potentials of the new journey, and grow as a person.\nWithout glasses, you will have a poor vision and can not see clearly the world around you. It appears blurry so you are unable to see reality, you can not comprehend what the world looks like, and you have no idea of what is possible. This hinders your imagination of what you can do, your growing knowledge of the world, and the level of fulfillment you get from new experiences. You are afraid to walk down on a pathway because you can not see what lies ahead of you, you are scared to paddle to the island across from you because you could not see how close it is, how calm the sea is, and how easy it is for others to make that journey. You do not dare explore the world outside the comfort of your home. Without glasses, you will be confined to the comforts of your home and afraid to step outside. Even if you were to pursue a new adventure, you will fail to adapt to your new surroundings, expose yourself to danger, be incapable of seeing and understanding your new journey, and thus unable to have any meaningful experience and self growth. \nLearning is just like being able to see. If you know how to learn you can then adapt to any situation, experience, and cycles of the world, even if they have never happened before- your potential in life is infinite. Therefore, learning should be a discipline, habit, or virtue, and not a phase. It makes you grow as a person and makes you adaptable to the waves of life. If you know only one skill, you rely on that knowledge to thrive and you are confined to the circle of that niche world. If you know how to learn, then you are able to step outside, pick up new skills, knowledge, perceptions, and expand your circle of possibilities in life. You will be able to adapt and excel no matter what you choose to do, where you choose to go, and no matter the difficulties you face. \nIf you know how to learn and think, you will continuously absorb and grow as a person as you chase after your dreams and your vision of what life should be. Eventually you will completely fill the jar of your life with marbles of beautiful, meaningful, and fulfilling memories and appreciation of the world. \n\n"}, {"title": " Making Money as an ENTP (self.entp)", "likes": "10", "comments": "4", "content": "We start out so low, and there's the risk that our Percieving function might never let us be high achievers early on given the unrealistic brilliant plans we make. I have been having the worst time making money in my twenties. All you rich ENTPs out there, can you please share your experience? How did your income and age timeline compare? Is there any truth to the statistics?\nhttps://preview.redd.it/we1vnhwrtdv41.png?width=800&format=png&auto=webp&s=612aa9068c145ee397f205e2e88d0e8d90293eef\n\n"}, {"title": " Introverted thinking (self.entp)", "likes": "3", "comments": "1", "content": "Don’t think I have introverted thinking since i feel like an Fi user but i was curious what would you say are activities/hobbies that use Ti and for a bonus maybe even Ne\n\n"}, {"title": " Just a little moral debate... (self.entp)", "likes": "7", "comments": "29", "content": "I wanna know whats the ENTP approach. Are you familiar with \"The Trolley Problem? If not, here it is:\nThere is a runaway trolley barreling down the railway tracks. Ahead, on the tracks, there are five people tied up and unable to move. The trolley is headed straight for them. You are standing some distance off in the train yard, next to a lever. If you pull this lever, the trolley will switch to a different set of tracks. However, you notice that there is one person on the side track. You have two options:\n\nDo nothing and allow the trolley to kill the five people on the main track.\nPull the lever, diverting the trolley onto the side track where it will kill one person.\n\nWhich is the more ethical option? Or, more simply: What is the right thing to do?\nNow let´s make it more interesting: There´s only one track, the one with the five people. The trolley will inevitable kill them, unless... there´s a man next to you, fat enough to stop it. You can push him onto the track and save those five people, or do nothing and let them die, leaving the big man alone (he doesn´t want to sacrifice himself).\nWhat do you do?\n\n"}, {"title": " Another attempt to explain Fi (self.entp)", "likes": "84", "comments": "20", "content": "Emotions in general are never completely inherent, and there always is some external source responsible for catalyzing the appearance of any emotion one has. However, Fi enables any person to have a very savvy finger on the pulse of how external stimuli can affect their own emotional state.\nMuch like Ti is able to detach pure knowledge for knowledge's own sake from external application of that knowledge, Fi is able to detach pure emotions from the external catalysts for those emotions.\nThe distillation/detachment of emotions from their external catalysts can lead to some pretty cool effects, where an Fi user can use certain stimuli (in the form of thoughts, experiences, surrounding environment, ideas, memories, etc.) to trigger any emotion at will.\nYou can compare this to how Ti can distill/detach ideas from their external application in reality, and they can use certain stimuli (in the form of ideas, axioms, facts, memories, experiences, surrounding environment, etc.) to reach any logical conclusion at will.\nThis is what xxFPs refer to when they talk about \"organic\" or \"inherent\" emotions, which leads to phrases like \"you just gotta FEEL it from within\" or \"tap into the fire within you\", etc.\nThat entire process is simply going through the 'bank' of experiences one has (either past experiences like memories, or present experiences like certain objects in one's surroundings) and linking a set of experiences to an emotional state.\nSo when your FP friend has all these arbitrary demands that seem to make no logical sense such as \"I don't wanna do X, I like Y better\", it probably is because they've figured out that activity Y contains the right combination of catalysts to maximize their enjoyment/productivity/internal emotional stability (whatever the FP friend is looking for at that point in time).\nIt's probably apparent that this process can easily lead to emotional fragility if unchecked, as it's very likely that FPs can spoil themselves by putting themselves in the optimal environment for their emotional state at all times, which leads to a lower tolerance for discomfort.\nPart of Te development in an FP is willingly putting themselves in more uncomfortable situations so they can develop emotional \"callouses\", so to speak, and broaden their range of what's comfortable for them.\n\n"}, {"title": " Have I become a bad ENTP or just boring/depressed? Or have I regressed into INTP? Wtf is this??? (self.entp)", "likes": "39", "comments": "35", "content": "So lately I've noticed a few things about my mental. You know how ENTP's are supposed to have this inflated sense of self? I don't. I think I'm just above average as much as I'd like to believe the latter. Reality does not correspond to that measure. Sure I've done some cool ass shit in the past that might warrant an ego boost here and there but lately I've been doing nada, stuck in bed all day. Maybe my ego has yet to inflate. This is a recession. And you say ENTP's love to argue? I don't. Not always. Sure in my head I'm always looking for latent information hanging back that might be useful to counter something someone's said but I rarely do. Maybe I'm not well-read enough. Or I'm too insulated to know what I don't know even though it's glaring at me. \nDo you ever feel like you're overcompensating for an inferiority with a superiority? Has there ever been a time when you've just settled back into your head and realised you don't know anything? That people just praise you because relative to them you seem more understood, articulate or knowledgeable about something they don't know, and you take that as a sign of intelligence? Like it has meaning?? I don't know anymore. Have I lost that spark? Can I get it back? My mojos gone and I'm afraid it was never there\n\n"}, {"title": " annoyed at some stereotypes (self.entp)", "likes": "51", "comments": "42", "content": "I find so many reddit threads and threads on the internet that type ENTP as these lazy slacker types that get terrible grades and are stupid jokers who lack motivation. Like YES I am partly a slacker and a joker but that doesn't mean we do poorly in school and on tests. ENTP is one of the top scoring standardized testing types and let me just tell you I don't have a very inflated sense of self worth but I wing tests and essays and still manage to do well. I mean yes, we could do better if we studied harder but we do pretty well in general. I think it's because we ARE good at reasoning, knowing random facts, AND making educated guesses so that really helps for multiple choice and essay-writing. \nDo you think what I said is valid?\n\n"}, {"title": " On a Date with ENTP (self.entp)", "likes": "88", "comments": "98", "content": "I reluctantly agreed to go over to his new house after dinner. He lead me up to the roof and as we were looking out he said “I could hurt you and no one could hear you scream” \nI said: 🥶🥶🥶🥶🥶🥶\nHe said: 🤣🤣🤣🤣\n\n"}, {"title": " What is Fi and Fe for you? (self.entp)", "likes": "3", "comments": "2", "content": "So my dominant is Ne, and my inferior is Si. No doubt about that, i can ellaborate on the comments if you want, im just trying to keep this post short.\nTi resonates a lot to me, so does Fe, and I dont relate much to Te. So the natural thing would be to conclude im an ENTP, right? the problem is, I reeeally identify with Fi. Maybe its not Fi, but Fe? These two are really hard for me to tell which is which. Ive seen the video about the \"ENTP Empath\" it made a lot of sense to me, but im still not sure; im really individualistic and emotional.\nDoes anyone have the same problem? What is Fi and Fe for you?\n\n"}, {"title": " Does stress render you useless? How do you manage stress? (self.entp)", "likes": "8", "comments": "2", "content": "Have you ever felt you can't work under stress? How do you manage stress? \nI have the following thought chains :-\n- I need to prepare more, but for that I need to wait for the right moment. this ends up in procrastination. \n- I see other people who are very good at what I'm doing and I'll never able to be as skilled as they are, realistically. So, I don't even try sometimes. \n- I try to avoid things which cause stress and thereby my projects and a good amount of other things I'd want in life. \nI'd like to know how you deal with stress. Thanks.\n\n"}, {"title": " After being \"against\" astrology all my life, last year I accidentally got into it after finding the system quite interesting, but now I have mixed feelings about the community... (self.entp)", "likes": "91", "comments": "111", "content": "Basically, my biggest problem with is that I don't actually believe the stuff but I love reading about the system because it's complex and interesting. You have to consider all the planets, their positions, transits, signs, houses, aspects, etc. Basically I've started to find astrology interesting the same way I find some religions interesting; I just love to get more information and knowledge about it even though I don't necessarily believe it myself.\nAlthough I have to admit that the biggest reason I got \"into\" it is that some girl wanted to do my chart last year and I felt genuinely called out. I know how these horoscopes work but still, it was the same kind of feeling I got from MBTI at first; \"how the fuck is this so accurate? maybe I should read a bit more...\". Another funny thing was that she told me she had never seen a chart as \"fucked up\" as mine ever since she got into astrology several years ago. Apparently it was full of contradictions... Surprise.\nAnyway, back to the problem itself. I've been occasionally reading /r/astrology for fun to have a better understanding of the system and it's a constant struggle coz at the same time I want to understand more and I find it genuinely interesting in many ways but also I constantly have this urge to start ranting at people saying stuff like \"well it's just astrology, don't take it so seriously\" lol\nAre there any other xNTPs who've started reading about astrology for fun?\n\n"}, {"title": " Need to let some “feelings” out - 22F (self.entp)", "likes": "6", "comments": "2", "content": "So I have been romantically involved with this other ENTP male who is six years older than me for over three years. I have had many firsts with him. Many. We both honestly kinda like each other from what I can tell but I guess we accepted that we will never be together for reasons that I honestly think lie mostly on him lol \nI never understood myself much before I met him since I felt like i was kinda a bad person for saying things that other people were to afraid to say and being a bit of a walking contradiction at time, etc etc. I’m sure it’s because I was very young when I first met him and I’m growing every day as I mature but I think I found a lot of comfort with him because he honestly felt like the only person that really “got me” since we’re both coincidentally ENTPs. I didn’t even know much about MBTI before him and it was so weird that we shared the same dark thoughts and being able to work through them together. I only found out we had the same personality type til months after. I guess I just never felt understood before. I didn’t have to censor myself around him and we grew fond of each other. \nPart of me always knew that this sort of “connection” (oh god I hate saying that) had grown so strong because of how much we needed each other in a way. The world was full of idiots and we could laugh about it together, and shed the occasional tear while doin it (which is like a rarity to see coming from an ENTP amiright?)\nSo obviously there’s quite an age gap. 6 years. Although I don’t think it’s that big since he’s a guy and women tend to mature more quickly, he always mentioned that eventually this needed to stop and we tried. We were an on again, off again sorta thing. Never was a full fledge relationship but was something that I could see becoming one in an alternate universe if we were to let it. \nOf course, I was sad whenever we didn’t talk but ya can’t be upset about it forever. I went on dates. Got my heart broke once by this INTP (now lookin back at it, he was a dumbass) and just had fun with being single. Didn’t hook up with anyone since I am not really the type but ya know, going on dates can be fun sometimes. Meeting people is interesting until the person eventually keeps talkin and you realize they’re all just kinda boring. Like, I need my men to have some edge or something Lolol\nAnyways, we took our last break for almost six months and caught up one the phone last week after I texted him at like 4am (i was going thru it lol) and he reached out the next day and it was nice to talk. We caught up and I learned he moved up to San Fran and stuff but the conversation after a while just took a turn. At the end of the day, it just ended up being a talk about how we can’t keep runnin in circles even though all I want is to be friends at this point. Like I feel kinda empty without him. He kinda was my confidante, ya know?\nAnyways, idk why I went on this huge tangent but how do I get over this, fellow ENTPs lol like obviously I don’t know why I can’t be rational right now. I like always wanna text him and just kinda figure this shit out but I’ve never felt like this if I’m being honest. Feels like I’m thinkin w my heart rather than my mind and it’s driving me crazy. I don’t get it.\n\n"}, {"title": " How do you handle the negative stuff in life (self.entp)", "likes": "17", "comments": "48", "content": "- Rejection \n- a low grade at school \n- people outperforming you \n- being too generous and feeling used by people \n- remaining self desciplined even though you don't want to do it \nThese are the things that come up on the top of my head but I would love to know what my fellow entp's would do when life comes at them sideways.\n\n"}, {"title": " I’m so confused about whether I’m melancholic or just an insecure sanguine. (self.entp)", "likes": "5", "comments": 0, "content": "Y’all know the “4 personality types” concept? So I’m having trouble figuring out. Here’s sum about me: according to my parents, I was jumpy and hyperactive when I was a child, but then I got super asocial when I got into kindergarten, and I still am. Sometimes I noticed “excitement and confidence” outbursts in myself, especially when performing, and that really isn’t something a melancholic would do. I also have social anxiety, and I don’t do groups at all. Theories, anybody?\n\n"}, {"title": " Looking for an example of a specific type of character in media. (self.entp)", "likes": "7", "comments": "8", "content": "I’m looking for a super pompous and pretentious atheist who openly worships everything about science in front of others to give an image of being a super intellectual, when he’s not even intelligent, let alone educated. He attempts to denigrate at length anything “psuedoscientific” that he encounters on a daily basis, fails to solely due to a complete lack of understanding of anything he’s read on the subject, and does not ever comprehend that he is always wrong. Yet, he’s in an esteemed position due to nepotism.\nI don’t know what type this person would be, but he should be british.\n\n"}, {"title": " Tested ENTP for 5 years, got my first ENFP (E at 56%) (F at 58%) (self.entp)", "likes": "10", "comments": "12", "content": "I've found myself getting more and more introverted over the years which was at the same rate I found myself also hating people more and more. Lately I've been mindful (unsuccessful in practice, naturally.) about self growth and health n all that shit. AKA a lot of thinking that I have found myself discussing less and less with people bc tbh I'm over debating with people, I am my own devil's advocate, I debate with myself. My brain is the processor and also the quality checker of the scope and validity of my ideas, other people could never do that, never scratch that itch and most importantly not gauge the unnecessary (necessary to me) depth of everything. So it's a waste of energy for the most part. Hopefully you guys can assume there are some people I share with if they have the brains or the ears for it. \nSo I'm wondering is this characteristic of ENFP? can the F have been misconstrued from the fact i am now maybe an INTP?\n\n"}, {"title": " What Factors Best Predict MBTI Type? (self.entp)", "likes": "8", "comments": "10", "content": "Good Afternoon ENTPs, \nI am interested in studying what types of factors often correlate to MBTI type. In other words, what stereotypes are most likely to be true of MBTI types in terms of hobbies, interests, and relationships? Your input as an ENTP is greatly appreciated.\nIf you want to participate in this brief survey (more than likely only 3 minutes). I would appreciate your input. You will be able to see the results after you complete the survey. Thank you so much for your time!\nhttps://docs.google.com/forms/d/e/1FAIpQLScirNg2LqQGnJWjvxbVQGOmwRRKFJMUMI7PSZykZSrN1FHOYg/viewform?usp=sf_link\n\n"}, {"title": " Staying committed (self.entp)", "likes": "10", "comments": "2", "content": "I, like almost everyone here, have a hard time staying personally committed to things that aren't self-regulated by others for me. What are some ways you've had success staying committed?\n\n"}], [{"title": " INFP here. I look up to ENTPs and part of me kinda wants to be one. (self.entp)", "likes": "76", "comments": "94", "content": "I love getting into arguments and would like to build up enough confidence to tease my friends more instead of being quiet 80% of the time. I could go on writing a wall of text but I don't really feel like it plus none of you would read it either way :p\nEDIT: after further introspection and help from you folks I’ve found that I lean more towards INFJ. Nonetheless my desires remain the same (though I may want to use my wording more carefully since I overlooked the difference between wanting to be someone and wanting to be like someone.\nEDIT 2: If I have to be honest with myself (and after reading a few comments that really inspired me and made me think) I believe I've come to recognize myself as ENTP. I came into this knowing very little and wishing to learn more. My views on what it means to be extroverted or a \"thinking person\" were very childish to say the least. I've realized that one doesn't need to go to massive parties every other day of the week to be extroverted (small chaotic gatherings with friends and a need to draw attention to oneself count too!). Feeling empathy for others is something all humans, except sociopaths, have (Being Ti /=/ heartless monster). I've always wanted to know about others point of view but I have to admit it's not as easy as I thought (to REALLY understand them, not some fake superficial level of empathy). Maybe I was quiet this entire time because I was afraid of not being accepted by others if I were to open up. Maybe I don't know what I'm talking about :p (thank you all)\n\n"}, {"title": " Why are all of my friends feelers? (self.entp)", "likes": "87", "comments": "50", "content": "Is there some sort of subconscious \"opposites attract\" type thing going on? It gets kinda lonely though, since they're all emotional, while I'm obviously not. Don't get me wrong, they're great people, but it gets a little alienating at times. Just wondering if you all have any experiences like this, I guess. \n(Edit: types are ENFP x2, INFP x2, INFJ x 1, ISFJ x1)\n\n"}, {"title": " Sick of quarantine (self.entp)", "likes": "20", "comments": "12", "content": "I haven’t seen any friends or family in over two months now, and have only been around my subhuman blue collar coworkers that I’m an alien to.\nI don’t have the motivation to do anything, even though I want to get back to skating, get back to photography, kendama, learn shuffling, temper my language skills. This isn’t like me. I don’t even crack a smile most days. I’m not even thinking things through anymore or being logical. I’d honestly say I’m in a loop of some sort, I just don’t know what it is. I’ll get occasional spurts of motivation and inspiration, (full of ideas and plans) then I’ll just fall back down, and end up doing nothing at all. \nMaybe if I had family it would be different? Fuck this\n\n"}, {"title": " Do you find yourself to be more cynical than others? (self.entp)", "likes": "12", "comments": "10", "content": "Personally I find find myself to be that way\n\n"}, {"title": " Help I’m falling in love (self.entp)", "likes": "31", "comments": "34", "content": "I kept myself in check for so long but now my power is diminishing, soon I will be completely at his mercy, lord help me!\n\n"}, {"title": " ENTPs are known for saying \"random\" things that surprise people and make them think/ponder. But what is something someone has said to you that has made you do the same? (self.entp)", "likes": "7", "comments": "1", "content": "I'd love to know what people have said to you ENTPs that has made you go, \"Wow, okay that was interesting\"? It seems like while you guys are often intrigued by what others have to say, you're rarely ever \"taken aback\" by anything anyone has to say. So, what is something that has made you feel taken aback?\n\n"}, {"title": "What do you guys think of ENFJs? (self.entp)", "likes": "6", "comments": "18", "content": "I’d love to know what your guys experiences with ENFJs have been and what the ups and downs were like.\nPositives/negatives\n\n"}, {"title": " Commitment and what does it look like (self.entp)", "likes": "7", "comments": "4", "content": "The recent threads about relationships and feels has got me thinking. Personally times are good and emotionally I feel quite stable. These times I believe I am a \"true\" ENTP and I'm able to express my Fi in a matter which makes logical sense. This is questions that are for the more mature ones here, which were or are in stable fulfilling relationships - What is stopping you from moving on to \"a better partner\"\nThe strive for a better self has long been ingrained in me. My curious brain wants to learn more things and new things interest me, and in relationships it's no different. Each person comes with pro's and con's, and it really depends on the current cycle of my life that dictates whom I want to be with. Obviously this is selfish and unfair to the recipient, but for those who are not in this internal struggle, what's stopping you from walking out to find better things?\n\n"}, {"title": " Freedom of speach? (self.entp)", "likes": "8", "comments": "8", "content": "Having thoughts about this today esp since some youtubers have been banned. \nI believed we should not censor people however I am changing my mind.\nWhat if someone wanted to start a channel on mass genocide of white people? I think that should be censored tbh.. \nIf that's the case then we agree there should be some criteria for censorship?\n\n"}, {"title": " Personal values (self.entp)", "likes": "7", "comments": "8", "content": "Some of my personal values and are: \n\nExcellence - Always strive for perfection in your work and what you do in life.\nIntegrity - Uphold a value or purpose, be honest, and don't deceive others of your intentions. \nIntensity - Live your life to the fullest, and commit to anything you do with 100% effort.\n\nWhat are you guys' personal values, motto, or principles?\nAlso side note, a lot of friends have called me Type A personality, and I know that doesn't seem like the cliche ENTP trait. I'm wondering how many of you guys are also type A?\n\n"}, {"title": " What would an ENTP 2w3 be like? (self.entp)", "likes": "6", "comments": "5", "content": "What would an ENTP 2w3 be like?  Heavy on the Fe?  Unhealthy?\n\n"}, {"title": " Need advice (self.entp)", "likes": "8", "comments": "18", "content": "Hello, I'm an INFP and I've been dating with this ENTP since November. I need some advice or maybe someone to talk to. I think he's not ready for a relationship (even tho yes, we ARE in a relationship). He recently told me that having to call me feels like a chore. I never insisted on that. In fact I'm fine with just texting. He's not a texting person on the other hand but i got used to getting phone calls because i love him. He said i feel like a burden sometimes and he has broken up with me before because he was overwhelmed by the relationship(and i need to add, i never insisted on a relationship, i told him we can take things slow and just enjoy our time together) I know people will just tell me to cut him out of my life but i want to do my best for him. I want to make him happy and feel cared for. I know he's very stressed for the anatomy exam we will take in 4 days and he didn't study enough and kept procrastinating and that's also another reason why he wasn't feeling like calling me. He said none of these are my fault but i need to accept he cannot give 100% all the time. I wish i was someone he was looking forward to talk. I wish i could ease his pain.\n\n"}, {"title": " Three questions: How do you learn best? What genre of stories do you like? What writing style suits you best in order to enjoy reading a book? (self.entp)", "likes": "5", "comments": "2", "content": "I'm planning or writing a book filled with individual short stories geared specifically for ENTPs. \nOutside of the pure stories, the book will include the path to growth, developing functions, and so on. It'll have actionable advice embedded into the stories. \nAlso, the advice won't be including the idea of functions. It'll just have pure situational perspectives which allow for self-awareness to happen just naturally.\nIn order to write this book in the best way possible for you guys, I'd appreciate if you answered the following questions: How do you learn best?  What genre of stories do you like?  What writing style suits you best in order to enjoy reading a book?\n\n"}, {"title": " New Myers-Briggs dating app - So Syncd (self.entp)", "likes": "12", "comments": "13", "content": "Hi! It's Jess (INFP) and Lou (ESFJ) here. We're two sisters who have recently set up a dating app and website based on Myers-Briggs personality types called So Syncd. I don't think either of us currently know any ENTPs, but your comments online never fail to amuse us! \nThe app has only just become available in the app stores (iOS and Android), but we've had thousands of sign ups already.\nFirstly, we wanted to let you know about it because we thought it might be of interest. We've had lots of people get in touch to say they are having some amazing conversations and they've never connected with such great people on a dating app. Most people aren't meeting up in person at the moment due to coronavirus, and of course, safety comes first, but the app usage has gone through the roof as people get to know each other better online and make meaningful connections.\nSecondly, we are refining the UI/UX at the moment and we'd really appreciate any feedback (either on here or at [hello@sosyncd.com](mailto:hello@sosyncd.com)).\nIt's totally free to sign up and it only takes a couple of minutes to do so, if you know your personality type already, which you guys obviously do! You also have the option of searching for specific personality types. You just need to search for So Syncd in the App Store or Play Store or follow the link to the website below.\nWe hope you are safe and well during this challenging time. Jess and Lou x\niOS app link: https://apps.apple.com/gb/app/so-syncd/id1495153823\nAndroid app link: https://play.google.com/store/apps/details?id=com.sosyncd&hl=en\nWebsite link: www.sosyncd.com\n\n"}, {"title": " What is Validation for you? (self.entp)", "likes": "8", "comments": "4", "content": "As an ENTP what do you guys value the most or what perspective gives you guys a sense of validation?.  What typical feature do you guys think is specifically extremely for an ENTP to flourish in whatever they aspire?. I think it is confidence but let me know your thoughts\n\n"}, {"title": " How Do I Know For Sure That I'm Entp? (self.entp)", "likes": "6", "comments": "3", "content": "Help me out here boys. \nSo basically, every time I take a test I get ENTP, and I've acted very ENTP since I was a small child. But also, I did not have the best upbringing, and it's quite possible the \"logical emotionless argumentative Break All The Rules\" thing is just because I'm traumatized. \nNow that I'm older and have worked through some stuff, I'm still very ENTP (I'm still very objective, logical, and analytical, Or So I'm Told), but I do a lot of behaviors that don't fit the mold as well.\nI'm supposed to be extroverted, but honestly there's only a few people I like talking too, and even then I'm not incredibly eager to do so. I don't run out of Social Energy, I'm just usually content to do my own thing. I'm supposed to be thinking, and while I do love to use Facts And Logic to make an argument, I also try to phrase said argument as tactfully as possible, partly because I want to my point across as clearly and effectively as possible and partly because I genuinely don't want to hurt the person's feelings. Oftentimes I'll realize something about a person or situation and I'll choose to say nothing because I realize that it wouldn't do anything besides make someone feel bad. I'm supposed to be perceiving, but honestly I do like making schedules and plans and sticking by them, even if they are eccentric and very flexible. I even like organizing things. \nSo what's up? Am I just a well integrated ENTP? Was I never ENTP in the first place? Am I just putting too much stock in stereotypes?\n\n"}, {"title": " All the ENTPs I know suck, change my mind. (self.entp)", "likes": "4", "comments": "17", "content": "To be fair, I don’t know a ton, but the select few that I’ve come across are all aggressive and very annoying. So, what makes you guys cool?\n\n"}, {"title": " Do you value Empiricism over peoples feelings? (self.entp)", "likes": "3", "comments": "11", "content": "Do you value Empiricism over peoples feelings?\nView Poll\n\n"}, {"title": " Entp and hobbies (self.entp)", "likes": "4", "comments": "4", "content": "Does anyone here have a hobby ?? And how u guys have an hobby without getting bored ??\n\n"}, {"title": " How do ENTPs show/ fall in love ?? (self.entp)", "likes": "59", "comments": "50", "content": "INFP female here !! \nI have been talking to / dating an ENTP male, we are in our early 20s. We have been talking for about 4 months, texting every day, etc. and I have really grown to like him. Last night I was emoting and I felt this really weird powerful rush of feelings which idk what that was. (Im less emotional and feely than most INFPs and I dont like feeling things). I am very happy with where we are and how it is going.\nSo im not sure what THAT was. \nTL:DR; And so I want to know, HOW do ENTPS feel and express those same kind of emotions/love? How do you guys know you are in love?\n\n"}, {"title": " I'm an ENTP and have had the best friendship with an ESFP (self.entp)", "likes": "13", "comments": "9", "content": "I've been thinking for a while about MBTI compatibility. I am very outgoing ENTP, i have very large circle of friends and an amazing squad of close friends that are mainly INFP INTP INTJ and this ESFP! Although i am a social butterfly and usually enjoy conversing with everybody i rarely really connect deeply with sensors.\nThe surprising thing tho is i found myself to be most comfortable and compatible around my ESFP best friend. Even more than the INTPs and INTJs it's a different kind of connection though. We are both extroverts both laid back and carefree so when i'm bored he's always there to have fun and try new experiences. We both enjoy all sorts of experiences even though from different angles he's also a very knowledgeable ESFP especially in biology. And when i'm playing with ideas and brainstorming about something and the possibilities in things he always impresses me with hardcore concrete facts that i feel learning a lot. We both are natural comedians but like in a compeletly different fashion that always amazes me. He always asks weird hypothetical questions just to see me and our INTP friend talk about it because he always finds those fucked up controversial opinions funny. We somehow have great intellectual conversations even though it's not debate but just me mentally exploring and him listening and providing different perspective it's still so fun.\nI made this post just because the thing about MBTI compatibility. Although it makes sense in theory it's much much more than that and people are different and have grow to have different preferences and needs.\n\n"}, {"title": " Today I finally found out a song that has been an ongoing unsolved mystery that comes up in my mind weekly or so for about 16 years and now I'm a bit confused! (self.entp)", "likes": "13", "comments": "6", "content": "About 16 years ago, give or take, so around 2004, (I'd have been about 22 at the time -- has it been that long! I remember it like it was yesterday and now I feel old, and I'm not yet 40) I was at a work social event and there was music on in the background, and there were 2 songs that stuck in my head. One I've been aware of a long time since then... the other, has been a mystery to me for those 16 or so years, because although I could hear it in my head I couldn't google it as I didn't know the lyrics and so on. But I've been searching for it since.\nAnd searching and searching... to, I guess, \"fill in\" some information.\nOver the years I've periodically searched -- not sure if it was just because I wanted to recreate the image of the moment (fellow ENTPs will surely know how that is), or if I genuinely liked the music. (I do have a very eclectic taste in music) ... but at least once a week it has been occurring to me \"what the hell was that song?\" There are apps that you can sing into and it will try to analyze it and figure out what it matches in its data banks,.. tried it with no results.\nI started to doubt myself about whether it even existed, although I knew rationally that it did.\nSo, today, after 16 or so years, I was just listening to our \"local branch of national broadcaster\" radio station whilst working from home on a project, and they played a clip of this song as part of a random feature.\nI couldn't believe my ears.\nI replayed it, grabbed the lyrics this time, googled it... and now I finally have it, this song, in hand.\n​\nThis was the last great unsolved mystery of my life. I know it sounds silly ... but I felt like perhaps it doesn't really exist, and now I know that it does, and I have listened to it probably about 20 times already today.\n​\nAnd for the curious, what was it?  https://www.youtube.com/watch?v=8mGBaXPlri8 : Tatu - All the things she said\n​\nI'm kind of tickled that it turns out to be not some great luminary of music history (like if it was the Beatles or so on) but just something normal, but for the longest time it felt like it was the \"key\" to something, if I were to ever find out what it was.\n\n"}], [{"title": " Keeping old stuff (from school, 'the past', etc) - do you fellow ENTPs tend to keep stuff like this? Do you ever go back to it and if so, do you toss it out much later? And any sense of nostalgia? (self.entp)", "likes": "17", "comments": "10", "content": "Hey, so I am currently confined to the house because of virus related lockdown and taking the opportunity to go all Marie Kondo and finally clear out my shit. I've been feeling for a long time that the amount of mess around me is a burden on my state of mental wellbeing*, as it seems quite 'oppressive' and so on... but somehow always a little too lazy to do anything about it. I left home at 18 and I'm now 37, and while I don't think I still have anything from the original \"my first place\", I have been in the habit of boxing up miscellaneous stuff and moving it from place to place, rather than purging as I went.\n[* I am always hyper-aware of my surroundings, have above average situational awareness and so on. It isn't anything \"new age\" about being burdened down by possessions but more literally that I don't have a clear field of vision... everything in a 180 degrees around me is mess.]\nIt's a major point of conflict between me and my (INTJ) partner, who has a much more \"minimalist\" approach, and also he went through a similar phase about 5 years ago in which he tossed out all his stuff and basically started again. He doesn't understand why I would keep anything from exes, school, etc. (He also doesn't see how it is possible to remain friends with exes, which is a whole other thing!)\nI wouldn't categorise myself as a \"hoarder\" -- although my house (when I lived on my own) might have resembled some of those 'Hoarders' tv programs it's a different motivation ... often I just can't find the energy to throw things out, but when I get into the mood for it I am quite happy to toss things. I don't hold on to them just because \"this might be useful in the future\" or \"fear of scarcity\" or stuff like that. If I could pay a \"professional declutterer\" to come and help me out I would, but my INTJ-partner insisted that I need to work through this myself rather than take the 'shortcut' of throwing money at it and getting someone else to do it for me. (He's said similar things about \"outsourcing\" the mental work of doing something myself to others in other situations as well. He believes very much that you have to \"work through\" the thing rather than just offload it, in order to Be Better.)\nSo my question to you guys is - what do you think/feel about holding on to relics of the past? It could be things like notebooks from school, old photos, letters, a few clothes that no longer fit (not a whole wardrobe's worth, and the motivation is in preserving the memory rather than thinking I'll actually wear them again). Even things like old files on computers, you know how it is when you get a new computer and have to copy all the files over from folders like 'backup 2 final'.\nMy mom kept all my old school stuff, and passed it on to me a few years ago. I'm not going to get rid of that, mostly because when I was reading it some of the stuff was really funny and/or I remembered it in some way and it was just a blast from the past.\nBut I have been tossing out and deleting stuff from the \"more recent\" past, say from about 10 years ago, that I did go through in a previous purge and decided to keep but now can't think why. Things that were related to me and my ex (long term relationship, 15 years) because although the relationship ended I still had fond memories of that time.\n(As an aside... I lost (in embarrassing circumstances) the memory card from my phone which had the last \"selfies\" my ex and I took of ourselves as he was leaving, as it was sort of a sentimental moment. I felt stupid about that, and vaguely emotional once but then nothing.)\nSometimes I've an urge to \"return to the past\" a bit (seems unusual for an ENTP on the surface (insert \"Is this Si?\" butterfly meme), but I am still sure of my type).\nLast year, for example, I went to a 20 year (has it been that long!) \"Class of 1999\" school reunion. I'd been looking forward to it for a while -- the reunion is held in the school itself, and I was curious to see how much had changed in 10 years (since I went to the 10 year reunion) and also, maybe, to \"re-experience\" some of the good things that went on there. Of course, it had changed a lot, but many of the places were still recognisable although they seemed much smaller than they had at the time (keeping in mind I was 17, not a kid, and pretty much the same physical height and size as I am now at 37).\n​\nTL;DR : how do you guys feel about 'nostalgia'? Do you feel any urge to keep old stuff, to 'return to the past' in some way? Have you tossed things and regretted it later?\n\n"}, {"title": " Behave like ENTP online, awkward as an INTP irl (self.entp)", "likes": "13", "comments": "8", "content": "I've noticed that on Online medias, I do like to socialize and meet new people. Share videos, make calls, begin conversations with strangers, debate random stuff, troll and stuff.\nBUT, in real life I remain a Introvert bastard, only talking when someone talks, avoiding contact at all. And  the major stuff  : Dislike of Physical contact.\nI have no idea whether this is Inferior Si, or if I'm just fucked up mentally, but I dislike friendly intimacy, like touches that people do when laughing together, hugs, pushes, taps, you get it. \nI mean, when I got into college, I was super social, talking to everyone, but as soon the \"physical plays\" like pushes, taps, etc, I taked that as bullying or so, due to past highschool experiences, and isolated myself.\nStereotype asides, I find this really weird, enjoying exploring the world and meeting people, doing stuff, being in parties, debating, but somehow reluctant of physical touch. I don't know if I'm INTP or ENTP only due do this duality.\n\n"}, {"title": " Avoiding manipulation? (self.entp)", "likes": "7", "comments": "9", "content": "Hey everyone\nSo lately I've been more conscious of the way I treat others and I'm starting to realize what a shitty person I really am. I have an INFJ boyfriend and I find that whenever I really want something out of him I fall into unhealthy manipulation tactics, then once it's all said and done I feel like a total asswipe and think about what I could've done differently.\nHas anyone else been part of this abuse cycle as the perpetrator? How did you break out of it and what are some first steps to take to change myself for the better? I don't like being part of the evil manipulative Satan stereotype, yet it's been who I am for longer than I remember, but I only realized it until recently.\n\n"}, {"title": " Iq and depression (self.entp)", "likes": "6", "comments": "7", "content": "I recommend watching from minute 50-60 but at around minute 53 jordan Peterson suggests that religion is for those that are stupid and dumb ppl should follow a more conservative approach. What do you guys think about that? \nAnd this leads me to wonder, are ppl with low iq more likely to have mental health issues and be in need of abstract systems like religion to help keep their moods regulated while the more intelligent people don't need it as much since they are more say, mentally durable and can withstand the hardships that are caused by the complexity of life simply by virtue of a high iq. Could be why ppl with high iq live healthier happier lives. Ik this is a dangerous thought and that ppl for some reason say smart ppl are more likely to have mental health issues and i don't think that might be the case. \nCan we try and view this other perspective? \nhttps://youtu.be/PqpYxD71hJU\n\n"}], [{"title": " If I could encapsulate my experience as an ENTP-T in a few lines I would put it thus (self.entp)", "likes": "93", "comments": "47", "content": "If I could encapsulate my experience as an ENTP-T in a few lines I would put it thus, excuse the poor grammar - I never learnt all the rules of the English language as I spent those classes doing anything but (including teaching myself French and German). Please bear in mind I’m writing this at work avoiding my real duties and also deprived of caffeine. I know I’ll end up rewriting this at some point and add several degrees of accuracy, articulation and nuance, but for now this will do as my first post to this great forum of ideas. Let me know if you can relate.\nSo, I oscillate between 2 main states of being:\n\nIncredibly high levels of passion for new ideas, new surroundings, people (for the potential they represent) and high levels of action in attacking new hobbies and skills. In this condition (my favourite) I feel like there's an infinity of opportunities, I’m attracting very interesting people into my life, I’m stoic, permitting nothing to hinder my inexorable rise and progress towards my lofty goals (yet highly expressive and people feel quite clearly captivated by my charisma, especially romantic partners, or potential ones). I feel an abundance of positive emotions, at the very least above neutral. I am the life of the party, whilst simultaneously feeling grounded and self-assured of my own uniqueness and skills. Exploration, growth and intellectual stimulation are my raisons d'etre.\n\n2)~Until the great pendulum swings the other way...resulting in disinterest in those ideas which had held so much sway in my mind and which, for that brief period had imbued me with so much vitality, passion and purpose. I find that I shift gears, operating at an incredibly low level of output. As I’m disconnected from my emotions, I get frustrated at my lack of drive and willingness to overcome this bout of laziness. I push harder, fruitlessly attempting to infuse some positivity and proactivity into my increasingly rigid corpus. My charisma lessens but being an excellent mimic I can somewhat fake it (while I still care to do so), but I feel exasperatingly impotent - like I’m watching opportunities pass me by through a narrowing pair of binoculars. I turn to escapism, disgusted with myself and the world. Weed has been a major theme in my youth, as have psychedelics (although nearly always safely and responsibly) however these days I prefer to just read (I’m steadily rounding off my sharper edges). I’m always aware of the utter futility of my actions, including the more hedonistic ones - even they fail to instil the perverse anti-authoritarian passion in me that they did in my youth after I’ve reflected on them and decided that they’re rationally pointless (and the novelty has worn out) - I could go on but I think you know where I’m going with all this.\nGenerally-speaking: I crave novelty, I’m promiscuous, yet loyal to whoever makes it through the great-filter and who I deem worthy of extended contact. I’m extremely open minded to all forms of experience (at least until I decide it doesn't add enough value), especially related to the Arts, aesthetic experiences, music, and intellectual activities - oh and whatever gives me a huge burst of adrenaline. I enjoy conversing with experts in their fields, and I've always dated people and made acquaintances with much more mature people than myself, typically a decade or more older. Travel, in a free-form and loose fashion, is the ultimate antidote to my existential angst. I can read for days and regurgitate my thoughts on that or insert references to that material in conversations with interlocutors of all intellectual calibres (always framing it in a relatable way, I’m good at that). I rapid cycle between ideas, hobbies, activities. I have a lot of natural ability at almost everything I try, I'm a fast learner. I could be anything, and yet most of the time I don’t stick to things and choose to be nothing - which frustrates those around me, especially the less-able ones. People view me as a really high-accomplishing, super smart individual; however, I am my own harshest critic and understand that the more I know, probably the further away I am from completion.  Meditation and Yoga help...for a while, but I don’t do them regularly enough for them to become real tools. All in all, life is rather the kaleidoscope of random experiences and I wouldn’t change my personality for the world.\nThoughts?\n\n"}, {"title": "Fuck off automoderator (self.entp)", "likes": "193", "comments": "41", "content": "Every thread I open I have to scroll through your self-righteous bullshit. Get a life, cuntguzzler.\n\n"}, {"title": " This mbti thing is BS (self.entp)", "likes": "31", "comments": "25", "content": "The mbti isn’t that deep, it’s too simple and it’s unrepresentative obviously. But it does get similar people together sure however:\nStop wasting time trying to make your personality fit something that isn’t necessarily you.\nStop making threads about how this or that relates to being an “entp” in a rhetorical way so you can get validation to act a certain way or think something about yourself.\nIt’s cringe worthy, and a waste of time at best.\nThose of you who do this are bordering astrology territory\n\n"}, {"title": " A guide to being less shit (self.entp)", "likes": "136", "comments": "25", "content": "THE ENTP Development Guide \nEach letter in the personality type code - E, N, T, and P - describes a preference for a way of thinking or behaving. There are eight styles and you use all of them, but ENTPs prefer:\n• Extraversion: \n• iNtuition\n• Thinking\n• Perceiving\nIf your closest personality type is ENTP then you are someone who challenges the status quo, seeking to uncover the hidden potential or new possibilities in different situations. You start projects and introduce change on an experimental basis, not knowing fully what is going to happen, but in the expectation that it will lead to an improvement. You enjoy the challenge of doing something that has not been done before and seems impossible. \nMental Functions:\nThere are two groups of letters in the personality type code:\n The two letters in the middle (N and T) refer to your preferred mental functions. In total, there are four functions (Sensing, iNtuition, Thinking, and Feeling) that correspond to regions of the brain. You use all of them, but the letters NT indicate which functions you prefer using.\n The letters on the outside of the code (E and P) indicate which function is dominant in your personality. The letters also describe how you like to use that function.\nThe dominant function of an ENTP is the perceptive one of iNtuition. This means you like looking at information from a global viewpoint, spotting new patterns and relationships, that lead to an understanding of the key issues. You tend to focus more on possibilities for the future than the here-and-now, and you enjoy change, challenge, and variety.\nThe perceptive iNtuition function is extraverted (Ne). That is, iNtuition is used primarily to govern the outer world of actions and spoken words. You therefore try ideas out in practice, to explore new possibilities and discover, by experience, which ones work. You prefer to change procedures to see if any improvement can be made, rather than just operate them. You therefore take an evolutionary approach to development, perhaps with an eye on the strategy which can change. You are more interested in exploring ideas than bringing them to closure.\nMental Function Development \nTo understand the ENTP’s development, we have to understand the hierarchy of mental functions for the ENTP. ENTPs are most comfortable with the Dominant Function Extraverted Intuition and least comfortable with the Inferior Function Introverted Sensing.\nThe timeline for the following steps is not set in stone, an ENTP with directed effort can accelerate the development of the non-dominant functions to achieve GOD TIER faster.\n1 – Development of Extraverted iNtuition (Ne) \nChildhood – Puberty: As children, ENTPs will develop the Extraverted Intuition function. They will enjoy fairy tales and may ask their parents to read them stories about fantasy continually. They may also find it hard to be attentive in the classroom, being more interested in the future and their imaginations than in the present. If this function has not been supported for development, they may grow up to be overly stubborn or narrow-minded, not having sufficient insights to make wise conclusions.\n2 – Development of Introverted Thinking (Ti)\nPuberty – Age 25: During puberty, the ENTP will start developing the auxiliary function, Introverted Thinking. They will develop a strategic mind and enjoy games and activities that require them to stretch their thinking and imagination like Esports and debate. They will enjoy subjects that combine their capacity for imagination and logical thought like Philosophy & Astronomy. If they have not properly developed this function, they may grow up to be extremely overbearing and stubborn, not willing to listen to the viewpoints of others and to come to conclusions prematurely.\nAreas of Development \nI imagine a large amount of the Reddit community to be currently at this stage developing our secondary function (Ti) before advancing further on the main storyline. Here it is important we farm XP in order to level up before proceeding to the next area. \nAssuming an environment supportive of their development of the dominant and auxiliary functions, most ENTPs would have developed Extraverted Intuition and Introverted Thinking by 25 years old or so. Their areas of improvement will most likely come from the underdeveloped sides of Extraverted Feeling and Introverted Sensing.\nHere are some suggestions for improvement:\n• Follow through on your projects (Si)\n• Give encouragement and praise to others for good work (Fe)\n• Be attentive to detail (Si)\n• Be more sensitive to the feelings of others (Fe)\n• Organise your time and your life better (Si) \n3 – Development of Extraverted Feeling (Fe) \nAge 25 – Midlife: At the age of 25, the ENTP will feel the tension to continue growing and start developing the tertiary function, Extraverted Feeling. With underdeveloped Fe, ENTPs are very polarising characters, people either think our directness is refreshing or think we are assholes. By working on Fe we can more easily relate to others especially those with a preference for F over T and influence those who were previously put off by the standard ENTP approach. The ENTP can further develop the Extraverted Feeling function through these simple exercises:\n• Think about the people in your workplace that have aided you or have done good work for you, write a note of thanks and encouragement.\n• When you get into a debate with someone, consider the other person’s point of view and what is important to him/her. Learn to adjust your stance to find a mutually beneficial outcome.\n• Ask some of your co-workers out for lunch and get to know them personally. Put all work-related discussions aside and seek to know them as individuals.\n• Add value to as many others as possible and watch the mental and material rewards come back to you in full. \n4 -Development of Introverted Sensing (Si)\nAt midlife onward, the ENTP’s focus turns toward the inferior function, Introverted Sensing.\nThe underdeveloped Introverted Sensing of the ENTP comes out childishly when they are under stress; they become extremely indulgent in material pleasure or put their focus on unimportant details.\nIn midlife however, there is an unconscious (or conscious if trying to accelerate achievement of GOD TIER) shift and desire to develop that inferior function in order to achieve wholeness and continual growth. It is an uncomfortable but necessary transition.\nHere are some simple exercises to consciously develop the Introverted Sensing function:\n• When you are given a task, do not jump into it immediately. Instead, break the task down into sequential steps and allocate a certain time to each task before proceeding to execute the task.\n• Write up tasks you need to complete the night before, do not structure the tasks in terms of time (unless required for work etc.) and tick them off as and when you get bursts of energy throughout the day. \n• Combine mundane attention to detail tasks with something you enjoy, i.e. listen to podcasts/audio book while doing housework. \n• Recall a significant event that happened before in your life, recount the details of this event: the sights, sound, smell, touch and taste. Do not try to make connections or consider implications but consider the event as it is.\n• Master Level: Wake up early every morning (5-6am) and complete the task on your list that is most daunting. This is difficult and you won’t be able to implement it overnight, however, knowing that what needs to be done is already complete allows you to no remove any feelings of guilt associated with taking time for leisure activities.\nFinally, practicing Yoga or Mindfulness is an extremely effective tool to help ground ENTPS in the intricacies of the present, developing Si.\nDevelopmental Side Quests (Optional but Encouraged)\n\nWork out your values as a human being. A set of objective traits or characteristics that you believe to be most valuable in yourself and others, write these down. It is important with any plan or aspiration to make sure it is aligned with your values or you will struggle to maintain long term focus. \nLearn a musical instrument, music is the combination of frequencies and imagination, a perfect opportunity to use both Ne and Ti. There is also a plethora of evidence to suggest that musical competency has marked impact of cognitive function in all stages of life. \nLearn a foreign language. Our interpretation of the world is limited by our linguistics. Learning another language not only provides us with another programming language for interpreting the world but also opens up more connections in the brain (excuse my pseudo-science) further enhancing our Chad ENTP prowess. \nMentor and be mentored. We all have something to learn and something we can give, no matter our age, occupation or education. \n\nI hope this helps, sorry for spelling mistakes, I'm to lazy to correct them. Also this advice is good and I should probably follow it. Have a great day!\n\n"}, {"title": " Your ENTP Care and Handling User Guide and Manual (self.entp)", "likes": "326", "comments": "38", "content": "Congratulations! You’ve come into possession of a rare and often exhausting ENTP unit! Now that you have your very own ENTP here are a few helpful tips and tricks to maximize the fun on their maelstrom of…. stuff…..\nYour ENTP comes with:\n\nFour everyday outfits\nOne extra snazzy suit for special occasions\nOne mobile device for research and communication purposes\nOne laptop for next-level research and communication\nOne gaming console and accessories\nFive complex strategy games\n\nSoftware\nYour ENTP comes pre-programmed with the following traits:\nNe: Your ENTP can generate 45,673 ideas per minute, change subjects at a rate that will make you dizzy, and is always interested in anything and everything. Loves to make comparisons or analogies that make no sense but they will insist it works perfectly.  \nTi: Your ENTP unit will want to analyze and understand ALL THE THINGS. If interested, will demand as many details as possible. They may process by arguing to see all sides of a situation or idea. Favorite questions are why? And what do you mean?\nFe: Your ENTP has the uncanny ability to pick up on other’s emotions, and will occasionally push to see just how far they can go socially. Low-key cares about people and their opinions and doesn’t really like conflict among friends or loved ones (but good luck getting them to admit it).\nSi: As this is their lowest function, your ENTP unit will struggle to keep track of things and lose their keys frequently. Also, makes them prone to buck tradition in favor of doing something novel, but may have strong attachments to certain memories or people.\nGetting Started\n\nPlace your ENTP in front of an open computer with the internet browser open.\nTell them that they can’t accomplish something.\nShow them your favorite meme.\nChallenge them to beat you at your favorite strategy game.\nIf your ENTP unit has not booted up yet, bring 2-3 friends to talk about their nerdy interests or favorite TV shows.\n\nModes\nEccentric Scientist Mode (default): Your ENTP will get very excited by whatever random idea or talent or skill happens to catch their eye and obsessively research it on the internet for a good 2-3 days. Then they will dedicate their life (and a considerable financial investment) to master this project. Within two weeks it will be added to the clutter of abandoned or “In progress” projects in favor of something new.\nTony Stark (default): Your ENTP will fire up their impressive mental capacities to whirl through countless ideas and possibilities to find the best possible solution for nearly any situation. Be forewarned; just because an idea makes sense to them and they are convinced that it’s amazing, doesn’t mean it’s actually foolproof.\nManipulative Bastard: When your ENTP brings their tertiary Fe out to play they can be manipulative little bastards.They are scarily perceptive of what others are feeling and thinking. On the innocent side, they’re sassing you back within hours of meeting you. On the devious side, they know just how to pull your strings to get what they want.\nDetached Robot: Activated when your unit is angry, stressed, or sad. If your ENTP unit refuses to “talk about it,” complains bitterly that life always sucks, or removes themselves from society to bury in a project, then things are BAD. Resist the urge to push ENTP to open up about it or fix their problems for them. Chances are your unit has already been overthinking the situation and needs a mental escape. To restore to default mode: keep them company and try to redirect their attention to a favorite project or interest.  \nRelationships with Other Units\nNF: Your ENTP unit will often appreciate the depth and understanding of the NFJ’s and enjoys the random and giggly fun that comes with the NFPs. Caution is advised, however, as NF’s care quite a bit about their feelings and opinions, which your ENTP may find to be boring or muddled.\nNT:  Relationships with NT types can go one of two ways for your ENTP:. They will either be in mutual delight over how logical and similar the NT’s brain is or your ENTP will reject the NT as useless, arrogant, and not worth tolerating. They can either end up as an awesome power duo or a cold rivalry.\nSJ: Your ENTP will most likely view SJs as useful tools to uphold society, but not good for much else. Your unit will tend to be aggravated by their reliance on tradition or repetition but could stand to learn a thing or two about order and stability.\nSP: This combination is double trouble. Your ENTP secretly admires the SP mastery of their physical environment and will often attempt feats that are beyond their abilities when around SP types, especially XSTP.  Generally, they get along well but don’t leave your unit unsupervised with a group of SPs.\nFeeding\nYour ENTP will forget to eat if not reminded. When left to their own devices, will often skip meals and then wonder later why they are dizzy, grouchy, or exhausted. Feed regularly to ensure they maintain a balanced diet and peak mental efficiency.\nGrooming\nYour ENTP will often put effort into picking out outfits and combinations, only to throw on whatever works for that day and cover the rest with charisma. Remind your ENTP to brush their teeth, shower, and exercise, as they often forget to do so for periods of 2-3 days.\nSleeping\nYour ENTP generally views sleep as a waste of time and do so only when absolutely necessary.  The preferred sleeping pattern is to stay up through the night and catch up by taking naps throughout the day. ENTP will stubbornly insist that this works (it doesn’t). Send them to bed anyway.\nFrequently Asked Questions\nWhy do ENTPs like talking with people, even those they aren’t particularly fond of? What do they find in that?\nYour ENTP’s Tertiary Fe enjoys watching people react to things, especially things the ENTP causes. They derive a certain smug pleasure from watching people react predictably (Ti) to purposely offensive, crazy, or outlandish actions or claims. On a less sinister note, your ENTP most likely views pretty much everyone in the world as a potential friend or resource, so they are more than happy to connect and see what happens.\nMy ENTP won’t shut up about season 6 of Battleframe Nebula. What do I do?\nYour ENTP unit is very excited about their newly discovered interest and likely is one of the most knowledgeable persons in existence on the subject. Ask two or three generic questions about their new interest, such as what do you like about [insert name of new interest]? Or ask them to explain it. Above all, do not panic: within two weeks they will have forgotten about Battleframe Nebula.\nMy ENTP has decided that organizing or planning things is a waste of time. How do I fix it??\nYour ENTP unit has most likely decided that things will work just fine if they go with the flow. Your unit has a preference for keeping their calendar in their head, which is subject to constant change. Point out to your unit that a keeping a written schedule helps them see where they are budgeting their time and helps others know when the ENTP will be available for socializing.\nsource\n\n"}, {"title": " Just a feel good love letter to all the ENTPs (self.entp)", "likes": "245", "comments": "57", "content": "From an INFP who fell in love with one of you guys, you ENTPs are the most genuine, fascinating brains I have ever met, the way your thoughts jump around at erratic and lightning speeds, bouncing from A to D to B, C, X, Y and back to A, it gives me mental whiplash to try and keep up with you. You force me to bring my A game whenever we dive into deep discussions, where I’m used to giving 20% effort to the majority of the population and having them be satisfied with me, you make me want to be 100% of my most interesting, unique self when I’m around you. \nYou push me to levels of weirdness I’ve only known how to suppress, and encourage me to go further. When I’m with you I feel like I can be as honest, open, dark and twisted as my deepest desires and you would accept me unblinkingly. Nothing shocks an ENTP!\nBeing around an ENTP is honestly, intoxicating. I get high off our completely uninhibited and just downright dirty fun conversations, the matching levels of spontaneity, the crazy ideas and speculations that you blurt out that I want to always be around to catch before they disappear into thin air. The simultaneously playful, warm, and detached attitude you bring to sex.\nYou all make yourselves out to be such evil assholes, and openly, gleefully embrace this side of you, but despite all of the sarcastic talk I can see such a goodness and love of humanity shining through. Despite any past mistakes or fuckups I believe you’re all just giant puppies deep down that want to be loved and want those you love and care about to be happy, and that unconditional love is the purest form of love I know.\nSincerely, lovingly, admiringly, \nFrom an INFP :)\n\n"}, {"title": " Anybody else ever feel like you're too intelligent to relate to people? (self.entp)", "likes": "217", "comments": "36", "content": "My teacher told me I am a failure and won't amount to much.\n\"If you don't work hard, your grades will remain in the trash,\" she said.\nI smiled my brightest smile. She was furious, \"You think I'm joking? Bloody bastard!\".\nI replied, \"Yes ma'am. You won't understand, but I am an ENTP.\"\nShe fell backwards, dumbfounded, \"Bu-but h-how? ENTP is one of the edgiest and most strategically capable personality types.\"\nHer eyes widened in horror as I leaned in, my lip curling in a smile and said, \"I was born as a mastermind, ma'am. With my staggering intellect and 420 IQ, it isn't a surprise I'm an ENTP.\nIt’s lonely at the top and it is often a challenge for me to find like-minded individuals who are able to keep up with my relentless intellectualism and chess-like maneuvering. I know it all too well but this harsh reality is unlikely to stop me (an interested ENTP) from achieving results.\n“You are not entitled to your opinion. You are entitled to your informed opinion. No one is entitled to be ignorant.” I said as I turned to the class and signed off, \"ENTP\" and smirked.\nThey all started clapping. The loudest clap in particular was from the student at the back. That student's name? Nikola Tesla. Elon was there too. The hottest girl in the class ran to me. She was smiling, and said, \"Oh my god, you're such a legend. You make me so wet with your high IQ. You've gained my respect and you're oh so funny. Please, take me to your mansion and fuck me.\"\nWe went to my mansion and we had mad sex that night. I blasted her heads off with my imaginative yet decisive, ambitious yet private, amazingly curious cum.\nBehold! The ENTP.\n\n"}], [{"title": " Arguing with Ni-Te is utterly insufferable (self.entp)", "likes": "38", "comments": "58", "content": "i have three INTJs in my life right now and don’t get me wrong, they’re great, but disagreeing with them...about anything....automatically activated the purest form of low quality gaslighting and middle school logic. \nOk they start off logical, sure, calm, unemotional. \ni say something. \nThey tell me they disagree \nand i ask them for their argument. \nStep 1: “You Said That Cup Is Red, I Say It’s Green, You’re Wrong Because All The Cups In Siberia Are Green”\nwhat are they ever fucking talking about? i don’t care what other people say that’s the entire reason i’m stating that i disagree. i’m not automatically wrong because i don’t fit your criteria? if i fit your criteria...i wouldn’t be disagreeing. that’s not how that works lol. it’s all so goddam Te oriented. Their argument is normally a list of reasons my argument is wrong but they are never able to accurately describe, in depth, why they think a certain thing without using (usually unrelated) criteria. it is always an offensive justification of me being wrong instead of a defensive statement about what they actually think:\nit goes like this:\nentp: i don’t agree with this criteria\nintj: the criteria is right\nentp: why do you say that?\nintj: because your point is wrong because it doesn’t align with the criteria \nyea no shit? it’s a completely circular and nonsensical argument. like...what?\nStep 2: “I Just Know You’re Wrong, Trust Me, My Ni Says I’m A Savant”\nwhen i push them to give an individual argument as to why my argument is wrong, i am either met with a Fi dismissive, sensative attitude (at this point the conversation is a total goner). or i’m met with some complete and utter Ni bullshit. i know that everybody likes to pretend Ni isn’t the most absolute bullshit, egotistical, and frustrating function- but it is. it’s cute sometimes but when that Ni canon is firing at you i swear to god, the only answer is to run and hide. don’t get me wrong, all these NiDoms have the right to their opinions just like everybody else, but you don’t get to tell me i’m wrong and then refuse to tell me why and hit me with that “that’s just the way it is, i just know it, i understand how it works but i can’t explain”. and then go all Fi on me when i won’t validate your Ni-prophetic assertions about why i am a complete dipshit. \nStep 3: “If I’m Right, You Can’t Be Right, So Shut Up”\nnever expect them to validate your points. if it doesn’t fit their big picture it’s all wrong. “i see what you’re saying but it doesn’t match my opinion so it’s wrong.” i often tell people in arguments when i agree with smaller points they make even if i don’t agree with their entire argument. if they present a logical idea i will validate it. NiTe NEVER does this and will never be thankful for your smaller validations of their ideas because they want to win. and if they can’t win they will emotionally or intellectually tap out.\ni see so many Ni doms on reddit and in real life say that they like to explore ideas from multiples angles which is completely delusional. that’s Ne not Ni....they will explore the implementation (NiTe) or the motivation (NiFe) behind ideas like nobody’s business but once Ni says “jump” they say “how high?”. and NiTe says “how high exactly? what do i do after i land? everybody who doesn’t jump exactly like me is wrong, let me give them you unsolicited advice about how to jump like me.” and if you ask them why why they are jumping they wont answer and will tell you that you’re wrong for not jumping too. \nStep 4: If You Don’t Agree With Me, You’re An Oppressor and A Retard \nat this point in the conversation, i feel like i’m going totally fucking bananas! it’s either completely dissolved into Ni-horseshit or it’s Te hitting me over the head with facts that DONT MATTER, or its Fi shutting down like a child and thinking i’m a bully for asking you to prove why you say that i am wrong? and then they say they’re worn out or change the subject but will never ever admit to being wrong. ever. \nexcuse my rant & typos and shit, i’m just so peeved, \ni have been in several personal and  in-class discussions with INTJ friends lately and i swear to god it’s not worth it. its not worth the trouble. do not engage. walk away slowly. never look back. \ni find working with intjs to be such a wonderful fluid experience. but disagreeing with them might be worst than any of the other types.\n\n  it’s not entirely illogical Fi stuff which tickles my Fe into just giving them a hug and realizing i don’t care lol. \n  it’s not a fact/practicality based argument (Si, Se, Te) which is honestly refreshing at times. \n  it’s not a Ti analysis of my Ti analysis which is always lovely. \n-it’s not another Ne expanding my argument and making me forget my entire point \n  and its certainly not a criticism of my point from a more broadly empathic lens (Fe)\n\nit’s a shitshow combo of all my weeknesses, uses poorly, against me. which is...so bad. \n\n"}, {"title": " movie which shows how to recognize artificial breasts .. (self.entp)", "likes": "1", "comments": "5", "content": "movie which shows how to recognize artificial breasts .. https://img.joemonster.org/upload/reg/17327890f18fb2dyt_676542154.mp4\n\n"}, {"title": "I’m so sorry. You all were right. (self.entp)", "likes": "21", "comments": "32", "content": "You all were right. Woke af now. I’m sorry for everything, and I’d like to thank this community from the bottom of my heart. It’s been a pleasure pretending to be one of you for almost 20 years of my life.  \n-Alljay_Everyjay, former ENTP,  born again ENFP\n\n"}, {"title": " It's a Wonderful List (self.entp)", "likes": "65", "comments": "67", "content": ""}, {"title": " What do you think comes next? (self.entp)", "likes": "7", "comments": "23", "content": "So when the internet was originally invented, it was primarily a way for the Department of Defense to let multiple computers communicate with one another all the way back in the late 1960s, and then in 1990 the world wide web was invented. As time went on, the internet's utility towards certain areas (ahem porn) encouraged rapid development, and it became a platform for not only tech geeks and the lonely, but for everyone. This was only further reinforced by technologies allowing access to the internet away from home, work, or school. Anyone on reddit can attest to the overwhelming influence the internet has on not just individuals but society, and how 24/7 access to nearly unlimited information has completely changed the playing field for how we move through the world.\nNow that the internet has completely taken off and is a fundamental part of developed society, what do you think will be the next big invention / advancement that will set developed society on its ear?\nMy personal take? I think the farther we go into replicating the reproductive process and being able to interfere with the \"natural\" (natural here not being good or bad, just meaning minimum interference of medicine) way of reproducing, we're going to see a major shift in society's mentality towards reproduction. I'm getting at the growing possibility of artificial wombs, being able to restructure eggs and sperm into functional zygotes, and/or things like CRISPR being able to modify zygotes towards genetic optimization.\nTL;DR: The internet (and associated technologies) radically changed life as we knew it. What big advancement do you think will have similar effects? Do you agree/disagree with my assessment? Why or why not?\n\n"}, {"title": "Yo, any tips on how to read? (Time management) (self.entp)", "likes": "8", "comments": "18", "content": "Fellow entps, is there anything you've found helpful in getting yourself to or motivating yourself to read, like books and maintain the focus to do so? Sometimes it comes easy and I get lost in the story, sometimes I stare blankly at a page for ten minutes skimming over a paragraph. \nThanks yo\n\n"}], [{"title": "So I made a few albums of famous ENTPs (with quotes!) (self.entp)", "likes": "44", "comments": "26", "content": "This is how I've been procrastinating the past few hours. I tried to find quotes that had an ENTP flavor, but I may have come up short on a few. I also excluded people whose types are hotly contested (e.g. Barack Obama, Bill Hicks, George Carlin, and a few others). Feel free to argue any of my entries or even add your own! Hope you enjoy!\nFictional Characters\nAuthors and Philosophers\nModern Entertainers\nScientists, Artists, Politicians, and others\n\n"}, {"title": "ENTP on personality cafe gives advice based on what he's learned (self.entp)", "likes": "33", "comments": "10", "content": "Advice For ENTPs...What I've Learned So Far\nI would describe being an ENTP as one of the biggest blessings and curses of my life. One side of me wouldn't trade it for the world and the other side wishes I could wake up tomorrow as an ISxJ. \nWe don't make up a large part of the population, and thank goodness! Can you imagine if more people were like us Anyway, I've been alive for 29 years so I figured I would post some useful information about what I've learned so far from being an ENTP. \nMost People Will Not Get You\nOur Ne makes us super creative! It can come up with endless angles and possibilities. \nENTPs corner the market when it comes to sheer imagination and creativity. I don't think we ever fully \"grow up.\" We can literally look at a blank piece of paper and create a scene or idea from it. \nHere's the problem. Most people will not appreciate your endless supply of ideas. \nThis includes other intuitives as well. It overwhelms them. \nThey get annoyed or pissed off. We live in the world of possibilities so jumping from one thought to the next, one idea to the next, is great for us. But, others don't see it like we do. \nI think many ENTPs try to impress people with their wits and ideas and end up doing the opposite.\nAt worst, smart ENTPs can come off as crackpots. \nMost people think we're smart but somewhat neurotic. \nThe few that become millionaires or wealthy are labeled as \"Visionaries.\"\nSolution: \nDiscuss, debate and talk about half the ideas you come up with. Be selective! When around people, use your Ne to come up with quirky and funny observations that make people laugh. Think of Chandler Bing on Friends. He's an ENTP. Save your ideas for people who can handle them (not many) or when it matters. \nNo Middle Ground, We Win Big or Lose Big\nENTPs not balanced by nature. I would say that we are the ultimate gamblers in life. \nOur natural inclination is to go completely all in when we're interested in something. \nI was looking at average incomes for all 16 personalities and was surprised that ENTPs were the 2rd from the bottom. \nOnly INFPs made less. I was thinking \"what the hell, I thought we were supposed to be smart!\"\nAt first, I thought the stats were wrong. \"Someone messed up on the numbers, \" or \"the test base was flawed,\" I reasoned. \nBut then, the answer hit me like a lightbulb! We win big and lose big. \nIn other words, either we harness our Ne to become successful or we waste it. Circumstances and luck have a slight role to play in it as well. If there were, theoretically, 100 ENTPs in the USA, then 10-15 of them would be massively rich and the other 85 will be broke. \nWhat's more, and this comes with personal experience, we leave things right before they come to fruition or afterwards when we get bored. \nSo sometimes we are on the cusp of hitting the \"jackpot\" but leave right before it's going to pay out. Or, we're successful at being a dairy farmer and then take everything we have and invest it in orange juice commodities :O\nSolution: \nIn baseball, we all want to see home runs but its base hits and pitching that wins games. It's in our nature to try to hit the home run. We live for that. Being average is not in the books for most of us. We're creative and we want everyone to know it. The only way this can be arguably measured is by making lots of money. So we want to always win big. I've learned to try to make a dollar first before trying to make a million dollars. \nNote: I have a successful internet marketing and web design business but I have lost tens of thousands and time going after risky deals, options and poorly thought out business ideas. \nUse Fe To Interact With Most People\nThis is big! I also learned this the hard way. Do not use Ne and Ti to interact with most people. Yeah, a few people will think you're amazing, but you'll lose more people than win. \nDevelop your Extroverted Feeling (3rd function) by watching, befriending or interacting with ENFJs or ESFJs. They will teach you a lot. Fe gives you the biggest net when it comes to people. \nIt will help you make friends, be liked and SELL your ideas. You might have the best idea but your Extroverted Feeling will help you get people excited about it. \nUsing Ne + Ti to interact with people is fun for you but it's like fishing with a pole. \nYou'll catch some fish here and there. \nUsing Fe is like finishing with large commercial nets. You'll catch 1000s of fish. They're jump right into the boat!\nFe allows you to win people over and once you do that, then you can slowly introduce your Ne. \nExample: Oprah and Will Smith. Everyone loves them. I am 100% sure that Oprah is an ENFJ and 60% sure that Will Smith is. Are those people amazingly smart. No. But, everyone loves them. ENFJS are the best at talking about other people's ideas, other people's talents and pumping them up. They can cheat through life, without ever knowing anything (not implying at all they are dumb) because they can \"piggyback\" off smarter people than them. \nSupercharge your Fe to the best of your ability. The best way to do this is to see Fe dom people in action. I become friends with a guy named Reed 5-6 years ago and that's when my Fe took off. I didn't know anything about MBTI or functions at the time but I was amazed how he effortlessly made friends. I don't think he had one enemy besides other guys who were jealous of him. \nI studied his patterns, how he talked to people and thought process and do my best to duplicate it. When I make a conscience effort to do it, I get the desired results most of the time. \nPlan of Action: \nYou have Fe in you but its not well developed. Don't wait to develop it later in life. Do it now. You can get to point A to Z faster with it. You'll be able to have a bigger network, which will assist you with what you really want to accomplish. If you want to be successful, then you will need people. Lots of them. Fe allows you make friends with whoever you need to, in the shortest amount of time possible.. \nRelationships Will Be Hard For You\nThe combination Ne + Ti will make you relationship challenged. Accept it. That combo produces traits that are not naturally good for long term relationships,.\nAgain, this is where your Fe comes in. You'll be able to attract the most amount of men and women with it.\nThe problem is that you'll get bored from using this function too much. ENTPs can be sweet and personable at first but after a while the dominate traits will manifest themselves. You might have held your tongue with your girlfriend during the first three months of the relationship but sooner or later she will see the \"real side.\"\nAlso, I am tired of websites saying that INTJs and INFJs are the best match for us. I think that is bullsh*t. \nWe make decent work partners with them but in life the Ne vs Ni has major complications. Be aware of it. Ne + Ni is not the Cinderella pairing that people make it out to be. \nI'm not saying both types cannot work with us but don't think that those two personalities are your natural soul mates either. \nINTJ:\nMany INTJs get annoyed very quickly with ENTPs. I love them and have several as friends but I stopped talking about my ideas with them a long time ago. They have one singular focus in life, are not fun to debate with and take life way more serious than you do. While you are just thinking your thoughts out loud, they are thinking what an idiot you are because you have not researched your facts. They only talk about things they know 100%. \nHowever, they are loyal, insanely smart, don't beat around the bush and if you can get past their strong outer shell (keep trying even when you get nowhere the first couple times), it can work. But don't go into it with \"rose colored glasses.\"\nINFJ\nThis match it better than the INTJ for relationships because at least we share two functions. A big plus about INFJs is that they are actually pretty darn logical though has aux Fe. \nINFJs will blow your mind by their insights on things. Again, all N functions are not created equal and Ni and Ne do completely different things. They will be annoyed by your Ne if you use it too much. They will try to understand you with their aux Fe but that first Ni function is so powerful, it might make things very challenging. They don't bounce around and like long term goal setting, even if they never do it. \nAlso, they have a hard time with action. Like INTJs, they are insanely smart and will usually have a long term plan. However, they have a very hard time implementing the plan. If your two overall goals line up then its a go. They will make the plan and you will make it happen. \nBut if they do not, forget about it. They will be super passionate about this one thing in life and your mind will be everywhere, and trust me, from experience, after a while it gets tiresome. \nYou'll be trying to motivate her/him to do something but Ni can rarely be persuaded to do anything unless they think of it themselves. \nSolution: \nThere is no hard solution for this one. Each one will have to approach this landfill the best they can. Despite what Kiersey and other books say, I personally think SJs are the best for ENTPs. They're loyal, with do all the 101 small things you forgot to do but need to do (like wash your clothes and file your taxes) and love your \"go getter\" attitude more than they hate your \"impulsivity.\" Surprisingly, I have seen many ENTPs have good relationships and marriages with ISFJs. SJs have tertiary or inferior Ne. They want to be more spontaneous, want to do new things but just don't know how. If you can be just a little more \"stable\" than you otherwise would, they work out better than people give them credit for. \nKnow Your Role In Society \nIt's no coincidence that the population is unevenly distributed among the 16 types.\nMost of the world are SJs or SPs. They make up the largest percentage of the population. They hold the entire world together. SJs do things in a more regimented way and SPs do things in a light-hearted, fun way, but they both accomplish the same thing. Think of them as the foundation or glue for Earth. \nNFs make the world a less cruel and more compassionate place. Without them, we would have blown ourselves up decades ago. \nNTs are responsible for creating things. They move technology forward. Most of our gadgets can be attributed to some NT coming up with it. \nMy point: NTs are rare for a reason: our world doesn't need too many of us. We need just enough of them to invent new things (Ne) or improve upon the things we already have (Ni).\nENTPs are made to create. Your whole function stack is made to come up with new ideas that nobody else is thinking about. \nIf you are in a profession or job that is not doing that, it's time to change. You will never be happy with your career or life if you are not doing what you were born to do. \nYou will never find a happy ENTP as an accountant or brick layer (you can make a lot of money at those jobs btw, so its not about the money). You need to engage yourself in jobs that utilize your Ne + Ti. Period.\nCreate. Invent. Explore. Just know that your talent is not easily translatable to the general population. You're an Extrovert but for all practical purposes, a lone wolf. Develop your people skills to interact better with the mundane physical world while at the same time working on generating unique possibilities that will set you ahead of everyone else in life. \nNe can be your best friend or worst enemy. Be aware of it and don't get butt-hurt when people don't get you. Oh course not! You are talking about things that don't exist in their mind. You can see it, plain as day, but they can't. \nHowever, when you become an instant millionaire some day, everyone will wonder in amazement how you did it. They just thought you were an funny yet average guy. Then, you can tell your story. Then you can unleash your complete Ne + Ti and everyone will call you a genius. People will wish they had your talents. \nOkay, I am done rambling. Looking forward to people telling me what they think.\nLink\n\n"}]]}