{"data": [[{"title": "Symbolisation in the Netflix show, \"Freud\" (self.Freud)", "likes": "2", "comments": 0, "content": "Just wrapped up the Netflix show, \"Freud\", and historical accuracy aside, I feel like there is some heavy symbolisation in the show. For starters, the bust of Freud in the intro sequence changes to reflect the episode name. I am just wondering if anyone noticed or read anything interesting or managed to peel back layers.\nFor e.g.-\n\nInspector Kiss (imo) reflected superego. His profession of punishing people who break societal rules also seems symbolic.\nMucha, the opera singer, reflected oral fixations. The fact that he was a singer and he also bit people when he was hypnotized was an interesting pattern.\n\n\n"}, {"title": "Question of Freuds dream theory / the unconscious (self.Freud)", "likes": "10", "comments": "4", "content": "(Disclaimer I'm still very new to Freud, so please forgive).\n​\nWhat is the unconscious actually trying to achieve in a dream? -- I understand it's disguising messages to get past our censor, but is it only pre-occupied with trying to fulfil basic primordial desires (sex, food, anger etc)?\nHow would this explain dreams that offer deep and meaningful insight, once interpreted? \nFrom my limited understanding, it seems like dreams would be purely destructive and bad for us if they were only driven by unconscious desires?\nAlso, side question: is the unconscious good, bad, or neither? I ask that in the context of it helping us progress our character (be better, more integrated civil individuals).\n\n"}, {"title": "What would be Freud's idea on \"the state of nature\"? (self.Freud)", "likes": "10", "comments": "2", "content": "I started reading civilization and its discontents and I am wondering, if he believes people are discontent and suffering in society because their \"death drive\" is restricted, because they want/need to be violent and sexual but are not allowed to(briefly and hopefully correctly stated), does he then believe that before civilization people were very violent, killing each other, raping each other and what not? Does he ever actually state his beliefs on humans before civilization?\n\n"}, {"title": "Psychoanalysis Beginner (self.Freud)", "likes": "9", "comments": "15", "content": "I want to star reading Freud. Which book should I choose first considering I’m a beginner? Thank you.\n\n"}, {"title": "Quick question about Freud episode 1 (self.Freud)", "likes": "3", "comments": "3", "content": "First, let me apologize. I tried to ask this question in a comment in another post about the show, but I think I asked it too late. I didn't want to make a post of my own, but this question is killing me:\nWhat is the piano piece that Clara is playing in episode 1? Does anyone know?\nThat piano piece was the only think I really liked about the show. As someone who has read many of Freud's works and is familiar with his biography, the show takes wayyy too many liberties. I didn't even finish the first episode.\nBut yeah, if anyone knows what she was playing on the piano, I'd really appreciate it if you tell me. Thanks in advance!\n\n"}, {"title": "netflix freud warum bayrischer akzent?! (self.Freud)", "likes": "4", "comments": "26", "content": "omg, warum bayrisch? versteht keen mensch! und die paar menecken die hochdeutsch reden hörn sich an als wenn deutsch ihre fremdsprache is... nur um dit ma klarzustelln: et jibt keen charmantn deutschen akzent außer die berliner schnautze! dit versteht och jeder! also berliner deutsch oda hochdeutsch (aber nur wenn deutsch die muttersprache is)\nik hab jedenfalls uff englisch umjestellt, die synchro is nich jut aber ik muss weniger untertitel lesen lol\nedit: @Nk-O relax mal! DU HAST JA RECHT! ich gebs zu! ich habe das pflichtfach \"deutschlands dialekte\" geschwänzt und mich geirrt... du weißt es besser!! gz!!! ABER et ging hier nich um die frage obs bayrisch oder wiener deutsch is, et geht darum dass ig als deutscher, wenn ig die deutsche tonspur wähle untertitel lesen muss um zu verstehen wat die da labern... sry thema verfehlt, setzen sechs! \nik verstehe ja dass dir die ausfgangsperre zu schaffen macht, bist nich alleine! geht uns allen so :O aber guck do mal ob de vll nich doch n besseres hobby findest als hier rumzutrollen?! versuchs mal mit origami, meditieren oder \"mütze-glatze\"! beruhigt körper und geist :)\n\n"}, {"title": "Questions about Freud Netflix Show (self.Freud)", "likes": "11", "comments": "26", "content": "Hello\nI heard that there is a lot of Forgeries and lies in the new show of Netflix.\nI want to know for example what is not true about Freud there.\nFor example: i never knew he was part of Detective story.\nThanks a lot.\n\n"}, {"title": "Netflix Series is so boring (self.Freud)", "likes": "24", "comments": "14", "content": "Since the Netflix Series Freud is pretty boring and doesn't really fit Sigmund Freud I would like to ask the reddit community if there are some suggestions for other movies / Series / Books that deals with all the  psychoanalysis stuff but in a more interesting way and not so \"ooky spooky mystery witch\" thing. I am really disappointed. But this is my fault. I expected something deep and overwhelming like MrRobot or something other. But in the End its just a regular entertaining Netflix thing.\n\n"}, {"title": "Freud (self.Freud)", "likes": "6", "comments": "4", "content": "Can someone tell me what is on Sigmung Freud's hand in the show?\n\n"}], [{"title": "Can someone explain me why the new Netflix series, Freud has nothing to do with psychoanalysis or his work? (self.Freud)", "likes": "42", "comments": "45", "content": ""}, {"title": "I began watching the new Freud TV-series today (self.Freud)", "likes": "21", "comments": "35", "content": "Is it based on real events? Are his patients in the series based on actual real-life cases or is it completely fictional? Are the characters in the series real?\n\n"}, {"title": "Guidance for reading ego and the id? (self.Freud)", "likes": "6", "comments": "2", "content": "It was suggested to me as a good place to start with psychoanalytic theory, however I’d such a dense read. Even while studying and breaking each page down, I can’t help but feel as though I  am not giving adequate attention to some of the more nuanced and subtle concepts.\nHow do you study these works and are there any tools you would recommend such as somewhere that breaks down the reading, etc.?\n\n"}, {"title": "Freud’d theories were disproved? (self.Freud)", "likes": "4", "comments": "8", "content": "Some of my friends and internet people say “Freud is nonsense, and also disproved by so many.” I thought they were just talking with no background and logical information behind it. I need some logical explanations to decide whether Freud was wrong about things or not. Please send me some links or book names, I will appreciate it.\n\n"}, {"title": "Books Suggestions (self.Freud)", "likes": "6", "comments": "1", "content": "Hey, I’m a newbie but I really wanna start reading Freud. Any suggestions for what to start with?\n\n"}, {"title": "Between Pleasure and Pain (self.Freud)", "likes": "3", "comments": "2", "content": "This is a post I wrote that briefly discusses some of Freud's ideas, but would appreciate pointers towards other works I may have missed but that may be relevant. \nhttps://unearnedwisdom.com/between-pleasure-and-pain-the-story-of-the-sacrificial-animal/\n\n"}, {"title": "Getting started (self.Freud)", "likes": "4", "comments": "6", "content": "Hello, I’m a 16yo and I recently started studying Freud by my own. I am the daughter of a geographer/social scientist, so I pretty much grew up among books and philosophy. My point is: I’ve been studying by my own since I was seven and have read a lot of books, but now I’m interested in Freud because he gave me the right answers to ask myself. My mother never seemed to mind, because I have always loved to study these topics and have always been more advanced in it than most people of my age, but my mom is pretty upset about me and freud because she says he’s different and studying him is a complete different thing. So I came here to ask for some tips about how to study him, some concepts I should be familiar with, things to search for, a phew links... anything at all that will help me in this journey!!!\n\n"}, {"title": "What would Freud have to say about incognito mode? (self.Freud)", "likes": "7", "comments": "2", "content": ""}, {"title": "Is free association worth doing despite these ‘debunking’ rumours? (self.Freud)", "likes": "4", "comments": "12", "content": "I just started free association with my therapist and I’m concerned about it. I’m a bit of a skeptic and have heard a lot about how Freud has been debunked. I don’t know if this is a waste of time or not.\nPlease can I hear some opinion on free association and it’s efficacy and whether or not it still has benefits? I’m confused about what has been debunked. Thanks.\n\n"}, {"title": "AMA with psychoanalyst this Saturday! (self.Freud)", "likes": "10", "comments": "1", "content": "Hey everybody,\nOn Saturday (11/01/19) psychoanalyst, clinical psychologist and co-founder of Berlin Psychoanalytic, Aleksandar Dimitrijević, will conduct an AMA here on reddit. At 15:00 CET he will be ready to answer all of your questions for about an hour. Having been in some of Aleksandar's classes myself (he also works as a professor of clinical psychology), I highly recommend taking this chance of venting all of your PA-questions, as the man is somewhat of a psychoanalytic dictionary. ^ _ ^ \nBerlin Psychoanalytic is our attempt at trying to make psychoanalytic knowledge and understanding of more than a century available to all. We do this, for instance, by inviting psychoanalysts and psychologists to record short videos concerning their areas of expertise and subsequently upload them on our youtube page. On the page you can also find some videos with Aleksandar, where he discusses psychoanalytic case studies, different psychoanalytic terms etc. \nIf you already have questions please post them as comments to this post. I will make sure that Aleksandar gets them. :)\nHope to see you on Saturday!\n Lisa at Berlin Psychoanalytic\n\n"}, {"title": "What does ‘vita sexualis’ mean (self.Freud)", "likes": "3", "comments": "1", "content": "I can’t seem to find the meaning anywhere.\n\n"}, {"title": "Interpretation of Dreams Summary (self.Freud)", "likes": "5", "comments": "2", "content": "I'm an illustration student illustrating some of the themes from Freud's Interpretation of Dreams. I'm finding it really daunting to have to read through all the book (I've read 120 pages so far) as I have a hard time reading. I was wondering if someone would be able to summarise the key themes but with sufficient detail that I will be able to understand them? Or if anyone has any good resources that explain his theories from the book but aren't as long then that would be really helpful. Thank you :)\n\n"}, {"title": "Frued's theory of origin of religion (self.Freud)", "likes": "10", "comments": "2", "content": "What did he say in his theory of origin of religion?\n\n"}, {"title": "Phallic Phase (self.Freud)", "likes": "9", "comments": "1", "content": "I'm currently learning about the Phallic stage in Freuds sexual development theory and it states that as children are maturing, they experience sexual/marriage thoughts towards the parent of the opposite sex. I remember that I actually used to experience thoughts of marriage towards the parents of the same sex, does that mean I may be subconsciously gay?\n\n"}, {"title": "Did Freud say anything about the varying strength of the Superego in individuals? (self.Freud)", "likes": "4", "comments": 0, "content": "Often see people who have super egos, or inner judges which are, say, more merciful. Whereas on the other side of spectrum,  the nature and cruelty of the judge can be disproportionate to the \"mishap\", or sin.\nWhat are your views on this?\nAlthough being in a fairly comfortable position, and an alright feeling with myself (all things considered), in general, I am easily wounded, sensitive and would say my inner critic is more cruel than it would be anything else.\n\n"}, {"title": "I’m 16 years old and I’m starting to have a growing interest in philosophy however I do not know anything about major philosophers and their views. (self.Freud)", "likes": "6", "comments": "3", "content": "Can someone please explain Freud’s main views and how it can impact my life?\n\n"}, {"title": "Belief in God and Death Instinct (self.Freud)", "likes": "11", "comments": "3", "content": "Freud stated that for one to have a belief in God is to have a desire for childlike regression into being breastfed by the mother, and a desire for a father figure to protect him. It is an immature state where the child with an undeveloped ego is unable to differentiate itself from its environment and wishes to experience an oceanic feeling.\nThen Freud speaks of the death instinct which comes wanting to return to an inanimate state, and that this can manifest into agression either towards oneself or towards others, and can manifest in the form of sadism or masochism. \nWhat I would like to understand is that, isn’t a belief in God also part of this death instinct? A belief that focuses us on a life in the hereafter and not onife on earth, and also by focusing on an oceanic egoless state, isn’t this also a very death based experience? How does one reconcile these two Freudian concepts of the death instinct and the psychology of a religious person?\n\n"}, {"title": "Is reading wit and its relations to the inconscious worth the time? (self.Freud)", "likes": "2", "comments": "3", "content": "Hi, I'm sorry if I seemed rude in the title. \nI have never read a freud book, but just heard about this book in a movie and wanted to know if it's still relevant to this day, or has the theories in it been debunked?\n\n"}], [{"title": "OSHO on Sigmund Freud's last year of his life (self.Freud)", "likes": "7", "comments": "2", "content": "Thought it would be funny to share.\nIn the last year of his life, Sigmund Freud called all his important disciples, the chief disciples. He was feeling death coming close, he must have heard the first steps of death, and he wanted to have a last gathering.\nThey were sitting at the table, nearabout thirty people from all over the world – all the chief disciples – and they started arguing about something that Freud had said a few days before. Freud was there; he was the host, but they completely forgot about him. They became so involved in the argument: somebody was saying one thing, and somebody else was saying something else, and somebody else was contradicting both. And they were arguing about what Freud really meant.\nFreud watched, listened, and then shouted, “Stop all this nonsense! Do you think I am dead? I am here, present – why don’t you ask me what my meaning was? And if you can do this to me while I am alive, what are you going to do when I am dead? You don’t bother to ask me, and you have wasted an hour in arguing with each other, fighting, getting irritated, annoyed, shouting at each other… And the master is present!”\nhttps://www.osho.com/osho-online-library/osho-talks/disciples-sigmund-freud-humanity-129a9568-587?p=819a842c04bb8ef18c69ec2995ff922a\n\n"}, {"title": "OSHO talks about an event that happened between Jung and Freud (self.Freud)", "likes": "16", "comments": "1", "content": "According to legend, Sigmund Freud and Carl Jung once traveled together on a train, and during the journey Jung began to analyze Freud, probing deeper and deeper into the man’s psyche in an attempt to pinpoint the origin of his neurosis. Freud was being his evasive self, so when Jung came to within a hair’s breadth of Freud’s essence, he impatiently asked Freud to reveal his innermost being, his true, real self.\n“I cannot,” Freud answered. “To do so would be to give up my authority.”\nAt that, Jung sat back and sighed, “Then you have already lost it.”\nThe real man is always ready to expose himself to the very core because he is not afraid. By saying: “I cannot expose my real self because to do so would be to give up my authority,” Freud is simply saying that he is carrying a pseudo self around himself. He carried it his whole life. Although he was the originator of psychoanalysis he was never psychoanalyzed. Many times his disciples approached him and said, “We can psychoanalyze you,” but he always refused. He was afraid.\nThis legend is very symbolic. Out of the fear of losing authority, he was afraid to expose himself as he was. But a real man of authority is never afraid of losing it. He cannot lose it; there is no way to lose it. This is the difference between a man of authority and an authoritative man. The authoritative man has no real authority; he is a pretender. The man of authority can expose himself absolutely because his authority is not something imposed from the outside; it is his very core, his experience, his authenticity.\nJung did well when he sat back and said, “Then you have already lost it.”\nhttps://www.osho.com/osho-online-library/osho-talks/sigmund-freud-c.g.-jung-authority-36ba6a6c-bb5?p=574a1f29c7f37ab65cb008520d85678b\n\n"}, {"title": "Super Ego and the lack of father figure. (self.Freud)", "likes": "5", "comments": "3", "content": "Ok so here's my question. If i remember correctly the super ego is built upon what our father figure thaught us, then later rebuilt by us using more idealistic \"father figure\" as based to get rid of all the \"bad behaviour\" of our super ego. So what happens when there is no father figure in a child's life? How does the super ego is built then? Does it make the psychological growth process slower in a sense? Thanks in advance!\n\n"}, {"title": "Just how relevant is Freudian theory in Modern Psychology? (self.Freud)", "likes": "9", "comments": "7", "content": "Like, are his big theories (Oedipal complex, Madonna-whore complex, Psychoanalytic theory, etc.) still believed, or disbelieved? And are there MHPs that specialize in Freudian theory and treatment?\n\n"}, {"title": "A great chapter on Freud's life and ideas (self.Freud)", "likes": "6", "comments": "2", "content": "The Discovery of the Unconscious was a great read. Highly recommended.\nA summary of the chapter on Freud : https://unearnedwisdom.com/chapter-7-sigmund-freud-and-psychoanalysis-the-discovery-of-the-unconscious/\n\n"}, {"title": "Freud on men (self.Freud)", "likes": "5", "comments": "7", "content": "I plan to sit in the library and read every single text Freud has on the nature of man. I want to understand myself a little better on the general level.\nreading suggestions, please!  of course if it diverges and is a student of freud jung/adler. I would like to read that too, but I am starting this journey with freud.\n\n"}, {"title": "Simplosion - News From the Edge of Mind (self.Freud)", "likes": "3", "comments": 0, "content": "Hi! We just launched Simplosion - a new psychology satire website. It's meant to poke a little fun at how seriously we all take psychology. We have one story that will certainly be of interest to this subreddit called Freudians Discover That Kyle Has the Sexiest Mom. If you're a psychology nerd this is for you! Sometimes a website is just a website - this is not one of those times.\n\n"}, {"title": "What happened to Freud's father's first two wives? (self.Freud)", "likes": "4", "comments": "1", "content": "Hello!  I need some help with finding information on Jacob Freud's (Sigmund's father) first two wives.  In particular did they leave him?  Did they die, and if so under what circumstances?  I've tried searching online as to how they dropped out of the picture finding only scanty information.\n\n"}, {"title": "Is there a Freudian analysis of sexual exhibitionism? (self.Freud)", "likes": "4", "comments": "1", "content": "Or a different psychoanalyst who writes about fetishes like this?\n\n"}, {"title": "Why was Freud against Surrealism art? (self.Freud)", "likes": "11", "comments": "6", "content": "Let me start off by saying I don't know much about Freud just the stuff Peterson said in his lectures but I know the basics.\nIn my art book for school it says that the art form called  Surrealism was based on Freud, where the world of dreams stands above the real world. It also says that Freud never liked surrealism and thought people like Andre Breton (their spokesman apparently) should be treated with therapy. \nI know next to nothing about Surrealism, art or Freud but this seemed like a weird statement. IF you come up with a theory and people make art based on those ideas, why hate it or despise it? Does anyone have any explanation for this?\n\n"}, {"title": "On Freud's examination of the Uncanny in Literature (self.Freud)", "likes": "5", "comments": "2", "content": "The Sandman, as drawn by E.T.A. Hoffmann himself\n​\nIt is often mentioned that Freud’s  Psychoanalytical theory has influenced literature very considerably.  Regarding stories that aspire to cause dread, his article on the Uncanny  in Literature provides good insight – particularly his interpretation  of “The Sandman”,  E.T.A. Hoffmann’s bleak and magical story of fiery  circles, monsters and doppelgangers,  is worth mentioning...\nThe  Sandman, the eponymous fiend of this story, is both a magical entity (a  flying beaked demon that abducts little children and uses their eyes so  as to feed his own offspring) and a dyad of mysterious men: an  ominously looking old lawyer, Coppelius, and a merchant of eyeglasses,  called Giuseppe Coppola. Both names etymologically are derived from the  Italian word for “eye”, and their links to the monstrous Sandman of  legend do not stop there.\nThe Lawyer Coppelius\nCoppelius  is a very unpleasant-looking man, who seems to despise children. The  protagonist of the story, the student Nathaniel, recalls how he hated  and feared Coppelius ever since he was a boy. While at first the  antipathy was caused by disgust at how the old man looked, as well as  due to the antagonistic attitude he consistently demonstrated when  invited to Nathaniel's family home by his father, later on Nathaniel  comes to regard Coppelius as the actual murderer of his father – whose  death took place during a chemical, possibly alchemy-related,  experiment.  \nCoppelius had already been  fused in Nathaniel's mind with the mythical Sandman – the child’s  governess was reckless enough to fill his mind with tales of horror, and  it should be noted that she was the one who first suggested that his  father’s night-time guest was the Sandman. Nathaniel always loved  stories of mystery and the macabre, so the repugnant and terrifying  figure of the winged and beaked Sandman soon assumed a central position  in his personal pantheon of ghouls.\nCoppelius  manages to escape after the apparent accident that killed Nathaniel's  father, and Nathaniel will only see him again – or at any rate believe  he saw him – years later, while studying far away from his home city.\nThe optometrist Giuseppe Coppola\nCoppola  first appears to the student Nathaniel wishing to sell him some of his  wares – lenses, small telescopes and eyeglasses. Nathaniel immediately  feels repulsed, because the visage of this merchant is uncannily similar  to the lawyer Coppelius'. At length, he decides to buy one of the  elegant lenses, which he will soon put to use so to have a better look  at the object of his desires: the university professor’s beautiful  daughter, Olympia.\nUnfortunately for  Nathaniel the gained ability to have a closer look at Olympia - a girl  normally isolated and confined to her room and only making her  appearance by the window - results to dangerous infatuation and the  dreaded sense that something is not quite right with her... For the rest  of the story he will persistently attempt to negate his worries,  despite the fact that they are consequently fueled by rumors circulating  among the students, according to which Olympia is bizarrely wooden and  barely ever speaks. Nathaniel is enamored and distances himself from his  old friends as well as his old fiancee who stayed back at their  hometown.\nTwo fathers, two father-killers and two sons\nHoffmann  uses doppelgangers in most of his works. In the Sandman there are at  least two notable pairs: Nathaniel has two fathers, the one who died  during the alchemy experiment and his university professor (who wishes  Nathaniel to marry Olympia, his daughter, and thus become his  son-in-law). There are also two killers of the father figure: Coppelius  (said to have caused the death of the father) and Coppola, who comes to  fight with the university professor over ownership of the wooden  automaton known as Olympia and mortally wounds him…\nThere are also, according to Freud, far more crucially two sons:\nFreud  does make a very convincing case when he argues that Olympia, the  life-like piece of machinery, appears to be in reality part of  Nathaniel. Indeed, the reader should note that while Nathaniel lost his  father, Olympia is virtually next to her father all of the time, and  whereas Nathaniel was scared by Coppola/Coppelius and the Sandman,  Olympia is perfectly fine with being restricted and ordered around,  docile and well-behaved. Freud argues that Olympia alludes to what the  child, threatened by a potentially dangerous father, created as a means  to avoid friction with the source of dread. Olympia can never antagonize  the father, whereas Nathaniel keeps getting into considerable trouble  in his attempt to come to terms with the various splits of the  father-image.\nIn the end, Nathaniel only  wishes to become one with Olympia, and if Freud’s analysis is correct  then this wish is only one for self-completion. The split part of the  youth can no longer stay away, it cannot be pushed away to another city  and live in perpetual exile. Of course Nathaniel himself is not aware of  the special tie to Olympia, yet everything about the story leads to the  conclusion that this uncanny dance of living and wooden forms is  orchestrated as an unwitting ceremony in honor of the father-image:  Nathaniel and Olympia risk losing their very eyes – with Freud referring  his reader to the psychoanalytic theory that links fear of losing one’s  eyes to fear of castration.\nIn conclusion\nE.T.A.  Hoffmann’s The Sandman is, arguably, one of the most elegant works of  dark romanticism. An uncanny story, presented masterfully – and one  where the deeper meaning is allowed to remain hidden, so that the reader  is free to be dazzled, surprised, horrified and indeed take part  mentally in this macabre dance of hidden emotions and repressed  memories. It was certainly a poignant decision by Freud to focus on this  work in his article, since its use of the uncanny in high literature is  paradigmatic.\nBy Kyriakos Chalkopoulos (https://www.patreon.com/posts/27630785)\n\n"}], [{"title": "Understanding Sublimation (self.Freud)", "likes": "9", "comments": "1", "content": "We all have impulses to do socially inappropriate things, we have sexual fantasies, that if we manifest in public, would be less than ideal. A solution to this plight of ours comes through sublimation, the redirecting of libidinal energy towards socially beneficial pursuits.\nThis idea from psychology was popularized by Freud, but he was not the only person who had something to say about it.\nhttps://unearnedwisdom.com/understanding-sublimation/\n\n"}, {"title": "Freud’s claim that the excavation of repressed memories and of historical artifacts is “in fact identical. (self.Freud)", "likes": "3", "comments": "2", "content": "At Michigan State University research on Freud seems to be hight actively. I found this page asking for papers for a conference which will be in June this year (2019) and after I've been stumbled on a lot coincidences..... (Maybe I can keep the storie short)\nI was angry about my new smartphone and the virus I had on it from the beginning. Oh it's more an parasite, because without google account the asus zd553kl is unusable, and there is no custom rom available yet. I was sitting outside a cafe and when leaving I found \"Wissenschaftliche Tabellen Geigy\" next to the shop entrance for free giveaway.\nSo the following is a list of links (mostly in german) to interessting anchors I've dropped. I have only skimmed the massive amount of text.\nhttps://medium.com/@daphne_38275/insitro-rethinking-drug-discovery-using-machine-learning-dcb0371870ee?fbclid=IwAR1lHbG8HkeYpEEjbQLdWP9qEi5QtxqGavevYDRJ25xFbSWvH_2bI8fGVfE\nhttps://de.wikipedia.org/wiki/Deutsche_Akademie_der_Naturforscher_Leopoldina\nhttps://de.wikipedia.org/wiki/Geigy\nhttps://de.wikipedia.org/wiki/Hans_Adolf_Krebs\nhttps://de.wikipedia.org/wiki/Hans_Krebs_(Offizier))\nhttps://de.wikipedia.org/wiki/Karl_Supf\nhttps://de.wikipedia.org/wiki/Otto_Warburg_(Agrarbotaniker))\nhttps://de.wikipedia.org/wiki/Otto_Warburg_(Biochemiker))\n------------ started with freud research because of https://www.youtube.com/watch?v=8UJXACKRMlw thx @theghostinme\n---- I had latin class in gym so I checked the flexiation: https://de.wikipedia.org/wiki/Genitiv\nhttp://www.charles-darwin-jahr.at/index.php?m=viewarticle&ar=403\nhttps://urly.it/31tsa (googlebooks:  Vom System zum Gebrauch: Eine genetisch-philosophische Untersuchung des... )\nhttps://de.wikipedia.org/wiki/Sigmund_Freud\nhttps://de.wikipedia.org/wiki/Hysterie\nhttps://www.youtube.com/watch?v=kOB68zpdv0g\nhttps://de.wikipedia.org/wiki/Anna_Freud\nhttps://de.wikipedia.org/wiki/Melanie_Klein\nhttps://de.wikipedia.org/wiki/C._Z._Kl%C3%B6tzel\nhttps://de.wikipedia.org/wiki/Hagana (hihihi the museums's house  at 23 rotshild blvrd, telavi was built 1923 xD sorry guys but this is to fuuny to mention I'm born on 23rd and raised in 23 ...street in ...heim, so i ever since liked that number)\nhttps://www5.in.tum.de/lehre/seminare/math_nszeit/SS03/vortraege/goett/gesetze.html\nhttps://www.amazon.de/dp/1580464610/ref=rdr_ext_sb_ti_hist_1\nhttps://de.wikipedia.org/wiki/Hexenverfolgung\nhttps://de.wikipedia.org/wiki/Wasserprobe_(Recht))\nhttps://de.wikipedia.org/wiki/Archaik\nhttps://de.wikipedia.org/wiki/Urgeschichte\nhttps://de.wikipedia.org/wiki/Eisenzeit\nhttps://urly.it/31ts_ (googlebooks: Aby Warburg and Anti-Semistin)\nhttps://de.wikipedia.org/wiki/Aby_Warburg\nhttps://www.hartmutboehme.de/media/Warburg.pdf; https://literaturkritik.de/id/16147\nhttps://de.wikipedia.org/wiki/Willy_Hellpach;\nhttps://de.wikipedia.org/wiki/Ideo-Realgesetz\nhttps://de.wikipedia.org/wiki/Psychomotorik\nhttps://www.researchgate.net/publication/259712835_Lydia_H_Liu_The_Freudian_Robot_Digital_Media_and_the_Future_of_the_Unconscious\nhttps://de.wikipedia.org/wiki/Scotismus\nhttps://urly.it/31ttg (googlebooks: metaphysik im barckscotismus)\nI think someone already read those and can explain more in detail about our species and the illness we all have....or freedom?  \nfor me this all gave me the picture: essence of human live in human history did not chance dramaticly. Most of the time to protect our brain cells ;) we are all believers.  After realizing ourselfs in childhood we always have to make creeds to them where came from and to those we will give us, in different amounts, like in love to the fullest.\nMaybe some even has a clou about the Michigan State University Human Studies Institute's conference paper topics.\nMaybe this is all nonsence and or waste of time please tell me...or  should I go to a psycholocial doctor?\n\n"}, {"title": "Original German Freudian terms? (self.Freud)", "likes": "3", "comments": "2", "content": "Does anyone have any resources they know where I can find these? Preferably online, but honestly anything is fine.\nI found a few terms in the original German online, but I can't seem to find a larger list of them. I'm really curious as I think the original German terms help clarify and explain concepts better since they are often compound (and more descriptive) words.\n\n"}, {"title": "Question about infantile sexuality, neurosis and perversions. (self.Freud)", "likes": "3", "comments": "1", "content": "Hello fellow redditors. I need your help.\nI have a project in my criminology class and I chose Freud even though I never read him before.\nFrom what I read I understand that in the development of a child's sexuality problems can arise and either cause a perversion a neurotic behaviour(bare in mind I am not sure if what I am saying is even correct).  \nMy question is what are some of this problems and what is the difference between neurosis and perversion (I know that the are like the opposite of eachother). I have read something about regression and fixaxion, but everything is just mixed I my head.\nThank you for your help :)\n\n"}, {"title": "Freud and The Avengers : A Discussion between Stan Lee and Sigmund Freud (self.Freud)", "likes": "5", "comments": "1", "content": "Freud and The Avengers : A Discussion between Stan Lee and Sigmund Freud \nBy Oliver Waugh \n“ I figured I would find you over here. You newcomers always long for what you have lost without noticing what you have gained” said Sigmund as he walked toward Stan Lee who was sitting off by himself look down on the world he just left. \n“Excuse me, who are you and why would you be looking for me” - replied Stan Lee \n“Really, I guess I should not have expected you to have the decency to even know the man for whom your life work is based on given that you never bothered to give me credit for my contributions to your movies” - answered Sigmund Freud \nClearly puzzled by the this statement Stan Lee smile and just replied “You must have me confused with some one else sir because my life work were comics. There were just things from my imagination that I hoped helped some enjoy the time they have down below.”\n“You are correct, the error is my mine. I have created expectations that are now clearly unrealistic. I guess you could say I let me “Id “get the best me” - clearly entertained by his pun Sigmund began to turn to walk away. \nStan did not completely understand what was happening but given that at times he struggled to see the significance of his life work, he was clearly intrigued by the fact that it seems like this man may have a unique perspective of the universe he created. So against his better instincts he shouted “Wait, what is an “Id” and what does your work have to do with mine”\nFreud always delighted to discuss his theory of the sub-consciousness turned around and replied “ Well Stan, The “Id” is all that we enter the world with. It is the part of you that gives you all of your most basic desires and instincts. It is what makes a baby desires its mom’s breast but also what makes man seek out those of his lover. It is the essence of humanity that is so basic that it is driving force in every human being.”\n“Is this what you believe you see in my marvel universe? If it is basic to every person wouldn’t you see it in every movie?” - asked Stan  \n“ The Id, while the most powerful part of the sub-conscious, is just one part of the sub-conscious” replied Fraud \nIntrigued by this Stan had to know “ How many parts of the sub-conscience are there”\n“They are three “ answer Freud \nContinuing the conversation Lee “ Do they also have names and what do they do?”\nClearly excited by the Lee’s interest in his theory Freud began to explain “ The other two parts are the Ego and the super Ego “\nInterjecting  Lee  wondered out loud “ Is that like what makes someone think highly of them selves and really really highly of themselves?”\nAnnoyed by this common mis-understating Freud just said “No, if you would restrained your Id for a second more I was just about to explain.”\n“My apologies, please continue” replied Lee \n“ The ego is actually the part of our sub-conscience that deals in reality. It is what tries to restrain the unrealistic desires of the Id. “ continued  Freud \n“ Sorry to interrupt again but I don’t get why one part of the sub-conscience would need to be restrained by another part of sub-conscience” asked Lee\nExpecting this question as it is commonly asked, all be in  different ways, Freud explained “The id is the most power thing inside of us but it is like a wild horse. It is great on the open plains but in society it can be destructive. The ego thus is the rider on the back of the horse trying to control it, even though it is not as powerful”\n“Okay, I think I get it. What about the super-ego, it is just a stronger form of the ego” Lee asked clearly interested in what he was learning. \nWith a smile, which was unusual for Freud he replied “ not quite. The super Ego is the expectations placed upon us by the world. It is the part of our sub-conscience that strives for perfection.  You can say it is the societal burdens placed upon us by our parents”\n“Interesting but how does any of this relate to the Marvel Universe i created “ asked Lee \n“You really don’t see it do you ” asked Freud rhetorically while shaking his head from side to side.  \nAs Lee began to answer Freud interjected “ Let me see if I can explain this to you in a way that you can understand. Each of the main characters of your Marvel Universe can be placed in a category of either the Id, Ego or Super-ego. ”\n“ Which ones do you consider the Id” asked Freud \n“ Hulk, of course “ Began Freud \n“That one I think seems, obvious” interjected Lee\n“ Then there is Iron Man, Dr. Strange and Captain Marvel” continued Freud \n“ Is it because of how they were before they got their power and how all of their powers are tied to or affected by their emotions and impulses?” asked Lee \n“Exactly, well perceived “  replied Freud, clearly pleased.  \n“Would Black Widow and Hawkeye be in the ego group?” asked Lee \n“Yes but also Spiderman and Ant-man. These main characters, along with some supporting characters, represents to me the conscience of the group. They are based more on reality” explained Freud \n“ How are Spiderman and Ant-man reality based?” interjected Lee\n“ While their powers may not reality based their lives and desire to stay attached to the normal world is. Both Spiderman an Ant-man want to be apart of the normal world and have a  normal life. They do not try to separate themselves from like some of the other Avengers.” - answered Freud \n“I can see where you are going with that.” replied Lee with a smile on his face. Thinking that he now had a better understanding of the system that Freud was explaining and with only a couple Hero left Lee went on “ Then Captan America, Black Panther and Thor are the Super Ego “.\n“Exactly” replied Freud \n“What about the Guardians of the Galaxy, which category would they be placed in” Asked Lee\n“Given that each member of the crew are so emotional and instinctually driven they would be considered to be Id” answered Freud  \n“So is that it, is this all of your theory that over laps with my characters” - Stan wondered out loud.  \nShaking his head again at how little of his theories Stan really understood Freud replied “of course not.” He continued “ And i am not sure if you are just acting as if you are not aware of my theories or if these over laps are really just coincidence”\n“Why do you say that” asked Stan who was some what taken aback by the accusation. \nClearly upset, Freud replied “because you literal named your greatest Villain after part of my theory” \nPuzzled Stan Lee replied “ Which part”\nControlling his irritation Freud replied “ The death drive, which is referred to as Thanatos. “\nStan Lee with a little smile on his face asked “ But isn’t that Greek for death Thanatos?”\n“Yes” - replied Freud clearly somewhat surprised that Stan was aware of this \n“So how can Thanos be named after your “death drive” when your death drive is just greek for death” asked Stan with a clear smirk on his face. \nSmiling as if he was dealing with a child Freud reeled “ Because the name is not the only thing that linked Thanos to my theory of our drive to death. Thanos entire motivation throughout the movies is a testament to my theory of  the death drive or desire.”\n“ But Thanos in his mind is trying to save everyone. How is that a “death drive”?asked Stan \n“ I am realizing that you truly must not have been aware of my theories because you truly do not grasp what the death  drive represents ” replied Freud \n“ I am not sure if I am supposed to be happy or insulted by that “ stated Stan with a clear smile of his face. \nContinuing on Freud explained that the “drive to death” is about giving life through destruction like how an ever green pines  needs fire to reproduce and how this is exactly what Thanos is attempting to do. He is trying to save the world by destroying it. He also went on to explain How the avengers as a group represents Eros, the life instinct. So in the end it is the sub-conscious coming together to fight death that we all find so relatable.  After explaining all of that Freud just smiled and ask Stan “Will Thanos be defeated similarly to how Thanatos was defeated by Sisyphus ?”\nStan Lee just replied with a smile on his face “ I guess you will have to watch like everyone else to see.”\n\n"}, {"title": "Original Psychotherapy Video (self.Freud)", "likes": "2", "comments": 0, "content": "Hi all! My name is Steph, and I am a therapist in training. I made a two-minute skit about a Freudian concept from therapy as part of a video contest. Please take a moment to view and vote for my video, found in the link here https://app.reviewr.com/s1/pitch?ubid=4847696&evtid=4383691\nAnyone can vote up to one time per day. Thanks so much for any support! (also I'm sorta new to reddit. Please et me know if posts like this are obnoxious)\n\n"}, {"title": "The Pit and The Pendulum (self.Freud)", "likes": "3", "comments": 0, "content": "Hello.\nI don't know if this is the right place to post so feel free to remove. I'm currently researching Edgar Allen Poe's 'The Pit and The Pendulum'  and using direct quotes from theorists to describe my theoretical approach to the text (the reading). I've was hoping for some help finding some quotes from Freud to justify either an author or reader centred approach to the text. Any help would be appreciated.\n\n"}, {"title": "If you're here but not subscribed, it's got something to do with your penis. (self.Freud)", "likes": "12", "comments": "1", "content": "-Sigmund Freud, Why You Should Subscribe, 1922.\n\n"}, {"title": "Did Freud ever offer any solution to people stuck in one of the Psychosexual development stages? (self.Freud)", "likes": "8", "comments": "1", "content": "I know Freud is a controversial figure and some of his claims, other than that of bringing Psychoanalysis to fruition, were questionable and have today little to no scientific backing. However I do see in some way how in an naively empiric mindset might find truth in some of his theories about the five Psychosexual development stages.\nI was just wondering if he had any theories about how to treat a person stuck in the Anal stage for example.\nI write this like I know something about Psychology. I do not. Feel free to bash my use of terms. Lol. \n\n"}, {"title": "Has Freud been debunked? Have his 'eureka' moments been undermined and his true legacy is soley proving that therapy a worthy endeavour? (self.Freud)", "likes": "4", "comments": "5", "content": "Lately Ive been hearing that his work has been undermined. \n\n"}, {"title": "In search of information on the discrediting of Civilization and Its Discontents (self.Freud)", "likes": "4", "comments": 0, "content": "Hi all. I've read in certain places (such as this essay https://www.nytimes.com/2005/05/08/books/review/freud-and-his-discontents.html) that the theories Freud brought forward in CaID have been largely discredited and that the book itself has been judged to be incoherent and contradictory in places. These sources aren't scholarly, though, and tend to just make passing reference to the discreditation as if it's a given and everyone knows why. I was wondering if anyone could direct me to some actual scholarly arguments against this book (i.e. those arguments that would discredit the book) by reputed scholars.\n​\nThanks!\n\n"}, {"title": "Do you think Freud might have been inspired by Spinoza while developing his theories on emotions? (self.Freud)", "likes": "4", "comments": "1", "content": "Or did he ever read Spinoza? I don’t recall any explicit mentioning, but I feel that Freud wouldn’t be ignorant of 300 year old ideas on systematic analysis of human emotions and a “proto-psychotherapy-like” method suggestion on how to relieve the negative effects of emotions. \n\n"}, {"title": "Freud on Jung archetypes (self.Freud)", "likes": "5", "comments": "9", "content": "Did Freud ever write about Jung's theory of collective unconscious and archetypes?  I know they stopped talking....\nAnd, did Freud have anything comparable or analogous to the idea of a collective unconscious?\n\n"}, {"title": "Quote source about sex (self.Freud)", "likes": "2", "comments": "2", "content": "I'm quite sure I've read somewhere a Freud's quote (it was someone quoting him in one of my manuals, I believe) that was something along the lines of: \"when a couple have sex they're always in four; the two of them and the other two each one's thinking of\". \nCan anyone pinpoint me where this quote's from?\nedit: sorry for the misspelled title\n\n"}, {"title": "As someone just getting started, is there a preferred order for lecturing Freud's work? (self.Freud)", "likes": "3", "comments": "2", "content": ""}], [{"title": "Where can I find work of Freud on Funeral and Death? (self.Freud)", "likes": "3", "comments": "1", "content": "Hi,\nSo, recently I got interested in Freud's perspective of death and wanted to do some reading in this area. Yet, I don't want to read a whole book since psychology is not my passion. Could you please suggest where I can find some essays or book chapters of Freud dealing with death and funerals?\nAlso, can someone please summarize Freud's view of the funerals and other ceremonies we conduct?\nThanks!\n\n"}, {"title": "Relationship between the pleasure principle, and Eros and Thanatos (self.Freud)", "likes": "3", "comments": "3", "content": "So, I'm doing this paper for University and I'm now stuck in the passage(?) from pleasure and reality principles to Eros and Thanatos. I have a few questions, I hope you can help me as I am not very versed in terms of psychology (I'm studying to become a sociologist).\na) Is it true that the pleasure principle is an instinct and Eros and Thanatos are drives? What differences the two and where could I find (in the works of Freud) the definition of instinct?\nb) Where does the pleasure principle stand in between the new two drives? Is it overriden by them (dissapears?), merges with Eros or does it stay \"alive\" as a separate entity? For what I can understand, only Thanatos appears to oppose the pleasure principle, but I could not find anything besides that, I don't know how to conclude my exposition here and Freud's Beyond the Pleasure Principle is not clear to me in this regard either. I have the idea that it merges with Eros, but I have serious doubts.\nThis is all for now, folks! Thanks for helping me.\n\n"}, {"title": "Freud has analyzed the Lubavitcher Rebbe (self.Freud)", "likes": "3", "comments": "2", "content": "It was in the 90s. I found it on google writing in \"Freud and Rebbe.\" And learned about Kabbalah. And the inner Layers of Self and Generations and Body Part meditations in it.\nIt is in the diary of Rebbe Yoseph Yitzhaq on his father Shalom Dovber.\nAnyway I have a blog where I do use this info.\nTopic is inherited ancestral stress healed by EMDR. It is on a dotcom blog container. My pen name there is /giurokozmos but I may send a link ( hope i get not banned for this)\n\n"}, {"title": "Publication history of 'The Uncanny' (self.Freud)", "likes": "2", "comments": "2", "content": "I'm working on an assignment on Freud's essay on the uncanny, and I'm looking for - and struggling to find - a detailed record of its publication and translation history. I was wondering if any of you have any idea of where I could find something along those lines?\n\n"}, {"title": "The Assault on Truth: opinions and thoughts on Moussaief's book (self.Freud)", "likes": "2", "comments": 0, "content": "I literally know nobody who have read this book, not even from my university, so I'm looking here for someone to share comments and opinions with about it. \nIn this book, Moussaief basically explains how Freud abandoned the \"seduction theory\", as in how he abandoned his initial thought and theory that the main cause of neurosis was a sexual abuse during infancy.\nFreud's patients kept telling him of sexual abuses they were victim of  , plus he had the opportunity to read several documents and witness several autopsies of his time that appeared to show how sexual abuse used to happen quite often in the families of his society.\nBut later on, at one point, Freud stopped believing his patients and theorized how they were actually speaking about fantasies and not real facts. From then, the Oedipus complex emerged. \nThis book basically tries to explain how and why this happened. \nAnyone who have read this, what's your opinion about this? Do you believe it?\n\n"}, {"title": "Oedipus Complex - Threat of castration reasons (self.Freud)", "likes": "3", "comments": "6", "content": "I am reading about the dissolution of the Oedipus Complex and Freud seems to be saying that the threat of castration for the boy comes from his parents chastising him for masturbation. \nBut I was led to believe that during the Oedipus Complex, the threat of castration comes from his father as revenge for the child fancying the mother.\nCan anyone shed any light on this?\n\n"}, {"title": "Looking for sources on Freuds theories on collecting (self.Freud)", "likes": "2", "comments": "1", "content": "So I'm doing a project for my school regarding collections and consumerism. I've seen several texts saying that Freud's theory on the phenomenon \"collectors\" was about toilet training and losing a part of yourself but I can't find a reliable source for this statement. Does anyone know if this is true and where I can find it? It would be highly appreciated!\n\n"}, {"title": "How to conserv phychic energy? (self.Freud)", "likes": "6", "comments": 0, "content": "I have read only two of Freud's books. I am particularly interested in the way he talks of phychic energy... how we lose it or \"grow\" it? thank you so much!\n\n"}], [{"title": "An interpretation of dreams (self.Freud)", "likes": "4", "comments": "6", "content": "Is there any place online people know of where others interpret dreams? I'm currently reading Freuds work and would like to see how people have used his rules to try solve problems and maybe even use them to try solve my own or other peoples.\n\n"}, {"title": "The Sexual Lives of Humans beings (self.Freud)", "likes": "3", "comments": "1", "content": "Hello fellow redditors, currently I am midway through an assignment for university which requires me to read Freuds essay \"the sexual lives of human beings\" and write a 500 word summary of the contents. Would love to hear the opinions of people who are well read on Freud and have previously read this essay in order to help me gain a better understanding of the essay and perhaps to highlight some information from the essay which may have slipped under the radar! All help is good help :)\n\n"}, {"title": "Essay on Freud's Psychoanalysis Theory or his Child Development Theory? (self.Freud)", "likes": "2", "comments": "1", "content": "Hello fellow redditors, I have to write an essay for a school assignment and I chose to write about Freud and answer the question of whether his theories/ideas are still relevant today but upon reading about his work in depth I realized that there was a lot to go on about and this essay has a max of 15-20 pages. So I decided to just concentrate on one category of his ideas, on one theory of his but I'm not sure which would be better to write about and easier to find information on.\nIt would also help to know which theory has been more easily debunked by current psychology studies by credible sources. A lot of information I found online are links to forums or incompleted/badly written essays by anonymous authors. I would like to write about a theory that actual scientists, scholars or psychologists have talked/written about and following this line of thought I've found more information on the two theories in the title. What are your opinions? Which is easier/better/provides more solid info to write about?\nThanks for your time and answer!\n\n"}, {"title": "Freundschaft (self.Freud)", "likes": "2", "comments": "1", "content": "Was meint ihr sollte ich mich noch mit jemanden abgeben der hin und wieder ein guter freund ist aber wenn andere dabei sind sich immer auf dessen seit schlägt manchmal versucht mich runter zu machen wir kennen uns jetzt schon fast 4 jahren und waren die besten freund waren quasi das dou welches jeder kannte und waren einfach die dicksten kumpel aber mittlerweile verändert er sich irgent wie hält imer zu anderen unterstützt mich nicht mehr wirklich aber auch nur wenn ein 3. oder 4. dazu kommt will nix mehr unternehmen usw.... \nWas ist eure meinung lohnt es sich daran festzuhalten?\nLiebe Grüße Dam_Daniell\n\n"}, {"title": "Along with Freud's sex stage theory: The color blue is scientifically said to simulate arousal and improve orgasm, so maybe that's why it is the most common favorite color. (self.Freud)", "likes": "5", "comments": 0, "content": "What are your thoughts on this?\n\n"}, {"title": "The Oedipus complex explained (self.Freud)", "likes": "4", "comments": "2", "content": "The Oedipus complex was named after the Greek legend of King Oedipus, in which the greek hero killed his father and took his mother as his wife. To understand the Oedipus complex, we must begin by briefly examining Freud’s psychosexual stages. Freud believed that children go through five stages during their sexual development. In the oral stage, the child primarily receives sensations by mouth such as sucking and swallowing. In the anal stage, toilet training is the main fixation.The third stage is the phallic stage. Boys begin to manipulate  their penises for pleasure during the phallic stage, while girls develop penis envy as they discover boys have penises. It is during this stage that children experience the Oedipus complex.\nBoth boys and girls experience the Oedipus complex in the phallic stage differently.The Oedipus complex for a boy is characterized by the boy developing feelings of love and sexual fantasies towards his mother. This is combined with a feeling of envy and rivalry towards his father, whom the child wants to get rid of. For a girl, the Oedipus complex is characterized by anger and resentment directed towards her mother because she didn’t give her a penis. In response, the girl will develop strong feelings of love for her father, and a desire for his penis. Additionally, the girl will become envious of her mother’s relationship with her father, and will view her mother as a rival. \nThe ending of the Oedipus complex for boys is due to the castration complex. When a boy learns that females lack a penis, he develops an intense fear of castration from his father figure as punishment for desiring his mother. Punishment for exploring his genitals from either the child’s mother or father can also contribute to the castration complex. Freud describes this as the greatest trauma boys experience during their early lives. In response to the castration complex, the boy will repress the feelings of desire towards his mother. It can thus be said that the threat of castration is what ends Oedipus complex for boys, but that it is the lack of a penis that starts the Oedipus complex for girls. \nThe Oedipus complex has developmental consequences that are different for both boys and girls. Following the Oedipus complex, both boys and girls repress the experience into the unconscious and enter into a period of latency until puberty. When the Oedipus complex ends for a boy, the boy will replace his object-cathexis of his mom with an intensification of identification with his father or mother. Intensification of identification with the father is most common for boys, and fixes the boy’s masculine character. When the Oedipus complex ends for a girl, she typically has an intensification of her identification with her mom, fixing her feminine character. It is also possible for a girl to experience an identification with her father, but not as common (perhaps Freud would have used this to explain transgender individuals... just a thought). Freud believed that the general outcome of the Oedipus complex was the union of identifications with the mother and father to form the super-ego.\nSources:\nAn Outline of Psycho-Analysis by Freud, and also The Ego and the Id by Freud. \nPlease note that this is only my interpretation of the Oedipus complex based on my studies of Freud! If anyone disagrees with my interpretation, or notices anything I've explained incorrectly, PLEASE point it! In my opinion, Freud was really onto something with his work on the Oedipus complex, although many today discredit the complex entirely (and laugh at the idea of penis envy). However, I consider the concept of the Oedipus complex to be brilliant, especially when one takes into account that Freud didn't have the knowledge from developmental psychology and neuroscience that we have today. I still find the concept of the Oedipus complex very useful for understanding human behavior, even though many don't take it seriously. Thoughts? \n\n"}, {"title": "The Id Surfacing (self.Freud)", "likes": "2", "comments": "3", "content": "What happens when things from our Id surface to ego level of awareness and we overcome anxiety caused by the Superego?  Is there a term for this?  Maybe like 'integration' or ?\n\n"}, {"title": "Could anybody explain to me the lasting impact of Civilisation and its Discontents? It's for a history presentation! (self.Freud)", "likes": "2", "comments": 0, "content": ""}, {"title": "How much of his theories have been debunked (self.Freud)", "likes": "6", "comments": "9", "content": "I admired Freud but i'm aware that not all his theory still have validity\n\n"}], [{"title": "Symbolisation in the Netflix show, \"Freud\" (self.Freud)", "likes": "2", "comments": 0, "content": "Just wrapped up the Netflix show, \"Freud\", and historical accuracy aside, I feel like there is some heavy symbolisation in the show. For starters, the bust of Freud in the intro sequence changes to reflect the episode name. I am just wondering if anyone noticed or read anything interesting or managed to peel back layers.\nFor e.g.-\n\nInspector Kiss (imo) reflected superego. His profession of punishing people who break societal rules also seems symbolic.\nMucha, the opera singer, reflected oral fixations. The fact that he was a singer and he also bit people when he was hypnotized was an interesting pattern.\n\n\n"}], []]}