{"data": [[{"title": "IF YOU ARE ON MOBILE, PLEASE READ THE SIDEBAR. Here's a copy of it.  (self.intj)", "likes": "85", "comments": "18", "content": "\n\nSidebar\nRules\nFAQ\nWiki\n\n\n\nINTJ rules as a snapshot.\n\n"}, {"title": "Does anyone else keep themselves busy in order to suppress their emotions?  (self.intj)", "likes": "104", "comments": "19", "content": "I recently found out that whenever things don't work out my way or someone I trust hurt me, I always bury myself in my books. I hide all the clocks of my room and work for hours without any human interaction. I've been doing this for years. I mean forget about understanding other people's emotions I don't even understand mine. My brain always goes into the run-away-from-your-emotions mode. I just do anything to suppress them, to forget whatever I was feeling. It's weird. But aren't we all?\n\n"}, {"title": "Are any of you guys an INTJ twin? If yes, what is your twin's type?  (self.intj)", "likes": "108", "comments": "61", "content": "Hey! I am an INTJ with a twin who is an ENFP. Our relationship is occasionally a push pull (bc I am very independent and she is very in need of attention and love) but we have grown so much individually because of our differences.\nShe taught me to empathize, listen, support people in the way they need to be supported, check in with friends far away, and generally to be a better person to myself and others. I taught her to stand up for herself, to trust her own intelligence, and to occasionally try to block out the social cues she is getting espec when they are negative vibes (it affects her wayyyy more than most people).\nShe takes things personally, but I think it's bc her \"sixth sense\" for people's thoughts/feelings and her emotional intelligence can make her self-conscious or feel defensive/embarrassed. I am totally oblivious to stuff like that and it weirdly makes me more confident (although I am the introvert and she the extrovert). I want her to get to that point too! I think I used to have a tendency to let my arrogance affect the way we talked to each other & the merit I would put into things she would tell me. Obviously now that I am older I regret that. She is the absolute best person - so thoughtful, endlessly caring, and FULL of love for her people.\nShe is a total empath and I am a bit of a depressive personality, so I want to make sure I am uplifting her, not bringing her down, and that she has others to connect the way she needs to. :) Any tips on helping to support her are appreciated. \nTL;DR: I'm an INTJ w an ENFP twin, she is the reason I am at all emotionally competent. \nSo twins - what are your types and how do you think that they affect your relationship?\n[edit:] if you want to answer this also, are you identical or fraternal?\n\n"}, {"title": "The perks of being an INTJ  (self.intj)", "likes": "54", "comments": "31", "content": "1. THE GOOD ONES\n\nYou don’t keep a lot of expectations from other people.\nYou don’t feel disappointed when people don’t keep up their promises(maybe a little but you move on quickly).\nPeople can’t hurt you emotionally(biggest advantage I guess).\nYou learn a lot by yourself.\nYou actually enjoy solitude.\nYou can solve complex problems because you actually use your brain logically rather than emotionally.\n\n​\n2. THE BAD ONES\n\nYou don’t have a lot of friends for support(because you are your own pillar of strength). But it feels good to have friends around sometimes.\nYou feel rather awkward in social situations like parties and get togethers and act like an object out of place because you haven’t had a lot of social interactions lately(just because you don’t like it).\nPeople think you might be a wierdo because you don’t express a lot of facial emotions in situations which demand it(like when you are the topper of your class and people come to congratulate you and you don’t put on a smile and just shake their hands and say ‘thank you’ and people go around telling others that you’re egoistic).\n\n\n"}, {"title": "Is this the right sub for me? (self.intj)", "likes": "14", "comments": "12", "content": "I took three MBTI tests and got INTJ on all of them. My profile really resonated with me and it was a revelation - like I wasn't special or unique and it somehow validated my attitude to life.\nBut I don't really feel like I fit in on this sub. Maybe the posts on here represent the extremes of the type or something?\nI am not extremely introverted, extremely intuitive or extremely judging. I came out high on thinking but I can be very emotional at times too.\nIn my 20s I was probably a bit more arrogant and I would have been more extreme in my scores which I suppose represents type development. Might that be an explanation based on the demographics of the sub? \nWhat do y'all think?\n\n"}, {"title": "Anyone else sometimes think they might have Aspergers  (self.intj)", "likes": "234", "comments": "109", "content": "I’m female and don’t know any other intjs. I have certain traits I get very focused on work want to get best grades typical intj stuff. Get annoyed by laziness particularly wither school however I also seem to become much more upset over people touching my stuff. Overall I adjust poorly to change, living in small houses on vacation with my family i often end up being a pain because of the change and reduced personal space as well as being competitive (become better though) and over analyzing (comment how to improve things). Only in such an environment do I become angry and emotional although I often don’t know the direct cause. \nI don’t enjoy gossip or talking about emotions and people often think I get upset in discussion even though I really enjoy it and am just passionate and curious about people opinions about ideas and agreeing on it. \nI don’t like being touched hugs are awkward. \nBut I do really like helping people. Although I sometimes have trouble understanding others.\nOveral:\nOverall these percs made me think I have asperges then I discovered 16 personalities and am InTJ. Wondering if anyone had similar experience/thoughts.\nedit\nMy apologies I was very general just describing typical InTJ traits that I recognize myself with. \nSpecifically I try to avoid interaction with people I don’t know. It makes me very anxious and feels forceful every time. I need to remind myself to make eye contact. I avoid people in groceries shops etc. I don’t know how to start a conversation with people my age that I don’t know and am then very quiet. With adults or situations where I’m forced to I eventually switch to polite say the right things and trying to remember to look people in eyes. I have done a lot of acting classes which have helped.\nContrastingly around my friends I function well and actually am quiet funny which doesn’t seem to align with autism spectrum. I still have sensory issues and struggle when others eat specific food items (causes unusual discomfort) or if they’re a lot of people whom I can’t ignore. I lack interest in conversation but just zone out and try to stay polite.\nSorry if I came over wrong I wasn’t specific enough\n\n"}, {"title": "Have intjs internally and involuntarily sacrificed their presence of mind for focused thinking (self.intj)", "likes": "6", "comments": "2", "content": "The title is quite self explanatory imo. I have never been one to doubt my intelligence, However the past few years being in one of the best engineering universities of my country I can't help but feel incomplete and imperfect. Unsurprisingly a large strata of our University students are N types especially NT types and having gotten the opportunity to see them live in action in projects has gotten me insecure. Although hard for me to come to terms with I have observed that I have the least talent in quick/ presence of mind thinking style. I have found these people to be brimming with new (albeit sometimes uncooked and infeasible) ideas. I have also found that I am the least creative types out of the NTs.. and I hate it. If any one could shed some light on my situation or share their experience about this. I would be greatful.\nP.s Just a heads up that I am always the main guy for planning and indepth research work in our projects and hence understand that I am uniquely gifted. But just that I find areas where I am lacking a lot\n\n"}, {"title": "Using music to process anger. Relatable? (self.intj)", "likes": "104", "comments": "26", "content": "I have always questioned why my music taste veers towards the rock and alternative worlds- particularly the heavy, the angsty, and the subversive. I connected this idea with my tendency to repress my own emotions of anger (especially in relation to trauma) and noticed that it seems like music is one of the few places in my life I allow anger to live. How do you feel about your connection to music and emotion?\n\n"}, {"title": "Is there something wrong with me? (self.intj)", "likes": "5", "comments": "3", "content": "​\nBefore I start, I want to apologize for grammar, English is not my first nor second language.\nIm an INTJ female, 15 and i really won a bingo. My both parents are SJ´s and sister has an ENFP personality, which is something i think no NT deserves.\nMy father keeps controling me, and doesnt accept my point of view. When Im not good enough for his standarts, he takes it as his personal failure and i have to be punished.\nMy mother is the most touchy-feely person I ever known. She wants to hug and kiss and want to know what happended to me. Why am i quiet. If am i angry at her. When I am not , why I am frowning when I walk by street.\nMy sister is the sun. Always shining, smiling happy 14, who doesnt care about anything. She keeps talking and talking and going out with friends and i really love her.\nAt least I hope I do.\nBecause we really struggles about everything, literally every day. They dont understant that i like to be in my room, alone and reading books. That I love my piano more than doing small-talk with them. That i hate that stupid romcoms theyre watching in evenings and that i sucks in social interaction. And that i really dont need more friends.\nWe have an arguments, on daily basis, and I am so exhausted.\nMy mom always cries, she is telling me I am not normal, that she dont deserve me and that nobody was ever that evil at her than i am. That nobody has ever hurt her like i do.\nShe is telling me I am autistic, because i dont like hugging her.\nOnce i almost started to hyperventilating and she called me a freak.\nAnd its repeating again and again.\nJust because i didnt cry at grandmother´s funeral. Just because I act like nothing happened after our disagreement.\nJust because when she asks if i know that they love me and then asks if i love her back, i can not say yes.\nJust because when mother of her friend died, i ask what she died of and said that that’s what people do sometimes. Die I mean. I suposse i should be sorry for her or something?\nAnd thats why im so scared. I know i have feelings, because every their word hurts me and sometimes i cry in good book when nobody is around me and theres places in the world i like but when i see her crying, i dont feel anything. Im not sad, angry, happy just tired.\nAnd when i see a baby in the street, which fell on the ground and cry, im just annoyed.\nIm scared, because i dont want to die alone, because it feels like some people are not meant to be loved, when thay cant love you back.\nBut it feels like theres nothing i can do with that either.\nI think theres something wrong with me and the worst is that i dont mind.\nThree days ago, we had a scary episode in which end my father told me he will contact a psychologist.\nAnd i realized, that theres nothing i can lost.\nBut when i talked to my mother yesterday morning she told me that if somebody of our family would needed a psychologist, they would contact him before.\nBut i actually realy liked that idea of talking to someone, even if i am not good at it and even writing this feel little wierd.\nBut i just want to be happy in my own way and live my own dreams and i know, that until i will live like this with my parents, i will just feel like i am broken.\nAnd thats all my fault.\nJust somebody tell me, what to do. Please. Should I contact a psychologist on my own?\n\n"}, {"title": "ENTP needs help with an INTJ  (self.intj)", "likes": "11", "comments": "22", "content": "Hello guys, sry for coming into your world but I need some of your precious knowledge ^ , I'll try to not write an essay. Ok so I met an INTJ and we've been speaking for 2 months now but I think like she loses interest for me and I don't know why. When we started talking she was really interested and always down to share memes and music with me and we also made a lot of plans she was really funny and was really motivated to see me but because of the quarantine we couldn't see each other's but we used to text like everyday.\nThen she suddenly just change, she became more distant her text was shorter and the texting frequency wasn't the same than before. \nI asked her to be honest and tell me if this is a problem with me and if she still wanna meet me after the quarantine, she told me that I'm not the problem but she's no longer ready to have new people in her life for now and quarantine is messing with her mind.\nI really don't know what I should do because at first we really had a super connection and I'm still interested, do you have any advices to conquer her frozen heart?\nOh crap I did write an essay but you guys enjoy reading haha.\n\n"}, {"title": "INTJ in love? Truth? (self.intj)", "likes": "3", "comments": "10", "content": "How do I know you guys actually like me? Yes this INTJ has said so, but how do I know it’s not because I may be that rare person who has shown interest? How do I know it’s actually me you like rather than an idea of some rare love interest? - from an ISTP female\n\n"}, {"title": "Here’s a fun subreddit to be in. r/FollowThePunchline (self.intj)", "likes": 0, "comments": 0, "content": "r/FollowThePunchline Basically OP needs to make an incomplete unfunny joke and others are tasked with making it funny.\n\n"}, {"title": "How to stop jumping to bad conclusions?  (self.intj)", "likes": "11", "comments": "13", "content": "Hey guys,\nToday I took a chance by acting as if I knew something I was actually hesitant about. When questioned about my thinking, I realized it was all insanely illogical, but it was too late. I had decided to connect the dots with very little information and had jumped to a theory that was hurtful for the other person. He debunked my pity-full argument in a matter of seconds. It really took a blow on my thought process, and I’m now questioning at what point it’s flawed. I’ve rarely had anyone to try and prove me wrong fact by fact before. I still always try to not mention things I’m not certain, or at least follow them with a disclaimer. But this time it really hit me hard. I’ve been lucky to get away with a lot and not have to prove my reasoning sometimes. Do you have any tips on how to stop jumping to conclusions or judging others when very little information is known?\n\n"}, {"title": "Is constant career change a known INTJ trait? (self.intj)", "likes": "19", "comments": "50", "content": "Hi, I'll preface this by saying that it's late and I've had a few glasses of wine - so please excuse the typos and poor grammar.\nI'm an INTJ-T male in my late 30s and I'm on my 4th career now, and I was wondering if constant career change is a common theme amongst INTJs?\nSome history on me...\n\n5 years - Left school at 16 and went straight into an engineering apprenticeship (instrumentation, process logic controllers etc) - I had to seek paid work due my dad being forced into redundancy, but I wanted to maintain some form of education. \n4 years - Self taught traditional sign writing and manufacturing (after dabbling with CAD design during my engineering apprenticeship and converting a broken X-Y plotter into a drag knife/vinyl sign cutter and building a small business from it) \n10 years - I had a very successful stint as a graphic designer from the design skills I acquired whilst working as a sign maker (I worked at senior level, covering print/repro, video, conceptual, branding, digital, animation etc etc - a few in house agency roles and freelancing around London supporting marketing departments for some big companies)\nRoughly 5 years ago through to today - my role evolved into digital bias, I self taught digital marketing and web design (I've taken more online courses than I can list here), I now work as Head of eCommerce and I support  4 other clients around my day job as a Digital Consultant (building eCommerce websites - I mainly specialise in full spectrum digital audits and generating growth strategy covering all aspects of growing business online - Lead generation, Content gap analysis, technical SEO, CRO, user experience, Social, PPC, Email etc etc - my design experience always helps here).\n\nI know I sound like a Jack of All Trades, but as I'm INTJ I literally spend all of my time researching and trying improve on what I did before - so I feel I have a better grasp of the industry I am in than most give me credit for. Plus my track record is pretty crazy, for example my main day job has experienced 66% YoY growth from a previous 8% trajectory for their eCommerce sales (not to mentioned 680% increase in direct leads) - pretty much the same story with my freelance clients too, all from a wide range of industries - eg,my regular clients include an aircraft parts manufacturer, antique dealer, corporate HR firm and a coffee house.\nIt's like I'm stuck in a continuous self-improvement loop (which I think is the turbulent nature of my personality - always self analyzing) and if a career doesn't fulfill my need to learn and develop both my creativity and my logical/strategic side, I move on. Also, I've had employers take liberties on my work ethic in the past, and just pile on more and more responsibilities and constantly move KPI goal posts with no additional support or remuneration (which is actually the situation I am in currently). \nBeing INTJ, my career has always been hampered by my social inadequacies - I don't do traditions,  I'm shit at thinking on the fly and I can come across a bit flat, I also have a nasty habit of under selling myself (ie when talking about my work I will hyper focus on what I could have done better rather than focusing on what I've achieved - I am working on this though). During meetings I appear as disengaged - which is never the case, as I like to think before I speak.\nIt frustrates me that my apparent lack of enthusiasm is in complete contrast with how fascinated I am by the industry I am in, and I spend every spare moment outside of work and family time researching - my idea of a good evening is watching a 3 hour long tutorial on building out a marketing funnel and then being so enthused that I end up spending a further 3 hours building it myself (queue going to bed at 3am, waking up for work at 7am - this happens at least once a week).\nAnyway, I'm rambling now - I just wanted to see if there are any others out there as weird as me, and with a similar back story?\n\n"}, {"title": "I'm not sure if it happens to other introverts but you ever just feel like you're happy and then someone sees it as an invitation to interupt your alone time to maybe spice things up even more and you end up feeling extra uncomfortable? (self.intj)", "likes": "49", "comments": "18", "content": "Usually for me it's being given attention to when I don't need it that alters me.\n\n"}, {"title": "   (self.intj)", "likes": "2", "comments": "11", "content": "Hey. I have a thing with a Intj (f20)\nWe were dating and then due to corona and our issues, we said let's keep this thing on hold for now, we'll talk it out once the quarantine ends. We both agreed.\nWe don't talk now.\nShe comes online though doesn't text and it hurts.\nI know we agreed to talk about it after the lockdown... it's just taking forever to end this lockdown.\nI'm afraid that by the time this ends, she'll not have feelings for me.\nIf you want the details then it goes like this :\nShe said she don't feel like my gf anymore.\nTho she'll help me move on and then she'll move on.\nAll of this obviously went for a month, and I didn't know what exactly she wanted,what I wanted.\nIt was harming both of us to talk about who we are, everything except that was fun.\nSo I sent a voice message cause she'll know that I'm not begging or something.\nThere I said let's go to college and let things happen how they are supposed to happen.\nHer reply to that text was : i completely agree, let's keep this on hold.\nThen after few days,\nI texted her, she replied.\nThen I saw a post on Instagram,that said ,\" are they texting you or responding to your texts?\"\nI over thought over it and then \nI replied her with ya.\nShe's seen it and now not texting.\n\n"}, {"title": "I absolutely despise group projects (self.intj)", "likes": "5", "comments": "4", "content": "And not in a clichèd “ew people I’m an iNtRoVeRt” (can you tell I hate this stereotype?) way. \nI hate working in groups because anyone who takes charge that isn’t me has the risk of being incompetent (and often is, at least in some regard). Not that I’m perfect, but I at least like to have some say in decisions that are made. I’m very take-charge and assertive (I come across as ENTJ to some) and do not like to be led, especially when I feel that the person leading is not doing things the best way possible.\nProbably just needed to vent but someone in a group I’m in right now arbitrarily took out paragraph on a very specific and technical science procedure that I stayed up until 7am writing. Their reason? The paper was “too long”. Naturally, they kept their poorly-worded paragraph. And don’t get me started on the amount of spelling and grammar issues I had to correct on this paper before. Oh yeah, and they didn’t know how to cite sources properly.\nWe’re going into our senior year of university...\n\n"}, {"title": "Ever had the one that got away?  (self.intj)", "likes": "22", "comments": "10", "content": "Have you ever had that special person that isnt in your life anymore. What made them special and what is it that you are missing in your relationship right now in comparison to the partner that got away?\n\n"}, {"title": "Intj here, how do you guys cope with super annoying people?  (self.intj)", "likes": "4", "comments": "7", "content": "My family is driving me crazy, need ways to cope. Plz respond\n\n"}, {"title": "What to do now?  (self.intj)", "likes": "2", "comments": "2", "content": "You guys know that in the current state of the world it is inadvisable to do many things that were once the norm. Well since the quarantine started in my region I had been extremely busy working on finishing my masters degree, but now I'm done. And I'm bored out of my mind. A lot of us can identify with being pretty high-functioning overall. I was wondering what some of the things you have been doing to keep busy and/or improve yourself in some way. Any suggestions are appreciated, thank you!\n\n"}, {"title": "To what extent are INTJs created due to culture?  (self.intj)", "likes": "9", "comments": "10", "content": "I'm asking if the characteristics associated with the INTJ personality are present when one enters the world just based on how one's brain is wired or if they develop over time due to circumstances. Maybe there isn't an answer to this but I'd still appreciate some perspectives :)\nPersonally, I feel like if I grew up in a family that only emphasized cheerleading and popularity for example, I'd be a completely different person with different approaches to problem solving, emotions, alone time, socializing, etc. But at the same time, the core of my identity is my logical and analytical approach to life so I wonder if this would prevail over my hypothetical family's values. \nThis can really go for any personality type but I'm INTJ so I'm posting here (also the answer could potentially differ between personalities).\n\n"}, {"title": "Does any of you guys get frustrated when you see someone who is better than you?  (self.intj)", "likes": "283", "comments": "101", "content": "I realize that this question may sound a bit arrogant or whatever, but it is something that I struggle with.  Whenever I see someone who is better than me at something I do or has recieved more honors, I just get internally frustrated.  I've been trying to stop this reaction but it has proved very difficult.\n\n"}, {"title": "Focusing Ambition as INTJ  (self.intj)", "likes": "17", "comments": "17", "content": "First time posting here, but thought some advice from like minded people may help me get out of a rut I’m currently in. \nI’ve always been extremely ambitious and driven towards building / being something great. I always had a project or a huge goal I was working towards and I very much defined myself by whatever that project was. \nAs I’m getting older, none of the projects pan out to anything I consider worthwhile. It’s just not good enough and I’m starting to lose faith in my plans. \nI’m finding I’m having a harder time getting invested in things. I’m really struggling to focus in on one area as well. I have a million ideas and a million hobbies, but I can’t commit to anything enough to build real expertise. \nI feel like I’m spinning my wheels trying to feed my ambition but not having anything to work towards due to my crippling lack of focus. \nDoes anyone else struggle like this? Have you found a way to either kill the ambition or push through the pain and keep moving towards something?\n\n"}, {"title": "A common INTJ fear  (self.intj)", "likes": "5", "comments": "2", "content": "one of my most reoccurring dream or it would be rather adequate to say nightmare, is that i am either taking or shouting and no one can hear me or that everyone is ignoring me, in my waking life i tend to have a prediction of how things would go wrong and i try to bring it to everyone's attention but most of the time i end up being ignored, now at this point i got used to it and not to deny the fact that it bothers me but i just got used to it, but after all it tends to scare me from time to time, how do you deal with that type of fear?\n\n"}, {"title": "INTJs and connecting with people  (self.intj)", "likes": "5", "comments": "7", "content": "I'm not sure if anybody can relate, but I rarely feel connected to people. \nMost of the people I meet I just don't feel any connection with. \nFor example when I was starting out in high school I was told I can make friends by joining clubs that align with my interests, so I did. I joined the Pokemon club as a freshman but didn't make any friends in my time there, despite being super into competitive battles at the time (and winning the tournament we held that year). Unless it was Pokemon being discussed, I just wasn't interested in talking to any of the other kids. If they were all bullshitting I just pulled out my 3DS and tuned it all out because it didn't interest me, which in retrospect I realise probably came off as rude. \nBut all my life really I've rarely felt a connection to other people. But when I do feel connected to another person on that rare occasion, I know it right away and I just become super happy and fiercely loyal to my person. And when I meet my person I don't have very much interest in meeting any more friends. Right now I have this connection with my boyfriend, and like I said I knew right away way before we started dating we had something. Maybe it's an Ni thing, I have no idea. My boyfriend is an INTP though and I know there is a synergy between those two types. \nIs anybody else like this when it comes to connecting with others where you just know if you will or will not get along with somebody upon meeting them? And most of the time you don't feel anything so you therefore just have no desire to really talk to them? But when you meet somebody you do connect with, you know it right away and eventually have this inseparable bond with them?\nThis has been me my entire life, even as a kid. I wonder if this is something common with INTJs.\n\n"}], [{"title": "INTJ or INTP ? (self.intj)", "likes": "4", "comments": "7", "content": "After doing some study about the primary cognitive functions I always relate my self to both TI and Ni\nThere is some way of discern which one i’m ?\n\n"}, {"title": "Books. (self.intj)", "likes": "5", "comments": "8", "content": "Need recommendations on books.\n\n"}, {"title": "Do you ever want to be young again?  (self.intj)", "likes": "23", "comments": "18", "content": "Nearly 30 and I'm slowly trying to fix myself. I've been depressed, toxic and friendless for a very long time, since my late teenage years. I've held on to meaningless relationships that have hurt me, was always socially anxious to get out there, did take enough care of myself.  I've had my share of trauma and abuse and for a long time, I blamed all the things that have happened to me for who I am. But slowly, I'm realizing that I'm not the only one, I'm not special. There are people who've had worse and still managed to drag themselves out of the pit. And I'm trying that too. Change won't happen overnight, but every day, I'm trying. But I can't help feeling that I've wasted my 20s and I'll never get them back.\n\n"}, {"title": "How do you use your cognitive functions at work?  (self.intj)", "likes": "4", "comments": "6", "content": "How do Ni, Te, Fi, and Se make you great at what you do?\n\n"}, {"title": "Dear INTJ’s  (self.intj)", "likes": "4", "comments": "11", "content": "What music do you enjoy listening? \nAs for me (INTJ as well), I do enjoy from classical music, indie (kinda) lo-fi beats; to rock (but not too ‘heavy’, more like imagine dragons and similars) although I don’t really explore other genres besides those. And what about you guys?\n\n"}, {"title": "INTP Here. Want To Know How To Forge Better  s With INTJs  (self.intj)", "likes": "7", "comments": "5", "content": "Ok so I'm trying not to write an essay or go on a traditional INTP tangent, but I need some advice/guidance. I  really don't know why INTJs and INTPs are so magnetically drawn to each other but the notion is no less true in my situation. I've had an INTJ friend for years now that I have lots of fun around but I still feel the friendship lacks something. While I enjoy my friends ability as an INTJ to keep up with my constant over the top analysis and theorizing, I feel as though we only really get to have a fun time when discussing or debating a range of topics that we share interests in. The thing is I know that he is going though some stuff and I really want to help out, but I'm completely clueless as an introvert as to how I'm supposed to reach out, the fact that my friend is also introverted makes me even more apprehensive on the notion of reaching out to him. I have another INTJ friend who honestly is the only reason that I'm not behind in all my classes now. It helps out so much to to study with her, and it doesn't feel like a chore because I get to have fun with her. Because I'm so unintentionally nosy, I know that she also is going through quite a rough time, and it looks as though her dad might to be still here this time next year. I don't want to force myself onto them cause I know I personally would hate that, but I just want to break the INTP stereotype for once and be someone who can offer their support.\n\n"}, {"title": "Dealing with the finity of relationships  (self.intj)", "likes": "6", "comments": "4", "content": "I noticed that I put very much weight into my personal relationships in the past \nI don't know if it's me or them but atm I don't feel like they can always be there.\nIs this the start of the decline of my social network?\n\n"}, {"title": "What should you do if someone tries to convince you that something is not true knowing that believing it is true will hurt you in the long run? Kind of like some type of conspiracy theorist that points out pseudo-logical proof that your parents don't like you to the point that the sense he makes...  (self.intj)", "likes": "5", "comments": "8", "content": "... starts feeling creepy and true.\nIt's some kind of manipulator. I've experienced alot of them in my life. They're like they make so much sense in what they're saying that you just don't know if you've been living a life of ignorant bliss.... especially me... I love searching for the truth and the last thing I want to be called is a delusional.\n\n"}, {"title": "Depression (self.intj)", "likes": "9", "comments": "12", "content": "I think the deepest level of depression is binge watching videos on existentialism.\n\n"}, {"title": "People dislike me and I'm starting to worry (self.intj)", "likes": "8", "comments": "8", "content": "About a year ago I realized no one really likes me, and not in a self-pity way, after a pretty harsh series of unfortunate events I was staring at the ceiling at night, just trying to think objectively about what had happened in my life since my late teenage years and I couldn't help but come to the conclusion that nobody has ever liked me or found me worthy enough to keep in their lives. \nI would like to believe that I just had bad friends but it is something that has happened to me since I was a kid and was always left out, in all the circles of life, including my family: nobody likes me. \nOf course I have gone to therapy and thought about it enough to identify why people dislike me or why I cannot be loved. I lost my fear of going places by myself and tried to focus on getting my things done without disturbing anyone. I'm still trying to convince myself it will be for the greater good, that somehow, this situation will get me some superior knowledge I may not access otherwise. \nBut I simply can't help but think something's missing in me. Everyday I think about some terrible things that were done to me in the last 6 years and that I certainly did not deserve. I'm not saying I am all good and nice, of course I've hurt many people as well (just like everybody does), but it just sickens me how some people I have met who are just pure evil have people who loves them while I am just discarded by everyone I meet. \nI also know nobody has the duty to love me, they'd just do (or don't in this case). That's alright, and I don't think they should or that they're bad just because they don't. But even knowing that, I am not happy, not even calmed. \nMaybe, I just think about it too much. Is this just a phase? I'm 23 and I'm very tired of it.\n\n"}, {"title": "Ya'll talk funny?  (self.intj)", "likes": "3", "comments": "6", "content": "Howdy,\nI was recently told by a guy that my speech is archaic, anachronistic, and cartoonish.\nCouldn't quite tell if I should take it as a compliment.\nSo how about it? Do any of youzguys have your vocabulary and manner of speech commented on?\n\n"}, {"title": "Typing 'Outlander' Characters?  (self.intj)", "likes": "6", "comments": "2", "content": "Anyone here watch Outlander? \nIf so, how did you type Claire and Jamie? \n(For those who don't know, Outlander is a tv series, historical drama)\n\n"}, {"title": "Struggling with empathy  (self.intj)", "likes": "3", "comments": "2", "content": "I am highly opinionated about most things but with experience I have learnt not to point things out for the greater good of the relationship. I do speak up, however, when someone tried to walk over me. But I try my best not to make it personal and try to talk as objectively as I can if they are too rude to me. Then the same people who were rude to me call me rude because I'm apparently snobbish for pointing out things like their own hypocrisy. Then I feel like though I'm an INTJ, who's supposed to have this heart of stone is much more empathetic than them.\nIf you have experienced something like this, how did you deal with it?\n\n"}, {"title": "Inside joke with me (INTP) and my sister (INTJ)  (self.intj)", "likes": "244", "comments": "94", "content": "My sister and I would have debates for fun, usually about something trivial but that we both held opposing opinions on, or pretended to. At some point during the \"debate,\" one of us would drop the phrase, \"it's not nice to be contrary,\" and the other would reply \"yes it is!\" That signaled the end of the debate as well as making us both laugh hysterically. We still drop this line from time to time even now in our mid twenties.\nAnyway I was reminiscing and thought I'd share :)\n\n"}, {"title": "Iq and depression (self.intj)", "likes": "2", "comments": "20", "content": "I recommend watching from minute 50-60 but at around minute 53 jordan Peterson suggests that religion is for those that are stupid and dumb ppl should follow a more conservative approach. What do you guys think about that? \nAnd this leads me to wonder, are ppl with low iq more likely to have mental health issues and be in need of abstract systems like religion to help keep their moods regulated while the more intelligent people don't need it as much since they are more say, mentally durable and can withstand the hardships that are caused by the complexity of life simply by virtue of a high iq. Could be why ppl with high iq live healthier happier lives. Ik this is a dangerous thought and that ppl for some reason say smart ppl are more likely to have mental health issues and i don't think that might be the case. \nCan we try and view this other perspective? \nhttps://youtu.be/PqpYxD71hJU\n\n"}, {"title": "How the heck do I make friends?  (self.intj)", "likes": "16", "comments": "12", "content": "When I was younger (around middle school), I used to be the most popular kid in my class. People would always ask me to come over to their houses and play video games, I had everyone's phone numbers and tons of friends. And then my parents pulled me out of school after 8th grade and made me get home schooled for the first 2 years of high school. I guess I never recovered from that. Ever since then, I have trouble making friends.\nI'm an introvert (INTJ-T), and I dislike going out often but when I do go out I would consider myself very social. Always talking and joking and making people laugh. But, nobody truly becomes my friend. I'll spend the whole night hanging with some people, talking and joking, and at the end they'll say bye and I won't see them ever again. The one friend I DO have (lets call him Bob), he gets invited to everything. Every party and event.\nI remember in particular, me and Bob got close to this group of friends from our classes. We'd eat lunch on campus together and always joke around. They'd laugh at my jokes and I don't think I was confrontational or annoying. At the end of the semester they threw a party, and invited Bob but not me. None of them ever asked for my phone number, I had to go out of my way to ask them all for theirs.\nAnd it's been like that ever since high school. I'm a 22 year old college senior now and still can't make any friends. I still hang out with the few friends I have left from middle school (including Bob), but have never been able to make and maintain new friends ever since, and I don't understand why. Am I bad person? Am I just unpleasant to be around? I don't get it man. Any advice would be worthwhile.\n\n"}, {"title": "I hate Facebook. (self.intj)", "likes": "153", "comments": "69", "content": "25M INTJ here\nFacebook gives me a lot of anxiety.  When I log in it feels like walking into a crowded room.  I hate the idea that people I know will see what pages, groups, etc I interact with.  Deleting people and adding people can be so political.  \nI've decided to step away from FB and just enjoy Instagram and Tumblr, where I don't follow any people from real life and no one knows I have the account.\nI am just really tired of feeling connected.\n\n"}, {"title": "Please kick the tires of my argument (self.intj)", "likes": "4", "comments": "22", "content": "I've just got into a bit of a kerfuffle here. As people who like to pick apart arguments, do you think I'm on the right side of this? \nThis guy picks out one political party as being the bad guys and then attacks someone when they say that the other one would have done the same thing.\nThe basis of the attack is that the other party (Labour) are not in power, therefore it is impossible to know what they would do and therefore should not be tarred with the same brush.\nMy argument is that his attack on the other commenter is hypocritical because for his argument to be a criticism of the first party (Tories), there is the underlying assumption that there was a better choice and one that the other party would have made. Therefore he was making claims about what the other party would have done if they were in power.\nI'm 80% sure I'm on firm ground here, what do you think? (Purely about the argumentation, not about the situation or politics please)\nedit: Also, please refrain from commenting about this on the original sub, I don't want to get accused of brigading. I'd like to keep this academic.\nedit2: My better angels say to let it go now, but part of me wants to respond with a TMNT analogy. Which way should I go?\n\n"}, {"title": "My special skill...  (self.intj)", "likes": "37", "comments": "12", "content": "I asked all my four friends what they thought my distinguishing skill was. I did this because I don't consider myself skilled in anything, I'm more like a jack of all trades. I can play a little guitar and sing decently, I have a knack for public speaking, really good at pattern stuff, fairly athletic, but in none of those areas am I the best in the group of friends. So when I asked them, they said that the area I was most skilled in was \"people.\" Apparently I can start and steer conversation well, I listen and respond well, and I'm friendly. \nI share this because I've never noticed this. I mean, I've known I've never been an a-hole like the INTJ stereotype is, but I didnt expect them to say that I was the opposite of an a-hole. Was wondering if any of my common folk can relate to being good with people?\n\n"}, {"title": "Hey im new (self.intj)", "likes": "6", "comments": "6", "content": "Hello people of reddit, I’m an intj-a. How are the fellows intj people doing in the quarantine? Also how the heck do you guys deal with having to deal with family? Pls respond and updoot(think that’s what u do)!\n\n"}, {"title": "Growing up, school’s emphasis and time alotment towards making friends and being social really screwed me up for a while  (self.intj)", "likes": "12", "comments": "6", "content": "Don’t get me wrong being social and learning the game is important, although I felt so weird for not fitting in and I forced myself to be social and have a lot of friends I didn’t really like just to avoid being seen as alone and weird for a long time. \nI got on the topic of thinking about this because I was looking through a box of old memories from fifth grade and I had this activity book to do with your friends but I had very little friends to even put in this book. When I was younger I tried to find friends to do activities for this book with me so I didn’t feel so alone, but really I didn’t have very many friends and it made me feel like shit. \nI thought it was a requirement to be social.\nI thought I was weird when I spend a long time alone, drawing and organizing things by myself. \nI didn’t fit in at all.\nHaving school dedicate so much time to being social with friends and putting us outside for recess twice sometimes three times a day taught me a lot; I was different from the rest. I knew it but I didn’t really know it was okay to be more to yourself and not have a ton of friends until college. \nThe whole culture surrounding public school made me feel like I needed to conform and have a lot of friends and do things with friends. Although with a lot of these friends I faked my personality to fit in and it got exhausting. \nI started sitting by myself in high school and people would question it but eventually I just owned it. People would ask why I didn’t have friends and I would literally say it exhausts me and I’m just introverted. \nI can socialize and be confident, but that doesn’t mean I want to spend a lot of time with you, unless I actually like you. \nToday I’m quite comfortable and happy with few a friends and time to myself. I finally feel normal.\n\n"}, {"title": "How to not be a hater?  (self.intj)", "likes": "13", "comments": "7", "content": "I know that I should just focus on improving myself instead of criticizing others, but it’s difficult not to pick up on flaws of family, friends and online content (especially if they are glaring issues.)\nDoes anyone here have any practice advice on how to tolerate people’s flaws better?\nOr perhaps advice for separating your negative emotional reactions towards certain behaviors from your daily interactions with the world?\nThanks a bunch and hope everyone’s having a nice weekend :)\n\n"}, {"title": "What's up with INFJs?  (self.intj)", "likes": "38", "comments": "67", "content": "I don't know if it's all INTJs or just me but I find myself naturally magnetized towards the INFJs. 2 our of my 3 of my friends are INFJ (other one is an ENFJ) my crush is an INFJ.\nThe reasons why I like those people:\n-They are deep thinkers and highly philosophical.\n-They like to read.\n-They are smarter than most people and can see through different layers.\n-No bullshit.\n\n"}], [{"title": "What was/is your studying style in hs/college? (self.intj)", "likes": "3", "comments": "3", "content": "So, first of all, I'm not that sure about being an INTJ or an INTP and that's mostly because of my approach to studying and related things to it.\nI was quite good at HS, my average was an A when I finished it but the way  I did was quite weird.So, in middle school, I didn't skip many classes, at least as far as I remember and I was rather a C/B student than an A student. I got how things worked fully by the time I entered my HS, well, I always knew how they were but I just decided to change my attitude to it. My school didn't care that much about the attendance rate but about their student's grade rate, so I decided to skip pretty much often, I skipped like 30-35% of my last school year. First of all, I found it quite easy to study subjects at high school, so anytime I attended classes I answered them, sometimes without preparing, sometimes studying during the class or just before it. Everything was relatively easy, even exams were so. I was sitting rather in the first row or in the last: In the first case because I wanted to interact with my teacher well, in the second case because 2 of my friends were always sitting there. The reason why I was skipping was that I hated going there, I didn't hate the process of sitting there and just being there, I didn't hate my school itself. I just hated that I have to waste my time on it because I could do other things that were more interesting to me and I could simply better take some sleep than going there. I was self-teaching myself. I sure knew I wanted to enter university so I was preparing on my own. I never learnt English at my school, in middle school I got a C on that but when I started learning it on my own I easily got an A. I prepared for all my exams on my own and got As on them. My parents decided to send me to additional lessons with private teachers but I hated the idea and eventually managed to talk them out from that.\nSo I managed to enter one of the top unis in my country so I felt rather happy about it but I wasn't that glad about my majors. It's regional science while I'd like to code more. Anyways, I took first weeks quite serious to understand how It works and what I will do and It seemed the same as easy as It was in my HS. I sit rather in the first or the second row, the same reason as It was. I skip a lot, uni stated that students mustn't skip more than 36h in a term but I realized It was not that true. If my grades are fine and I don't skip too much, I'm safe. So I skipped about 60h-70h in my first midterm and nothing happened, I closed my exams A-B-A-A. But It's this year, I actually entered my uni a year before but I took a year off because I was stupid, I won't deny it. My grades were fine and I skipped pretty the same but I was failing my german language, although anything would tell It was that big of a problem but I felt depressed that year, there were reasons for that but still It was rather stupid. After that, I started feeling insecure as hell about studying: I always feel like I can be expelled and that's really not on my plan. This year my grades are fine but my new language class (which is Korean) makes me feel insecure, that's the only subject I got a bad grade (E). I still don't study for my classes pretty much at all and especially since It's online classes now. I always cheat on or slam off everything I'm given to do. I do that because I know It'll work. I knew how to trick on the anti-plagiarism system so all my papers are not actually mine but the system never found it out so I got all As on them. I always find short-ways to do my homework, like, I do my Korean home literally just translating things in google, changing some words to those that are supposed to be used (I just cntr+F our book) and then give it to Koreans in a discord server to check it. I actually did my translation test exactly like that I got my first C+ on Korean (before It was F-D). I realize I should study it and I do but It's not that easy, unfortunately, so I set up a plan that I have to study Korean every day for 2 hours. I'm just bad at memorizing stuff from doing the same thing again and again (remote memory), I wouldn't say that I get things through practizing either. I understand it conceptually, I know-how It should be but because of not remembering all stuff at once I suck at it.\nSo I know what I want from it, I wouldn't say I don't care about my grades (although I often say it irl but more in an ironic way). I'd even say I want to be an A student but because of my Korean and PE, oh yes, I forgot about PE classes, yes, they also influence our grade and they're obligatory, the attendance rate is the grade of this crappy subject and what do you think I got on that? a D for sure. So due to some reasons, my average in the first midterm was a C++.  I also code and I strive for learning it fully and I want to try it as a job. So I want to do completely not what I'm studying but I'll still do that to feel safe. It's due to many reasons I planned for my future.\nAbout how I sit in classes, well, usually I dream away and my attention is the worst thing here. Even if I try to focus, later on, I forget about focusing. I might have ADHD but I don't think I will see some therapy.\nYet I forgot to mention how I hate PE, that's just pointless for me and that's all.\nSo that's pretty much it. Would you relate to it? And probably give some advice on how to not being unproductive?\n\n"}, {"title": "New here! Need help with typing  (self.intj)", "likes": "3", "comments": "3", "content": "So I gave the 16personalities test as well as a few other online ones and i usually get types as an INTJ, INFJ, INTP, and and ISTJ. I wanted to know if there is any sure-fire way to type myself into one personality (eventhough every person is a mix).\nI'm in high school, love learning about scientific phenomena, have a dream to get into a japanese university and travel to japan, and can overthink sometimes.\nI can be pretty open but it's only when I'm with my friends. I can be accepting of ideas as long as their reasoning can sustain them. \nI'd like to think I'm intuitive but I'm not sure if I've ever had a gut feeling bout it. Same is the case with thinking I'm a big picture person when I can also criticise people over small details. \nIdk if this helps as an example, but if you asked me how I'd manage a food crisis issue, I'd say I'd start by handling the overpopulation and high birth rate factors.\n\n"}, {"title": "Is this person an INTJ?  (self.intj)", "likes": "3", "comments": "8", "content": "I'm an ENTP, and I'm usually not bad at typing people, but I can't figure this person out. \nHere's the context: I dated this person in high school, and he was in student government, captained the wrestling team, and got pretty good grades. He was a pretty objectively popular person, cared a lot about his friends, and could be a bit of an asshole when it came to girls. He also had commitment issues. We took a 16p-style test junior year (probably very inaccurate), and he got ENFP.\nI lost touch with him for a few years, and got to know him again in 2018 as friends. When I re-met him, it seemed like he had become an entirely different person. He was in an abusive relationship for 3 years and had become really mellow. He has diagnosed depression and anxiety, but refuses to get treatment or take medication. He does smoke and use psychedelics. He no longer cares about his grades in school (senior in college—a very good one, too), but he's really meticulous when it comes to cleaning his environment or cooking for himself. He spends most of his time at the gym, which he says is the one thing he enjoys doing. He also likes herpetology and owns several pythons (but this is something from high school as well). He has a very minimalist lifestyle and doesn't care about his outward appearance nearly as much as he used to in high school. He's lost when it comes to future aspirations, though he might want to be a veterinarian. He admits to being a bit emotionally independent on his other ex-girlfriend (who has BPD). His political leanings are liberal. He loves films and underground music. He paints a bit.\nI think this part is why he thinks he's an INTJ. He has a very strong opinion on relationships, as he thinks that relationships are less about mutual admiration and respect and more about wanting to control the other person. He despises relationship-related constructs, such as monogamy and marriage. He thinks any relationship, platonic or otherwise, is purely about time, place, and convenience, and he doesn't check in with the friends he seemed to have cared so much about in high school. He generally has a low opinion of humanity and wants to get out of the country and live somewhere very remote if he can in the future. He would definitely try to play God, if he had the chance. He claims that I'm the only woman he's ever been able to have an intelligent conversation with (he also claims he's not sexist, but these are his words). He's extremely nihilistic, paranoid, and stubborn. He thinks feelings aren't real and can be reasoned away. He also says that the person he was in high school was a facade, a personality he based off of one of his friends' (who ran with the same crowd as he did) in order to be more successful.\nDoes he sound like an INTJ? I could maybe see it, but have my doubts, so I wanted to hear other opinions. Whatever he is, he's definitely an unhealthy one (I was thinking he might be in subconscious or unconscious). Also, I apologize for the wall of text, because I personally hate those.\n\n"}, {"title": "Money Heist - Netflix (self.intj)", "likes": "11", "comments": "10", "content": "Anyone here watch this show? I watched Season 1 a while ago and finally getting around to watching Season 2 (I'm a few eps in).\nYou'll see masterminding at work.\n\n"}, {"title": "Mawkish and schmaltzy (self.intj)", "likes": "2", "comments": "1", "content": "What movies and tv shows would you put into this category? Does it bother you or are you cool with it?\nI personally hate it, especially in sitcoms. Community is the one that has prompted this post but it's fairly common. Thankfully there is IASIP and Curb which are much more up my alley\n\n"}, {"title": "This guys response on a thread about artists selling out made me so unbelievably mad...  (self.intj)", "likes": "10", "comments": "21", "content": "\"Artist, and folks like you, aren’t allowed to be indignant because because people don’t like your new music tho. \nFans don’t owe shit to the artist. You understand music will exist without bands. People can make their own and share it however they choose but no band makes money without fans. So actually most band owe their continued existence entirely to fans. You exist because of fans and you don’t get to be upset when you yourself fucks that relationship up. \nNone of you understand what selling out means, or you’re purposely ignoring the nuance. No matter how big a band gets they can still make art for the sake of art; artistic integrity is not mutually exclusive with profit. But once you start making art solely as the means to a monetary end you’ve lost that integrity. You’re making a product not art.\" \n\nthat was all his comment when saying how artists don't OWE anything to their fans since the artists made content (music in this case) that some people enjoy and just because they supported that art they aren't entitled to have a say on what the artist is and isn't allowed to do. People are free to dislike new content but just the audacity to even remotely hint that artists should be grateful and bend to the whims of every fan just because they happened to like their previous work got me so pissed off I had to share and hear what you guys think.\n\nSorry for the ramble I just really needed to get this out...\nWas I wrong? Should I just not be as upset about this?\n\n"}, {"title": "You ever know that you're thinking about something but can't pinpoint what it is?  (self.intj)", "likes": "21", "comments": "6", "content": "My friend mentioned to me the other day that I always seems to be thinking about something and respond with (something along the lines of), \"I'm not sure\" when they ask me what i'm thinking about?\nStarted thinking about his comment and he's right. There's a lot of times when I know i'm thinking about something because I can feel my mind trying to connect certain dots together but it takes me a while to figure our exactly what i'm trying to figure out. \nI'm not sure if it's a me thing or an INTJ thing. I tried explaining to him (the second paragraph about not knowing what i'm thinking about but knowing that i'm thinking about something) and he just gave me the weirdest look and laughed it off. I appreciate him for accepting me, he's an ESFJ.\n\n"}, {"title": "why give advice when no one listens?  (self.intj)", "likes": "266", "comments": "107", "content": "its becoming annoying. the few friends i do care about, will come to me about a problem they're having trouble with and I'll give them a whole evaluation about their problem and continue to provide multiple solutions, and they even agree with my advice but then....do the exact thing that's causing the problem. i don't understand humans, i really don't.\n\n"}, {"title": "Stereotypes.  (self.intj)", "likes": "4", "comments": "12", "content": "So, I was just listening to a podcast Patrice O' neal did some years back and a particular stereotype which is very common came up \"Women are emotional and men are logical\"\nIt is common for women to be given stereotypes mostly XSFJ women have. Which includes indirect communication, not meaning what they say and saying what they mean, being overtly emotional about everything, needing people to consider their feelings more when giving feedback instead of just stating the cold hard truth, being passive, and not knowing what they want. Or even trying to use food and sex to apologize rather than directly saying the words \"I'm sorry.\"\nWith my XSFJ even though we've known each other for over 10 years, I still h bitterly complain about how her indirect speech confuses me and how she shouldn't hold me responsible if she fails to communicate her needs in clear terms. In fact, anyone using Fe (even as an inferior function) must always ”pad\" their words.\nSo, female intjs I would like to know how you feel about these female stereotypes. \nAlso, I want to know how doing the direct opposite of all that I stated affected your relationship?\nDid it make you discover that men are hypocrites (no offense to the men) and actually like manipulative rather than direct communication? \nDo you think those qualities stated up there and putting all women in a box makes guys feel smarter and more relatable to other guys?\nHave you had to apply any of the personality traits stated up there because direct and brutally honest communication was affecting your relationship?\nI would like to hear from my female \"architects\"\n\n"}, {"title": "Does the meaninglessness of the world overwhelm you to the point of being suicidal? (self.intj)", "likes": "6", "comments": "16", "content": "I am a 17 year old, male.\nDoes life feels so much meaningless to you? Us humans exist and think we are special with our religions like Christianity that states the God has created the earth for the humans. But more and more scientifically we dig, it becomes apparent that our existence is roughly 0.00003% of the age of the universe (at the most). Not to mention the size of us, being part of the ever expanding universe with over 30000000000000000000000 stars (only the observable universe and who knows what's beyond it). So which makes me wonder what is actually the point of living. No matter what we do our lives are beyond insignificant (even if you are Genghis Khan). What is the point of achieving something \"significant\" or become one of the historical immortals with living in a meaningless universe?\nThat fact bothered me so much that I had attempted 3 prior suicide attempts. All 3 of them was attempted when I was 15. But now the suicidal tendencies are slowly creeping up on me again. Please do share how you cope with it?\nEdit: grammar\n\n"}, {"title": "How to know when to give up on a friendship?  (self.intj)", "likes": "4", "comments": "9", "content": "I've never asked for advices here before, but since I see a lot of people doing it, I'd like to see your views over something that is happening to me.\nSo, I have this INTP friend, we never met IRL but we text each other everyday for almost 10 years now. I'd say we're good friends, we know each other quite well and he's the only person I can talk about personal stuff I can't talk to anyone else. \nRecently, he's pissing me off really hard. He likes to watch and send to me some \"peculiar\" kind of images, he does this since ever and even if it annoys me I didn't bother to complain.\nHe knows that some types of images I found extremely disgusting and stupid, he knows well what irritates me the most, and now he's flooding me with these things.\nHe really likes to send them, for him, it's funny to annoy me. I already told him I don't find it funny at all but he doesn't care, I try to change the topic to talk about meaningful stuff but he just ignores what I say and continues.\nWe both deal with anxiety, so I don't know if there's something related to it. I try to speak with him about it but he doesn't explain anything.\nShould I just ghost him? I still want to be his friend but he doesn't listen to me and doesn't care much about what I think. I don't know if it's just temporary but it's happening for quite a time now.\nSorry for the long post and for possible grammatical errors.\n\n"}, {"title": "How do I interact with people who are afraid of being honest? It's like they think that being honest will get them into big trouble. It really sabotages my relationship with them if they're not being upfront or constantly sugarcoating everything they say and being insecure.  (self.intj)", "likes": "9", "comments": "19", "content": "Just tell me it as it is. I won't hurt or damage you.\n\n"}, {"title": "Tips and suggestions  (self.intj)", "likes": "7", "comments": "8", "content": "Hello my fellow INTJs,\nSo a girl I like is an INTJ (not sure but it's based on data I know about her). Do you have any tips on how to initiate contact (romantic wise)? Sadly because of corona it's only doable via Facebook.\nThanks and sorry for bad english, not a native speaker obviously.\n\n"}, {"title": "Inventing your own language/words (self.intj)", "likes": "7", "comments": "10", "content": "Hey all, \nWhen I was a kid (2-3 yrs), I used to randomly name things on my own. My whole family also used to talk to me using my words. Interestingly I used to come up with names that have no similarity whatsoever with the words in my native language. And my parents say that I started talking very lately. The fact that my mother tongue was only spoken at my home didn't help either, I wasn't able to make friends and properly speak with outside people until I was 5.\nI'm wondering that coming up with your own words and slower learning of languages is an INTJ thing. Did anyone had a similar experience??\nNow it is completely different though because I'm perfectly trilingual and can understand two more other languages slightly.\n\n"}, {"title": "I am trying to justify my reason on this situation.  (self.intj)", "likes": "3", "comments": "24", "content": "I live with my mom and she is enabling my sister. I keep telling her that she is using you and you need to stop. Of course, i am in the wrong. It's been going on for years.  Am I justify to say fuck it, pick up and leave my mother because nothing is changing.\nI don't know if my mother is stupid because she does do a lot of questioning things. Maybe if I leave, then she can't fall back on me for help and she will see what's really going on.\nI want to leave because I am caught in the middle of always fixing things but I get the shit end of the stick.\nI want to leave because I don't want to be in that situation but on the other hand if my sister gets her paws into my mom then she can really hurt my mom financially. \nI need some help with reasoning. Some advice I can sleep on. maybe a few stories of your own and how you solved it.\n\n"}, {"title": "How to deal with crush on INTJ  (self.intj)", "likes": "13", "comments": "5", "content": "I have a crush on an INTJ. That is the easy part.\nThe thing is, he is my professor. And I know it sounds incredibly stupid and I know this is probably never going to work out. But I can't uncrush. Believe me, I tried. He is mabe 15 years older than me, which is totally fine by me. \nSo my plan is to wait until I graduate, which will be in 3 years. That is a long time, and maybe I won't have a crush on him then(, which would solve the problem ;)) He is extremely professional, and even though it is not forbidden at my university to have a relationship with a student, he would never go for it, even if he liked me. I would like to approach him (ask him out for drink or something) after I graduate. But I need advice on what to do until then, so he sees me in a positive way. You know, respect me and maybe even like me. I don't want him to notice that I have a crush on him. So nothing obvious and creepy.\nRight now he helps me with my bachelor thesis. He is nice enough to me, but there is nothing personal, like I said he is very professional and has almost no personal relationships with anyone in the department. I can't really avoid him and I won't be able to in the future. His area of expertise is exactly what I want to study.\nI think he likes me as a student, otherwise he wouldn't be my supervisor. I was told he does it only if he likes the student.\nSo, any ideas?\n​\nBtw, I am an INTP and totally incompetent to deal with such things. My go to method for flirting is asking a guy if he wants to make out. (Surprisingly, this works sometimes...) And I know he is an INTJ, because I am a damn good observer.\n​\n(English is not my first language, so if you find any mistakes, you can keep them :))\n\n"}, {"title": "Do you have a hard time picking up on social cues?  (self.intj)", "likes": "7", "comments": "8", "content": "I feel like I understand people, from watching and studying habits.. but sometimes it takes a bit for things to click with me when it comes to my own self. I’ll be sitting there reflecting and realize that I’ve been doing something awkward for as long as I’ve known and I’m pretty sure I turn red with embarrassment. How could I not have seen this? \nSometimes I try to ask those close to me if I’m doing something.. wrong or weird, but they get awkward, like this is a forbidden question about a subject that is just “known”.. like it’s taboo to ask about these things. I think I have an idea in my head about how it should be, but wouldn’t it be great for someone who “gets it” to just blatantly explain it? \nMay not be an intj thing, but sometimes I feel like the only one that thinks this way.\n\n"}, {"title": "Anyone else been told this?  (self.intj)", "likes": "8", "comments": "5", "content": "I've been told I'm Persnickety/Fussy/Nit-picky\nView Poll\n\n"}, {"title": "Does anyone find operating a vehicle (car or motorcycle) to be extremely cathartic? (self.intj)", "likes": "7", "comments": "15", "content": "Title says it all. I was just reminiscing that most of my life-changing epiphanies have occurred behind the wheel or in the saddle... \nAt least for me, its specifically motorcycle riding; I get to this point, about 5 hours into a ride, where I've processed all my anxieties and triggers, analyzed my mistakes... Then I get to this state called \"Flow\", where everything is just an extension of my body... I'm no longer thinking about shifting, braking, balance. I look where I wanna go, and it happens. \nAnd its in these moments that all sorts of Ni based connections start being made... Its actually quite fascinating, and it works unconditionally; If I'm stressed and need to process something, a ride will ALWAYS do the trick.\nSo what about the rest of you Masterminds? (yes, I'm stoking our collective ego.... 😁) Y'all find driving or riding to be cathartic? And what do you think is the mechanism (from a theoretical perspective) that makes it such an efficient tool for processing?\n\n"}, {"title": "Opinions on PDA (self.intj)", "likes": "8", "comments": "15", "content": "What are your guys opinions on PDA? Where do you draw the line?\nI personally dislike it, it puts other people in a weird position and is just inconsiderate, you know, I did not consent to seeing two people exchange saliva so please stop.\n\n"}, {"title": "Maintaining Discipline/Focus while learning (self.intj)", "likes": "6", "comments": "6", "content": "I am curious to know how people manage to stay focused on an area of interest for a significant amount of time when learning independently.\nI find myself drawn to study one or two topics for anywhere between weeks to months at a time. Within that window I can go non-stop. But inevitably I will come across some other topic that will fascinate me, and will lead me to abandon my previous projects and start afresh. This prevents any true, deep understanding of an area of interest.\nDoes anyone have some advice for this phenomenon?\n(Note: This is about learning in your own time, not projects associated with schooling/career, where you are in a sense forced to keep on track)\n\n"}, {"title": "Are INTJ alpha males? ENFP asking  (self.intj)", "likes": "0", "comments": "35", "content": "Hey guys and gals! \nApologies in advance very long winded ENFP QUESTION. So I’ve come to realise that my ultimate match is INTJ. I just can’t get away from them, I always get attracted, work with them, friends with them bla bla bla. Now as I’m thinking about my life and trying to eventually be with someone that is smart, ambitious and a boss, I don’t know if INtJ’s are alpha males? I’m confused cause the ones I know are very successful in tech / finance but are they the exception to the rule. I want an INTJ that’s his own boss that I respect. I’m very girly but assertive and have my own views when need be. \nWhere are you hiding? I refuse to believe you are on Tinder, that’s a lie!\n\n"}, {"title": "Female INTJ losing interest in sex after committing to relationships  (self.intj)", "likes": "8", "comments": "33", "content": "Hi people. I recently noticed a pattern in the attraction I feel towards to and the sexual arousal I feel with my partner and past partners.\nI’m wondering whether this might be in INTJ thing so I would love to hear from you if you recognise this in any way.\nI’m a sexual person outside of relationships or when I’m dating. Dating with multiple people is also lots of fun and generally sex wil be exciting, there will be some mystery which is very interesting.\nAt some point during dating I would fall in love with a person, lose all interest in dating other people, and pursue a relationship with them.\nIn these relationships, when the ‘being helplessly in love’ has subdued and I’ve learned all about my partner (their interest, what does or doesn’t drive them) I lose interest in sex with them. \nI’m not particularly against having sex with them and when they surprise me I might definitely be up for it but I wouldn’t instigate anything on my own.\nOf course, this has had an impact on my current and past relationships.\nThe reason why I’m wondering whether this is an INTJ thing is because I see a parallel to the way I treat interests (or temporary obsessions of mine as I call them) and the moment I’m satisfied with what I learned, I stop investing time in them. They lose their interest for me. \nDoes this at all sound familiar?\n\n"}, {"title": "Barbershop + INTJ=???? (self.intj)", "likes": "53", "comments": "44", "content": "I really hate going to the barbershop. The small talk and the 20 question about my day or weekend plans. Just shutup and cut my hair PLEASE!!! Any other INTJ's like this?\n\n"}], [{"title": "How do you guy find unbiased, factual news.  (self.intj)", "likes": "2", "comments": "10", "content": "I was just curious about how other INTJs go about getting daily updates. Generally, not just on Covid-19. Covid-19 has really turned everyone into a Doctor, economist, or financial expert. Im getting tired of all the Gwyneth Paltrow blog clones.\nI just want updates on current events with as little spin as possible. Podcasts would be ideal.\n\n"}, {"title": "What's a decision that can remove the need for many other decisions?  (self.intj)", "likes": "5", "comments": "3", "content": "I'm looking to be more productive. You guys know about it.\nHow can I put my life on \"auto-mode\" by eliminating the need to make some decisions?\nFor example, preparing default shopping lists in advance so I don't need to think in the store. Or wearing the same outfit every day.\nThanks!\n\n"}, {"title": "Talkative INTJ (self.intj)", "likes": "32", "comments": "27", "content": "Yooo guys I'm an INTJ at the core, and I love it, but the thing is I dont like small talk but when I get to know people I seem to talk a lot, and sometimes i get into arguments because i dont let bullshit slide, does that makes me not and INTJ? And how to fix this flows?\n\n"}, {"title": "Screwed over by birth? (self.intj)", "likes": "5", "comments": "2", "content": "There are three types of intelligence\nIntelligence Quotient (IQ)\nEmotional Quotient (EQ)\nSocial Quotient (SQ)\n\nIntelligence Quotient (IQ): this is the measure of your comprehension ability\", solve maths; memorize things and recall subject matters.\n\n2. Emotional Quotient (EQ): this is the measure of your ability to maintain peace with others; keep to time; be responsible; be honest; respect boundaries; be humble, genuine and considerate.\n\nSocial Quotient (SQ): this is the measure of your ability  to build a network of friends and maintain it over a long period of time.\n\nPeople that have higher EQ and SQ tend to go farther in life than those with high IQ but low EQ and SQ. Most schools capitalize in improving IQ level while EQ and SQ are played down.\nA man of high IQ can end up being employed by a man of high EQ and SQ even though he has an average IQ.\nYour EQ represents your character; your SQ represents your charisma. Give in to habits that will improve these three Qs but more especially your EQ and SQ.\nEQ and SQ make one manage better than the other.\n\n"}, {"title": "WHY?!! (self.intj)", "likes": "14", "comments": "5", "content": "I've never had any dating experience because I used to keep to myself mostly. When I started college, I decided to be different and get out more. I spent time building my college life up and trying to get used to things. I had several issues and it took me all year to resolve them all. Once I did, I was finally ready to start my dating life. I was fine if most of them ended in rejections, because at least I would get the experience, I would have been satisfied with that.\n​\nThen this stupid corona virus hit and now there's nothing I can do. I can't meet anyone or get any real dating experience. And those dating apps, sure it's fun talking with them, but without an activity or something to do together, it's just so much harder! I can't believe this, my life was finally put together!! I was prepared to start living life and I get stopped by something that only comes every hundred hears! It's the ultimate salt in the wound! I'm just done with everything.\n\n"}, {"title": "INTJ in Quarantine (self.intj)", "likes": "24", "comments": "11", "content": "Hello all, by testing standards I am an off-the-chart INTJ.  I have been working in some capacity in IT for about 7 years.  While I have been making strides to leave the world of IT behind me, the recent work from home orders have very much helped me feel refreshed and less stressed.  I don't have to visit a busy office, talk to other employees, or be pressured to act like I give two shits what any of them are talking about.  Working from home is actually very delightful, and I mistakenly alluded to as much during a Zoom team meeting this afternoon with my boss and my boss's boss in attendance.  While Zooms typically make me want to stop living, especially listening to others complain about being stuck at home, the impromptu 'temperature check' of the team during this meeting empowered me to exclaim when it was my turn \"my personality is built for quarantines!\"  Some labored laughing could be seen and heard, but my superiors were not among them.  The Zoom quickly moved on to someone else and before it finished, I had Slack messages from both of them asking to clarify exactly what I meant by what I said.  I have yet to directly respond to them.  My IT team is well known as being placaters, ass-kissers, and general pushovers to anyone who wants anything...except for me.  I recognize quite well how misguided I am to be in this field, even though I enjoy technology.  Unfortunately, I may have crossed the line with them this time around.  In any case, I just wanted to share this story that I found to be funny in a very INTJ kind of way.\n\n"}, {"title": "Have you heard NF's \"If You Want Love\"? (self.intj)", "likes": "20", "comments": "4", "content": "I recently came across this song while a Playlist was on shuffle and I almost came to tears. I am not an overtly emotional person, but this song made me feel like no other song has ever. I connected with it because the song was able to explain how I feel as an INTJ regarding relationships.\nLink: https://www.youtube.com/watch?v=LfxY1sg5_rw\n\n"}, {"title": "Typing political pundits? (Where are the left-wing I*TJs?)  (self.intj)", "likes": "3", "comments": "3", "content": "Note: Feel free to add your thoughts and opinions. I know I can't say for certain these are their types, but I do believe these people, at the very least, steer in that direction. \nINTJ\nAndrew Yang (Left)\nLauren Chen  (Right)\nStephan Molyneux (Right)\nScott Adams (Right)\nPeter Thiel  (Right)\nDavid Pakman? (Left)\nIvanka Trump?  (Right) \nENTJ\nJoe Rogan (Left)\nKelly Conway (Right)\nChris Cuomo (Left)\nAl Gore (Left) \nISFP\nDave Rubin (Right)\nJared Kushner (Right)\nPete Buttigieg? INTJ? (Left)\nESFP\nDonald Trump (Right)\nCharlemagne the God (Left)\nTim Dillon (Left)\nSteve Bannon (Right)\nRush Limbaugh? (Right)\nBill Clinton (Left)\nINTP\nJordan Peterson  (Right)\nSam Harris (Left)\nEric Weinstein (Left)\nEzra Klein (Left)\nJonathan Haidt (Left) \nENTP\nJimmy Dore (Left)\nTucker Carlson (Right)\nBill Maher (Left)\nMilo Yiannopolis (Right) \nISFJ\nNancy Pelosi (Left)\nBernie Sanders (Left) \nESFJ\nMegan McCain (Right)\nAdam Carolla (Right)\nINFJ\nRon Paul (Right)\nMarianne Williamson (Left)\nENFJ\nAlexandria Ocasio Cortez (Left)\nJoe Biden (Left)\nBarrack Obama (Left)\nGavin Newson (Left)\nTrevor Noah (Left)\nISTP\nTim Pool (Left)\nCharlie Kirk (Right)\nDan Crenshaw (Right)\nKyle Kulinski (Left)\nMichelle Obama (Left)\nRand Paul (Right) \nESTP\nSteven Crowder (Right)\nDave Smith (Right)\nPeter Shiff  (Right)\nISTJ\nBen Shapiro  (Right)\nTulsi Gabbard? (Left)\nMike Pence (Right)\nMitch Mcconnell  (Right)\nDave Ramsey (Right)\nDennis Prager (Right)\nNick Fuentes (Right)\nAnn Coulter (Right)\nHilary Clinton (Left)\nESTJ\nKamala Harris (Left)\nAna Kasparian (Left)\nTomi Lahren (Right)\nDan Bongino (Right)\nCadence Owens (Right)\nDana Perino (Right)\nMegyn Kelly (Right)\nSean Hannity (Right)\nINFP\nJohn Oliver (Left) \nENFP\nAlex Jones? (Right)\nMichael Moore (Left)\nKanye West (Right)\n\n"}, {"title": "I’m looking for a mentor (self.intj)", "likes": "4", "comments": "10", "content": "Hello! This may be a long shot but as the title states, I’m searching for an INTJ mentor. I admire the way you guys live, ability to see the big picture, and I want to learn. A little bit about me to get started.. I tried to keep it short and sweet:\n\nFemale 22 y/o\nMBTI: ISTJ\nEnneagram: 3w4\nGraduating Marketing major\nAreas of Growth : Becoming more efficient/sticking to routine, business topics/trends/investing, general advice about life situations etc.\n\nPersonality (not sure if I this interests you)\n- Very driven but can get sidetracked at times\n- Blunt/straightforward but, can sugarcoat\n- Enjoys going out at times but most of the time stays in\n- Focused on self-improvement\n- Perfectionist (trying to fix this)\n- I enjoy blogging/about to learn coding\n- Recently been reading a lot of news/industry trends\nEtc.\nFeel free to ask any further questions if you’d like to vet.\n\n"}, {"title": "ENFP Relationships - Successes and Failures (self.intj)", "likes": "8", "comments": "6", "content": "INTJ-ENFP pairings are classic to the point of cliché in MBTI circles. I (M28 - INTJ) recently befriended (another) ENFP. I do not know why this happens, but they are the third close \"friend\" I've had in my life who is an ENFP. One (M34) came by his volition and left by mine. The friendship was great for quite some time, about a year, but soured. They became overly emotionally reliant and got offended by things I did which they didn't communicate as issues a priori. After many lack-of and mis-communications, followed by confusion and hurt feelings, I simply decided we were incompatible in the long-term, and attempted to gracefully exit the friendship. It's still a little raw, but we're both doing well, and my life is better without him in it. \nThe next ENFP (F19) was a co-worker before I moved on to another position . We are still in contact, but not on a close daily basis like before. She had good technical knowledge and enthusiasm which paired well. We both liked \"edgy\" music, had several piercings, and semi-rough upbringings so we got along in that regard too. May have lead to a relationship, but she's not my type and honestly a little too young. She reminded me of my little sister, although she insisted on showing me risk-ay pictures of her tatoos and scars, which was a little odd. Are ENFPs generally very comfortable with their body/sexuality?\nThe third, and most recent ENFP (F28) is more my style. She managed to track me down after 12 years of no contact (intentional - I tried to cut my early life completely out). We started a slow friendship, but it grew into an almost-relationship. Within a month of talking daily though, we had two rough patches. Both were related to expectations. The first was because I felt a little used/convenient, but always tried to be there for her. I got offended by her cutting a phone call suddenly short, so I ignored her for the afternoon (I was also at work and could only talk during lunch or after work). She withdrew and I had to coax her out and reassure her everything was cool. Took a while... The second was about a visit - I drove several hours and rented a room to hang out. She blew me off the first night, so I waited for her to make the next move. Didn't happen, she hung out with other friends instead (soooo many friends...). I got upset, and she withdrew...again. We hung out for a good couple hours, but then I had to drive home. Now we're cool and there's stil an attraction, but it's different. I'm wondering if it's even worth pursuing this anymore, it's a little exhausing and overall confusing. I'm just waiting for the next mistake I unwittingly make and have to clean up after. Bah!\nWhat are your success/failure stories with INTJ-ENFP relationships? Are we really compatible, or is this a myth? Anything is possible with enough maturity and effort, but not everything is worth the energy...\n\n"}, {"title": "Can anyone help me figure out my type?  (self.intj)", "likes": "2", "comments": "11", "content": "I think I'm either an IxTJ or an INTP, I don't know anymore. Any help or advice will be appreciated.\n\n"}, {"title": "ENFPs - Successes and Failures (self.intj)", "likes": "4", "comments": "4", "content": "INTJ-ENFP pairings are classic to the point of cliché in MBTI circles. I (M28 - INTJ) recently befriended (another) ENFP. I do not know why this happens, but they are the third close \"friend\" I've had in my life who is an ENFP. One (M34) came by his volition and left by mine. The friendship was great for quite some time, about a year, but soured. They became overly emotionally reliant and got offended by things I did which they didn't communicate as issues a priori. After many lack-of and mis-communications, followed by confusion and hurt feelings, I simply decided we were incompatible in the long-term, and attempted to gracefully exit the friendship. It's still a little raw, but we're both doing well, and my life is better without him in it. \nThe next ENFP (F19) was a co-worker before I moved on to another position . We are still in contact, but not on a close daily basis like before. She had good technical knowledge and enthusiasm which paired well. We both liked \"edgy\" music, had several piercings, and semi-rough upbringings so we got along in that regard too. May have lead to a relationship, but she's not my type and honestly a little too young. She reminded me of my little sister, although she insisted on showing me risk-ay pictures of her tattoos and scars, which was a little odd. Are ENFPs generally very comfortable with their body/sexuality?\nThe third, and most recent ENFP (F28) is more my style. She managed to track me down after 12 years of no contact (intentional - I tried to cut my early life completely out). We started a slow friendship, but it grew into an almost-relationship. Within a month of talking daily though, we had two rough patches. Both were related to expectations. The first was because I felt a little used/convenient, but always tried to be there for her. I got offended by her cutting a phone call suddenly short, so I ignored her for the afternoon (I was also at work and could only talk during lunch or after work). She withdrew and I had to coax her out and reassure her everything was cool. Took a while... The second was about a visit - I drove several hours and rented a room to hang out. She blew me off the first night, so I waited for her to make the next move. Didn't happen, she hung out with other friends instead (soooo many friends...). I got upset, and she withdrew...again. We hung out for a good couple hours, but then I had to drive home. Now we're cool and there's stil an attraction, but it's different. I'm wondering if it's even worth pursuing this anymore, it's a little exhausting and overall confusing. I'm just waiting for the next mistake I unwittingly make and have to clean up after. Bah!\nWhat are your success/failure stories with INTJ-ENFP relationships? Are we really compatible, or is this a myth? Anything is possible with enough maturity and effort, but not everything is worth the energy...\n\n"}, {"title": "This is what it feels like when an ENFP keeps bugging me lol  (self.intj)", "likes": "9", "comments": "5", "content": "https://youtu.be/YuUeNsZgmyc\n\n"}, {"title": "Are you NOT an atheist and/or nihilist? (self.intj)", "likes": "4", "comments": "33", "content": "I'm curious about the perspectives of fellow INTJs who are either religious or believe in some sort of meaning or purpose to human existence. \nMost people I know who are religious or believe in the concept of souls (or afterlife or purpose or whatever) to any extent, do so either out of habit or out of comfort. I feel like we naturally reject belief in things on those grounds... but I know there are religious INTJs amongst us. If that is you, how did you come to that conclusion? \n(If you're religious for cultural or communal/family reasons but do not actually believe in the reality of God/gods, this doesn't apply to you. I'm looking for people who genuinely believe in a literal higher being/purpose.)\n\n"}, {"title": "Anime with intj x infj couple in it?  (self.intj)", "likes": "11", "comments": "14", "content": "Like Elias and Chise from Mahou Tsukai no Yome.\n Or just a anime couple with a intj in it...\n\n"}, {"title": "Do INTJ’s still think of the people they ghosted? (self.intj)", "likes": "26", "comments": "65", "content": "I’ve been ghosted by an INTJ guy. I met him on online dating site. We talked everyday for months, and we were planning to meet. I thought we were hitting it off, but one day he stopped replying to my messages. I tried to recall our last conversation, and i think I offended him. Idk. \nAnyway, I know he won’t message me anymore and that’s okay. I’m just wondering, do INTJ’s still think of the people they ghosted?\n\n"}, {"title": "color of intjs (self.intj)", "likes": "4", "comments": "30", "content": "which color do you think best suits the personality of an intj? (and why?)\n\n"}, {"title": "Some of the non INTJ girl posts here (self.intj)", "likes": "8", "comments": "11", "content": "Maybe he isn't an INTJ and is just uninterested? I think people take these MBTI things to seriously.\n\n"}, {"title": "Quick question: Korean literature  (self.intj)", "likes": "4", "comments": "2", "content": "Are there any Korean authors that you enjoyed reading as an INTJ?\n\n"}, {"title": "ENFP Relationships - Successes and Failures  (self.intj)", "likes": "2", "comments": 0, "content": "INTJ-ENFP pairings are classic to the point of cliché in MBTI circles. I (M28 - INTJ) recently befriended (another) ENFP. I do not know why this happens, but they are the third close \"friend\" I've had in my life who is an ENFP. One (M34) came by his volition and left by mine. The friendship was great for quite some time, about a year, but soured. They became overly emotionally reliant and got offended by things I did which they didn't communicate as issues a priori. After many lack-of and mis-communications, followed by confusion and hurt feelings, I simply decided we were incompatible in the long-term, and attempted to gracefully exit the friendship. It's still a little raw, but we're both doing well, and my life is better without him in it.\nThe next ENFP (F19) was a co-worker before I moved on to another position. We are still in contact, but not on a daily basis like before. She had good technical knowledge and enthusiasm which paired well. We both liked \"edgy\" music, had several piercings, and semi-rough upbringings so we got along in that regard too. May have lead to a relationship, but she's not my type and honestly a little too young. She reminded me of my little sister, although she insisted on showing me risk-ay pictures of her tatoos and scars, which was a little odd. Are ENFPs generally very comfortable with their body/sexuality?\nThe third, and most recent ENFP (F28) is more my style. She managed to track me down after 12 years of no contact (intentional - I tried to cut my early life completely out). We started a slow friendship, but it grew into an almost-relationship. Within a month of talking daily though, we had two rough patches. Both were related to expectations. The first was because I felt a little used/convenient, but always tried to be there for her. I got offended by her cutting a phone call suddenly short, so I ignored her for the afternoon (I was also at work and could only talk during lunch or after work). She withdrew and I had to coax her out and reassure her everything was cool. Took a while... The second was about a visit - I drove several hours and rented a room to hang out. She blew me off the first night, so I waited for her to make the next move. Didn't happen, she hung out with other friends instead (soooo many friends...). I got upset, and she withdrew...again. We hung out for a good couple hours, but then I had to drive home. Now we're cool and there's stil an attraction, but it's different. I'm wondering if it's even worth pursuing this anymore, it's a little exhausing and overall confusing. I'm just waiting for the next mistake I unwittingly make and have to clean up after. Bah!\nWhat are your success/failure stories with INTJ-ENFP relationships? Are we really compatible, or is this a myth? Anything is possible with enough maturity and effort, but not everything is worth the energy...\n\n"}, {"title": "ENFP Relationships - Successes and Failures  (self.intj)", "likes": "0", "comments": 0, "content": "INTJ-ENFP pairings are classic to the point of cliché in MBTI circles. I (M28 - INTJ) recently befriended (another) ENFP. I do not know why this happens, but they are the third close \"friend\" I've had in my life who is an ENFP. One (M34) came by his volition and left by mine. The friendship was great for quite some time, about a year, but soured. They became overly emotionally reliant and got offended by things I did which they didn't communicate as issues a priori. After many lack-of and mis-communications, followed by confusion and hurt feelings, I simply decided we were incompatible in the long-term, and attempted to gracefully exit the friendship. It's still a little raw, but we're both doing well, and my life is better without him in it.\nThe next ENFP (F19) was a co-worker before I moved on to another position. We are still in contact, but not on a daily basis like before. She had good technical knowledge and enthusiasm which paired well. We both liked \"edgy\" music, had several piercings, and semi-rough upbringings so we got along in that regard too. May have lead to a relationship, but she's not my type and honestly a little too young. She reminded me of my little sister, although she insisted on showing me risk-ay pictures of her tatoos and scars, which was a little odd. Are ENFPs generally very comfortable with their body/sexuality?\nThe third, and most recent ENFP (F28) is more my style. She managed to track me down after 12 years of no contact (intentional - I tried to cut my early life completely out). We started a slow friendship, but it grew into an almost-relationship. Within a month of talking daily though, we had two rough patches. Both were related to expectations. The first was because I felt a little used/convenient, but always tried to be there for her. I got offended by her cutting a phone call suddenly short, so I ignored her for the afternoon (I was also at work and could only talk during lunch or after work). She withdrew and I had to coax her out and reassure her everything was cool. Took a while... The second was about a visit - I drove several hours and rented a room to hang out. She blew me off the first night, so I waited for her to make the next move. Didn't happen, she hung out with other friends instead (soooo many friends...). I got upset, and she withdrew...again. We hung out for a good couple hours, but then I had to drive home. Now we're cool and there's stil an attraction, but it's different. I'm wondering if it's even worth pursuing this anymore, it's a little exhausing and overall confusing. I'm just waiting for the next mistake I unwittingly make and have to clean up after. Bah!\nWhat are your success/failure stories with INTJ-ENFP relationships? Are we really compatible, or is this a myth? Anything is possible with enough maturity and effort, but not everything is worth the energy...\n\n"}, {"title": "ENFP Relationships - Successes and Failures  (self.intj)", "likes": "0", "comments": 0, "content": "INTJ-ENFP pairings are classic to the point of cliché in MBTI circles. I (M28 - INTJ) recently befriended (another) ENFP. I do not know why this happens, but they are the third close \"friend\" I've had in my life who is an ENFP. One (M34) came by his volition and left by mine. The friendship was great for quite some time, about a year, but soured. They became overly emotionally reliant and got offended by things I did which they didn't communicate as issues a priori. After many lack-of and mis-communications, followed by confusion and hurt feelings, I simply decided we were incompatible in the long-term, and attempted to gracefully exit the friendship. It's still a little raw, but we're both doing well, and my life is better without him in it.\nThe next ENFP (F19) was a co-worker before I moved on to another position. We are still in contact, but not on a daily basis like before. She had good technical knowledge and enthusiasm which paired well. We both liked \"edgy\" music, had several piercings, and semi-rough upbringings so we got along in that regard too. May have lead to a relationship, but she's not my type and honestly a little too young. She reminded me of my little sister, although she insisted on showing me risk-ay pictures of her tatoos and scars, which was a little odd. Are ENFPs generally very comfortable with their body/sexuality?\nThe third, and most recent ENFP (F28) is more my style. She managed to track me down after 12 years of no contact (intentional - I tried to cut my early life completely out). We started a slow friendship, but it grew into an almost-relationship. Within a month of talking daily though, we had two rough patches. Both were related to expectations. The first was because I felt a little used/convenient, but always tried to be there for her. I got offended by her cutting a phone call suddenly short, so I ignored her for the afternoon (I was also at work and could only talk during lunch or after work). She withdrew and I had to coax her out and reassure her everything was cool. Took a while... The second was about a visit - I drove several hours and rented a room to hang out. She blew me off the first night, so I waited for her to make the next move. Didn't happen, she hung out with other friends instead (soooo many friends...). I got upset, and she withdrew...again. We hung out for a good couple hours, but then I had to drive home. Now we're cool and there's stil an attraction, but it's different. I'm wondering if it's even worth pursuing this anymore, it's a little exhausing and overall confusing. I'm just waiting for the next mistake I unwittingly make and have to clean up after. Bah!\nWhat are your success/failure stories with INTJ-ENFP relationships? Are we really compatible, or is this a myth? Anything is possible with enough maturity and effort, but not everything is worth the energy...\n\n"}, {"title": "ENFP Relationships - Successes and Failures  (self.intj)", "likes": "1", "comments": 0, "content": "INTJ-ENFP pairings are classic to the point of cliché in MBTI circles. I (M28 - INTJ) recently befriended (another) ENFP. I do not know why this happens, but they are the third close \"friend\" I've had in my life who is an ENFP. One (M34) came by his volition and left by mine. The friendship was great for quite some time, about a year, but soured. They became overly emotionally reliant and got offended by things I did which they didn't communicate as issues a priori. After many lack-of and mis-communications, followed by confusion and hurt feelings, I simply decided we were incompatible in the long-term, and attempted to gracefully exit the friendship. It's still a little raw, but we're both doing well, and my life is better without him in it.\nThe next ENFP (F19) was a co-worker before I moved on to another position. We are still in contact, but not on a daily basis like before. She had good technical knowledge and enthusiasm which paired well. We both liked \"edgy\" music, had several piercings, and semi-rough upbringings so we got along in that regard too. May have lead to a relationship, but she's not my type and honestly a little too young. She reminded me of my little sister, although she insisted on showing me risk-ay pictures of her tatoos and scars, which was a little odd. Are ENFPs generally very comfortable with their body/sexuality?\nThe third, and most recent ENFP (F28) is more my style. She managed to track me down after 12 years of no contact (intentional - I tried to cut my early life completely out). We started a slow friendship, but it grew into an almost-relationship. Within a month of talking daily though, we had two rough patches. Both were related to expectations. The first was because I felt a little used/convenient, but always tried to be there for her. I got offended by her cutting a phone call suddenly short, so I ignored her for the afternoon (I was also at work and could only talk during lunch or after work). She withdrew and I had to coax her out and reassure her everything was cool. Took a while... The second was about a visit - I drove several hours and rented a room to hang out. She blew me off the first night, so I waited for her to make the next move. Didn't happen, she hung out with other friends instead (soooo many friends...). I got upset, and she withdrew...again. We hung out for a good couple hours, but then I had to drive home. Now we're cool and there's stil an attraction, but it's different. I'm wondering if it's even worth pursuing this anymore, it's a little exhausing and overall confusing. I'm just waiting for the next mistake I unwittingly make and have to clean up after. Bah!\nWhat are your success/failure stories with INTJ-ENFP relationships? Are we really compatible, or is this a myth? Anything is possible with enough maturity and effort, but not everything is worth the energy...\n\n"}, {"title": "Questions for INTJ Business Owners  (self.intj)", "likes": "3", "comments": "2", "content": "One month ago, I started a hobby (e-commerce) that has turned into a full blown passion project. Hands down the most fun and exciting project I have ever invested my time into. Every free moment of my time is spent either working on the website directly or researching, creating mock-ups, consuming internet articles and YouTube videos like I’ll go into panicked despair without the constant bombardment of information. I have a notebook glued to my side now at all times so I won’t forget any thoughts when I’m away from the computer. SEO, ads, legalities, coding, graphic design and photoshop, branding, marketing, business jargon I never bothered to understand previously - information aplenty! \nNever thought I would say this, but I really wish I could work with other people on this project. I want my brand board to be massacred with unfettered explanation. I want new ideas from people that don’t think like I do. I want to knock around ideas with people I can trust who actually bother to think about things. \nMy SO does a certain variety of e-commerce full time and is an amazing resource, but he is busy all day doing this and is brain fried wanting to rest when he gets home. So it’s no good to lean on him and only him. My friends don’t really care about any of this/they don’t know about certain things to have meaningful discussion, which is totally fine. Plus I don’t really like opening up ideas to people who aren’t willing to dish any back. \nI’m part of some private groups specifically for these types of discussions. Here’s what I see: the need to stay vague and the inherent distrust of online strangers does not foster transparency, which hampers peoples ability to communicate their specific concerns. Great for technical questions that Google can’t answer, but the advice, while occasionally helpful, is often too broad or generalized. Often you will see conflicting advice - the resolution would only be a further, in-depth understanding of the company to give a true right answer. There’s both silo mentality and the constant reiteration to figure things out for yourself. \nThat’s on the owner, that’s part of the risk - yes. Discuss, but keep your cards close. Self education and awareness is obviously paramount. However, in these early stages, nothing beats true interpersonal brainstorming from individuals you trust. For me, I HAVE to understand the thought process behind a suggestion being made. One liner simple answers are discouraging. Even if it sounds right, I have to know how they got there. How do I know they considered all the aspects I did?\nI’m wondering if there are any business owners here who have experience with managing passion and ideas, and the personal steps taken to get there. \nWhat have your experiences been? \nWho have you trusted? \nWhat was the best advice you received? \nWhat’s something you struggled with? \nThanks in advance, looking forward to reading comments.\n\n"}], [{"title": "ENFP Relationships - Successes and Failures (self.intj)", "likes": "2", "comments": 0, "content": "INTJ-ENFP pairings are classic to the point of cliché in MBTI circles. I (M28 - INTJ) recently befriended (another) ENFP. I do not know why this happens, but they are the third close \"friend\" I've had in my life who is an ENFP. One (M34) came by his volition and left by mine. The friendship was great for quite some time, about a year, but soured. They became overly emotionally reliant and got offended by things I did which they didn't communicate as issues a priori. After many lack-of and mis-communications, followed by confusion and hurt feelings, I simply decided we were incompatible in the long-term, and attempted to gracefully exit the friendship. It's still a little raw, but we're both doing well, and my life is better without him in it. \nThe next ENFP (F19) was a co-worker before I moved on to another position . We are still in contact, but not on a close daily basis like before. She had good technical knowledge and enthusiasm which paired well. We both liked \"edgy\" music, had several piercings, and semi-rough upbringings so we got along in that regard too. May have lead to a relationship, but she's not my type and honestly a little too young. She reminded me of my little sister, although she insisted on showing me risk-ay pictures of her tatoos and scars, which was a little odd. Are ENFPs generally very comfortable with their body/sexuality?\nThe third, and most recent ENFP (F28) is more my style. She managed to track me down after 12 years of no contact (intentional - I tried to cut my early life completely out). We started a slow friendship, but it grew into an almost-relationship. Within a month of talking daily though, we had two rough patches. Both were related to expectations. The first was because I felt a little used/convenient, but always tried to be there for her. I got offended by her cutting a phone call suddenly short, so I ignored her for the afternoon (I was also at work and could only talk during lunch or after work). She withdrew and I had to coax her out and reassure her everything was cool. Took a while... The second was about a visit - I drove several hours and rented a room to hang out. She blew me off the first night, so I waited for her to make the next move. Didn't happen, she hung out with other friends instead (soooo many friends...). I got upset, and she withdrew...again. We hung out for a good couple hours, but then I had to drive home. Now we're cool and there's stil an attraction, but it's different. I'm wondering if it's even worth pursuing this anymore, it's a little exhausing and overall confusing. I'm just waiting for the next mistake I unwittingly make and have to clean up after. Bah!\nWhat are your success/failure stories with INTJ-ENFP relationships? Are we really compatible, or is this a myth? Anything is possible with enough maturity and effort, but not everything is worth the energy.\n\n"}, {"title": "ENFP Relationships - Successes and Failures? (self.intj)", "likes": "1", "comments": 0, "content": "INTJ-ENFP pairings are classic to the point of cliché in MBTI circles. I (M28 - INTJ) recently befriended (another) ENFP. I do not know why this happens, but they are the third close \"friend\" I've had in my life who is an ENFP. One (M34) came by his volition and left by mine. The friendship was great for quite some time, about a year, but soured. They became overly emotionally reliant and got offended by things I did which they didn't communicate as issues a priori. After many lack-of and mis-communications, followed by confusion and hurt feelings, I simply decided we were incompatible in the long-term, and attempted to gracefully exit the friendship. It's still a little raw, but we're both doing well, and my life is better without him in it. \nThe next ENFP (F19) was a co-worker before I moved on to another position . We are still in contact, but not on a close daily basis like before. She had good technical knowledge and enthusiasm which paired well. We both liked \"edgy\" music, had several piercings, and semi-rough upbringings so we got along in that regard too. May have lead to a relationship, but she's not my type and honestly a little too young. She reminded me of my little sister, although she insisted on showing me risk-ay pictures of her tatoos and scars, which was a little odd. Are ENFPs generally very comfortable with their body/sexuality?\nThe third, and most recent ENFP (F28) is more my style. She managed to track me down after 12 years of no contact (intentional - I tried to cut my early life completely out). We started a slow friendship, but it grew into an almost-relationship. Within a month of talking daily though, we had two rough patches. Both were related to expectations. The first was because I felt a little used/convenient, but always tried to be there for her. I got offended by her cutting a phone call suddenly short, so I ignored her for the afternoon (I was also at work and could only talk during lunch or after work). She withdrew and I had to coax her out and reassure her everything was cool. Took a while... The second was about a visit - I drove several hours and rented a room to hang out. She blew me off the first night, so I waited for her to make the next move. Didn't happen, she hung out with other friends instead (soooo many friends...). I got upset, and she withdrew...again. We hung out for a good couple hours, but then I had to drive home. Now we're cool and there's stil an attraction, but it's different. I'm wondering if it's even worth pursuing this anymore, it's a little exhausing and overall confusing. I'm just waiting for the next mistake I unwittingly make and have to clean up after. Bah!\nWhat are your success/failure stories with INTJ-ENFP relationships? Are we really compatible, or is this a myth? Anything is possible with enough maturity and effort, but not everything is worth the energy...\n\n"}, {"title": "ENFP Relationships - Successes and Failures? (self.intj)", "likes": "1", "comments": 0, "content": "INTJ-ENFP pairings are classic to the point of cliché in MBTI circles. I (M28 - INTJ) recently befriended (another) ENFP. I do not know why this happens, but they are the third close \"friend\" I've had in my life who is an ENFP. One (M34) came by his volition and left by mine. The friendship was great for quite some time, about a year, but soured. They became overly emotionally reliant and got offended by things I did which they didn't communicate as issues a priori. After many lack-of and mis-communications, followed by confusion and hurt feelings, I simply decided we were incompatible in the long-term, and attempted to gracefully exit the friendship. It's still a little raw, but we're both doing well, and my life is better without him in it. \nThe next ENFP (F19) was a co-worker before I moved on to another position . We are still in contact, but not on a close daily basis like before. She had good technical knowledge and enthusiasm which paired well. We both liked \"edgy\" music, had several piercings, and semi-rough upbringings so we got along in that regard too. May have lead to a relationship, but she's not my type and honestly a little too young. She reminded me of my little sister, although she insisted on showing me risk-ay pictures of her tatoos and scars, which was a little odd. Are ENFPs generally very comfortable with their body/sexuality?\nThe third, and most recent ENFP (F28) is more my style. She managed to track me down after 12 years of no contact (intentional - I tried to cut my early life completely out). We started a slow friendship, but it grew into an almost-relationship. Within a month of talking daily though, we had two rough patches. Both were related to expectations. The first was because I felt a little used/convenient, but always tried to be there for her. I got offended by her cutting a phone call suddenly short, so I ignored her for the afternoon (I was also at work and could only talk during lunch or after work). She withdrew and I had to coax her out and reassure her everything was cool. Took a while... The second was about a visit - I drove several hours and rented a room to hang out. She blew me off the first night, so I waited for her to make the next move. Didn't happen, she hung out with other friends instead (soooo many friends...). I got upset, and she withdrew...again. We hung out for a good couple hours, but then I had to drive home. Now we're cool and there's stil an attraction, but it's different. I'm wondering if it's even worth pursuing this anymore, it's a little exhausing and overall confusing. I'm just waiting for the next mistake I unwittingly make and have to clean up after. Bah!\nWhat are your success/failure stories with INTJ-ENFP relationships? Are we really compatible, or is this a myth? Anything is possible with enough maturity and effort, but not everything is worth the energy...\n\n"}, {"title": "ENFP Relationships - Successes and Failures? (self.intj)", "likes": "1", "comments": "1", "content": "INTJ-ENFP pairings are classic to the point of cliché in MBTI circles. I (M28 - INTJ) recently befriended (another) ENFP. I do not know why this happens, but they are the third close \"friend\" I've had in my life who is an ENFP. One (M34) came by his volition and left by mine. The friendship was great for quite some time, about a year, but soured. They became overly emotionally reliant and got offended by things I did which they didn't communicate as issues a priori. After many lack-of and mis-communications, followed by confusion and hurt feelings, I simply decided we were incompatible in the long-term, and attempted to gracefully exit the friendship. It's still a little raw, but we're both doing well, and my life is better without him in it. \nThe next ENFP (F19) was a co-worker before I moved on to another position . We are still in contact, but not on a close daily basis like before. She had good technical knowledge and enthusiasm which paired well. We both liked \"edgy\" music, had several piercings, and semi-rough upbringings so we got along in that regard too. May have lead to a relationship, but she's not my type and honestly a little too young. She reminded me of my little sister, although she insisted on showing me risk-ay pictures of her tatoos and scars, which was a little odd. Are ENFPs generally very comfortable with their body/sexuality?\nThe third, and most recent ENFP (F28) is more my style. She managed to track me down after 12 years of no contact (intentional - I tried to cut my early life completely out). We started a slow friendship, but it grew into an almost-relationship. Within a month of talking daily though, we had two rough patches. Both were related to expectations. The first was because I felt a little used/convenient, but always tried to be there for her. I got offended by her cutting a phone call suddenly short, so I ignored her for the afternoon (I was also at work and could only talk during lunch or after work). She withdrew and I had to coax her out and reassure her everything was cool. Took a while... The second was about a visit - I drove several hours and rented a room to hang out. She blew me off the first night, so I waited for her to make the next move. Didn't happen, she hung out with other friends instead (soooo many friends...). I got upset, and she withdrew...again. We hung out for a good couple hours, but then I had to drive home. Now we're cool and there's stil an attraction, but it's different. I'm wondering if it's even worth pursuing this anymore, it's a little exhausing and overall confusing. I'm just waiting for the next mistake I unwittingly make and have to clean up after. Bah!\nWhat are your success/failure stories with INTJ-ENFP relationships? Are we really compatible, or is this a myth? Anything is possible with enough maturity and effort, but not everything is worth the energy...\n\n"}, {"title": "What is important in long-term military victories: Innovative strategies that adapt, or brute-force with confidence in large numbers  (self.intj)", "likes": "4", "comments": "14", "content": "I was having this argument with an INTP friend, me being on the side of innovative strategies as they calculate specific weaknesses in the enemy rather than just repeat the same thing. What do you guys think?\n\n"}, {"title": "INTJ and manners (self.intj)", "likes": "8", "comments": "12", "content": "I am wondering how you all feel about manners.  Just pleasantries, being nice to warm the mood of the conversation.\nI think a lot of INTJ's will see this as \"small talk\" and useless.  Some probably think they're too good for it.  In a way I can see that, in another I think sometimes we are pretentious in ways like this (speaking as an INTJ, dating an INTJ).\nI want to say that I am an American.  In the US, we see it as polite to basically say a lot of nice things when we talk to people, even if we don't really mean it or care (eg. \"How are you?\")  I've known foreigners who see these as empty and not genuine, but not using these can be seen as rude or put some people off.  \nI work with people as my career.  It's not so much customer service as it is helping people navigate choices and such.  Being as nice and polite as possible makes everything smoother.  People exhaust me, and the quickest way to get them in and out of my office is to keep a pleasant mood and try to be as pleasant as possible.  It makes everything go smoother.\nI see the value in keeping a pleasant mood and rapport with people, so I make it a point to smile at people and say good morning.  My bf comes from a culture where people aren't that friendly to people they don't know, they don't smile much, and they get straight to the point, and he doesn't see the point in pleasantries.  I get that - I do it more for the advantages, not because it's always genuine necessarily.  \nHow do you feel?\n\n"}, {"title": "What do you do when nostalgia hits you?  (self.intj)", "likes": "4", "comments": "7", "content": "I (INTJ F 22) was just hit with nostalgia hard, how does not matter here. Usually, I am not nostalgic or sentimental at all.\nI was reminded of a guy I developed a friendship with (and I had a crush on him for a bit, but it had no impact on our friendship). The friendship just wasn't supposed to be (or to last). This is already 1.5 years ago and I came to accept it soon after it stopped.\nI remember all the amazing conversations and all the coffee that we had, and I just wish this friendship would still exist and I suddenly seem to miss him. \nI can't get away from these thoughts, please tell me what you do when nostalgia hits you or any advice. I appreciate it greatly!\n\n"}, {"title": "A riddle for my fellow INTJs  (self.intj)", "likes": "3", "comments": "12", "content": "What walks on 2 legs in morning,\nOn 4 legs in evening,\nAnd on 3 legs in night.\n.\n.\n.\nNOTE:-Question is not easy\nHave fun (｡•̀ᴗ-)✧\n\n"}, {"title": "I don't like it when other people ask to see my work... (self.intj)", "likes": "32", "comments": "8", "content": "Hi, I'm just writing it to get it off my chest. For some reason, I don't like it when other people ask to see my work or when they look at my screen or when they look over my shoulder or ask me if I finished this or that. It makes me feel really paranoid and I just really hate it. I'd rather show them when I've completed the work and don't want them to see the process. I don't know why but it makes me feel frustrated. Now, people always think I'm hiding something bad when I'm not and It's really getting on my nerves. My brother said I'm weird and not normal. Just wanna know if anyone else experienced anything similar or has any advice to do better.\n\n"}, {"title": "WHY?!! (self.intj)", "likes": "0", "comments": 0, "content": "I've never had any dating experience because I used to keep to myself mostly. When I started college, I decided to be different and get out more. I spent time building my college life up and trying to get used to things. I had several issues and it took me all year to resolve them all. Once I did, I was finally ready to start my dating life. I was fine if most of them ended in rejections, because at least I would get the experience, I would have been satisfied with that.\n​\nThen this stupid corona virus hit and now there's nothing I can do. I can't meet anyone or get any real dating experience. And those dating apps, sure it's fun talking with them, but without an activity or something to do together, it's just so much harder! I can't believe this, my life was finally put together!! I was prepared to start living life and I get stopped by something that only comes every hundred hears! It's the ultimate salt in the wound! I'm just done with everything.\n\n"}, {"title": "Whats the point in living such an absurd life where all your desires are rejected?  (self.intj)", "likes": "7", "comments": "14", "content": "Its all bullshit. Whats the point in living such a life, putting in your 100%, only to be hurt in the worst way possible by the only people you trusted, even after years of neglect and rejection and convincing myself that people are just not worth it.\nI work so fucking hard for things to happen, put in my 100%, and then something or the other happens to completely ruin that possibility of ever happening.\nIt makes me so furious inside, like wtf am I actually supposed to do in this life, if everything I've been trying for all my life leads me to these experiences where I'm rejected, hurt by people and treated like shit.\nI'm just fucking sick of it all. I'm going to abandon all hope now, because hope is evil. Desiring for anything to happen is just evil, no matter how much effort you put in it. Its better to abandon these expectations than to live for years fantasizing about a future that will never take place.\nI've tried so fucking hard to connect with people, even after I had real shitty experiences with people growing up, which made me completely cynical individual, to live as a loner and avoiding people as they always hurt me. I'm sick of wanting to improve, to change, when I've tried everything that I possibly could. Therapy, philosophy, analysing my psychological state for years, doing psych research, meditation, self help books, etc. I've done it all. All this research, all this is bullshit.\nWhats the point in trying for anything, when every thing you aspire for, disappoints you in the worst possible way, not even in a way where its okay you can try again not a big deal, but in a way that makes you want to end it all, that you cannot live with it anymore.\nI had given up on people earlier, and lived a lonely life until it made me miserable and yet like a fool, I decided to trust people again, after being hurt and betrayed again and again.\nIts a vicious cycle, and the worst thing is, I'm not even in control, no matter how much I try to gain control. Its all an illusion.\nLife will make you believe like things are within your reach, only to snatch it away by means that make you not being able to live with yourself anymore.\nIts all bullshit. I'm tired of pretending, and I cannot force myself to be this hopeful optimist anymore. I cannot stand it. I can't live with this torture anymore. After what happened recently, and how I was betrayed by a person who I fantasized for 3 years, the reason for my meaning in life, with the only friend that I had. I just cannot find it in myself to go on like before, and I have to break this cycle of expecting anything from anyone. To just live out the rest of this absurd life as peacefully as I can, even if it means wanting normalcy when I know its not within my reach, no matter how hard I try.\n\n"}, {"title": "Problem with authority figures (self.intj)", "likes": "4", "comments": "6", "content": "I assume you can relate. I’m aware that I have this problem, but I can’t figure out a way to fix it. I just can’t accept 90% percent of authority figures. It’s okay now, but the negative effects will most likely manifest later in my life which is why I really could use some advice on that.\n\n"}, {"title": "How do you organise your work?  (self.intj)", "likes": "4", "comments": "8", "content": "Hello fellow humans,\nI am looking for a tool where i can organize my work better.\nThis is how i currently organize my work.\nhttps://imgur.com/a/f42QcVI \nHow do you organize your work? \nAnd what tools do you use?\nLet me know in the comment section below.\n\n"}, {"title": "Are you long-term goal oriented, despite knowing the time is limited and future unforeseeable?  (self.intj)", "likes": "9", "comments": "16", "content": "The usual notion is that intj are very goal oriented and can block out many other distractions, finding an optimal route toward achieving the goal. \nI'm asking because for the past few years I was contemplating life and death, trying to see the big, big picture. Figure out what really matters and so on. This will probably sound like depression (I don't think it is) but I started to see all personal goals somewhat arbitrary, with the only tangible thing that can be reached being a coffin. \nSo I eased on the long-term planning quite a bit, as it seems kind of arbitrary. I'm still doing personal projects and researching things that interest me but I find it hard to dedicate to a distant goal, and wonder whether that's really the thing I want to spend my time with. I moved onto more small-ish, short-term (no longer than a few months, usually) projects. Still learning things for a clear purpose of achieving the goal, but no grand plans. Not gonna lie, not having a long-term goal for life is really disconcerting. I just can't come up with anything significant enough to be worth it. The idea of perfecting a skill/knowledge which ends up being a waste of time is a nightmare. \nLiving an efficient routine is very intj thing and I had that for years and years. But then noticed the fast pace at which time was passing by, that absolutely shocked me. And frightened me. So I try to learn more broadly about the world, instead. \nWhat do you think? How do you deal with the ultimate uncertainty? Or you avoid considering it? Or pursue a distant goal regardless?\n\n"}, {"title": "INTJ and Religion  (self.intj)", "likes": "5", "comments": "22", "content": "Hi folks. Here is the question.\nWhat is your opinion about your religion? Do you believe in it or you dislike it or live and let live?\nPlease tell us in which religion you are/used to be.\nI have done this On ISTJ su also and I found some agnostic atheists there. What do you think?\n\n"}, {"title": "What Personality type does INTJ not get along with?  (self.intj)", "likes": "19", "comments": "72", "content": "I am currently doing research on Myers Briggs personality type, I seek to find out if it is true that reciprocal of each personality type doesn't get along. Or am I wrong? I hope this made sense. FYI I am an ENTP.\n\n"}, {"title": "Can anyone relate?  (self.intj)", "likes": "4", "comments": "14", "content": "Maybe it's just me, but I have spent a lot of my life feeling like as an INTJ, I have a good grasp on both the attention-to-detail and the big-picture. It is for this reason, I have wanted to pursue a career as a criminologist. That is exactly what is needed in this field.\nFor some reason, though, I always feel like the people in charge and surrounding me in life are too short-sighted to see this trait in me.\nMaybe it's being a female INTJ, as I am so rare in the population? Or the bluntness with which I state my opinions? Maybe if I was just more \"femininine\", people would take me seriously?\nI have a degree and a personality suited to the position, but I can't even get hired on entry-level positions because when the hiring manager asks if I'm willing to defend my authority figure in all regards and situations, my natural response is \"it depends on the morality of the situation.\" That didn't go over well I guess.\nDoes anyone feel this way in their life?\n\n"}, {"title": "How to make an INTJ feel special and loved? Send Help..  (self.intj)", "likes": "17", "comments": "26", "content": "My boyfriend is an INTJ (I am an INTP anyway).\nGuys help I'm truly in \"LovE\" with him. No I mean I am serious. IN LOVE. so here's the question.. How to make him feel special, wanted, etc? What do most INTJs like to hear (compliments or anything else) ? How to show him my love? ? ?\nI want to and I'd like to try Something creative.\n(Ok so basically I'm asking how to flirt in the MOST PERFECT WAYY)\nNote: Nothing sexual.\n\n"}, {"title": "Personality Test Now Free!!! (self.intj)", "likes": "0", "comments": "2", "content": "Hi INFPs! I have posted here before and i'm honestly at a standstill with my test and need your guys' help! I have kind of gone through most Instagram influencers who have promoted it already and I need reddit now. The next 20 people that take my test can get results and analysis for how I came to type you along with a coaching call of pure value and no upsell all for free!!! The link to my Wordpress blog is below. There are many reviews on that site. The link to my test is on there. Message me if you are going to take it and message me when you finish it and I will get right to analyzing your results!\nhttps://tjmclaughlin2.wordpress.com\n\n"}, {"title": "I just did an assignment for my highschool regarding similiarities between CoronaVirus and Great Depression. Turns out the Stock Market Crash were experiencing now is in fact WORSE (self.intj)", "likes": "4", "comments": "9", "content": "Well shit, I guess now either America will die (yes, America DID almost die during the great depression) or we won't all be fucked - and I guess both of those options I like somewhat\n\n"}, {"title": "Any advice on starting small business?  (self.intj)", "likes": "3", "comments": "3", "content": "I'm planning to start but I'd like to hear your advice on it. What were the issues? How did you start? What did you start? What methods could help? \nI'm good at counting and predicting things but in general I haven't studied business yet. Sure thing I want to devolop it in the future, so It has to be flexible or It has to give opportunites to start something more beneficial.\nLet me know what you think.\n\n"}, {"title": "INTP and an INTJ (self.intj)", "likes": "7", "comments": "20", "content": "INTJ females, how'd you perceive an INTP male for a prospective relationship?\n\n"}, {"title": "Does anybody feel like this sub is rife with Autism?  (self.intj)", "likes": "23", "comments": "20", "content": "I'm an INTJ (according to that one source I guess we've all used) who is mildly autistic but I honestly only relate to about 40% of the content here. A lot of it frankly feels very generic and is applicable to most other types of people. A lot of the content feels more inline with people on the autistic spectrum then a particular type of person? I would like to know who here doesn't relate to most of the stuff on this sub? Who here is autistic? What other disorders do people suffer with? \nI personally am: \n\nMildly Austic\nMildly Dyslexic \nMildly Dyscalculic\n\n\n"}], [{"title": "What do you guys think of Elon Musk (Especially after recent controversy?)  (self.intj)", "likes": "7", "comments": "22", "content": "I think he's a dumb dumb\nBut for better or for worse, because he's an INTJ I can see the human side of him. I could see, if I became a Millionaire Capitalist and forgot to self-check, I might become him.\nI don't think he lies, which is why he seems so genuine. I think, much like an INTJ would, he literally convinces himself of untrue thing that benefit him.\nAnd it feels bad to criticize someone who seems genuine (Like, this is why its easier to criticize Jake Paul than the Odd1sOut) and it feels good to defend someone genuine.\nI think the thing that annoys me the most is literally one conversation with him and I could make him 90% more accurate, but that'll never happen.\nEdit: Y'know its funny. In only the past 2 days the majority of comments went from \"bruh, why you hating on Elon\" to \"Elon is actual Satin\" .\n\n"}, {"title": "Algorithm for MBTI Functions (self.intj)", "likes": "25", "comments": "10", "content": "I tried to create an algorithm to summarize the cognitive functions, and how the order affects how they are utilized.  Once the description was assigned to each function, it was super easy to make them interchangeable for each type, so if you'd like one for a different personality type, let me know.  I'd be interested to see if everyone finds it accurate. (This is a super-rough draft). \nIt's kind of cool to use it to analyze ourselves, others & also our relationships with others.  \nhttps://preview.redd.it/4h9pmc7gizv41.png?width=730&format=png&auto=webp&s=1409368f6de01d2f01c2abde3a6fc3efbc2a0241\n\n"}, {"title": "Hate it when helping a colleague results in unwanted small-talk  (self.intj)", "likes": "8", "comments": "4", "content": "Helped a colleague with a task, and not only was he being grateful, he was following up with an irritatingly long amount of small-talk. Granted my threshold is low: I struggle with anything beyond a minute of uninteresting blabber (I actually follow sports scores just to have something to say beyond the weather).\n\"You seriously helped me a lot! Thanks a lot! You have no idea how -blah blah blah- this saves me -blah blah blah- I can't believe that -blah blah blah- I didn't expect the task to be -blah blah blah-\" and so on and so forth.\nDon't get me wrong I value the guy as a coworker -after all I'm wasting my time helping him-, but sometimes I feel guilty to regret to have stepped up to help someone.\nEnd of rant.\n\n"}, {"title": "What type of content do you guys appreciate most?  (self.intj)", "likes": "13", "comments": "20", "content": "I want to make self-development content geared more towards you guys and ENTJs because I feel like you two types would be the most receptive to my introverted thinking. It would stimulate you and provide you with a helpful perspective moving forward.\nWith that said, I was wondering what sort of self-development knowledge you guys like best? Do you find any interest in learning about processes, how to approach experiencing reality, and how to take in data (ex. critical thinking)? I've been thinking of making videos geared towards thinking about reality differently, dividing the self into thoughts, sensory experiences, and emotions, and giving very brief 3 minute videos explaining summarized and researched self-help techniques through these 3 divisions, but framed through a sort of sci-fi reality-bending storyline.\nIn terms of how to make profit, I was thinking of making free e-books that are 10-pages long and then three short 30-100 ebooks to be sold. If you have any better ideas of how to tailor it better for you guys, I'm all ears!\n\n"}, {"title": "Tips for developing Te  (self.intj)", "likes": "4", "comments": "8", "content": "INFP here. I've been trying to apply my MBTI knowledge in a more practical way for self development. That said, I am specifically coming to to you for tips in how to develop my extraverted thinking function. So I'd appreciate your thoughts on this and would like to hear about your experiences using Te, so I can have an idea of what I should do to integrate it more in my daily life.\n\n"}, {"title": "What do you look for in a romantic partner?  (self.intj)", "likes": "7", "comments": "24", "content": "What are some principles and qualities you look for in a potential romantic partner?\n\n"}, {"title": "I'm embroiled in a dangerous relationship.. (self.intj)", "likes": "2", "comments": "14", "content": "It's dangerous because I have idealized the shit out of him. My intj bf doesn't know how much I fantasize about him in my head. Half the time I ignore the guy cause I wanna pretend I don't give a fuck, but deep inside I really do. I have a string of fanboys commenting and liking my pics but really I feel like I can only get horny for him for now..lame\nI'm worried if I lose him (ugh knock on wood) that I wouldn't meet someone like him again and that life is going to be dull. My fantasies can range from normal to x rated. Sad thing is I can't even tell him cause he's gonna think im crazy.\nI don't think he would be very affected if we broke up. Which is good for him, annoying for me.\nEnd of rant\n\n"}, {"title": "Confusing or normal texting behaviour? INTJ  (self.intj)", "likes": "6", "comments": "2", "content": "Female mid-twenties smitten with what I think is a male INTJ early thirties (very conscientious, plans ahead, very logical and scientific mathematician, very private, very loyal, poor small talk, insane capacities of concentration, creative,. ambitious, etc---from what I read about INTJ, many aspects apply).\nWe met last spring after I approached him. He had been checking me out for six months +, so I knew he liked me.  My first ever and very long-term relationship had ended a few weeks prior. I was still wounded and  thought nothing could hurt me thereafter, so I was quite assertive and confident. When we met  I told him straight away that I would be leaving in a month as my contract expired.\nWe then met up regularly for coffee breaks, lunch or dinner over a month, though I always felt left quite high and dry in between (not getting text for multiple days, then getting asked out quite last minute, which annoyed me, but did not faze me as I was in my nothing-can-hurt me state. Further I also attributed it to the VERY long hours, high pressure environment in his department. One evening he comes by and we drink a bit pf alcohol. He then opened up and told me I was beautiful and made his day better, that his past relationship was not quite resolved, and that he needed time (they were together for a year and had been broken up or on a break for a year at that point).  I've never seen a man more hurt, but I've also never met a more genuine and honest man. He just had the purest and most beautiful soul which revealed itself then, though he is always rather reserved and shy/private in public.  I also told him about my situation, and that he was too good for a rebound (which in my emotional post-break up confusion I thought I was looking for, but I am really not the type for that and have not been with anyone, or dated since). He said that he was confused (to the effect of between me and the other), and that we would stay in touch.\nWe have stayed in touch since, but it has all been initiated by myself and I do not know if he is really interested still, as it's been a year. We texted regularly for a month after I left, then met up in summer for lunch whilst being in the same city by coincidence and it was very natural but I was a bit pushy and he was still confused. We have been in different countries since last summer, and when I text him he will reply, usually with delays up to two weeks. \nHe does not initiate text, but he does reply (though no proper conversation has emerged...). He has however affirmed plans of meeting up or talking on the phone, but then cancelled. A month ago I suggested to call, immediate reply yes tomorrow, then cancelled on the day and shoots me a message of how he is bad with replies 10 days (!) later! (I was annoyed and replied to the effect of if you want to stay in touch let's do it properly and talk on the phone as I find text messages confusing, no reply to that of course).\nI am still very inexperienced with men and have not been with anyone since, however I do have male friends who are however quite different from him. When asking others for advice, some tell me to just let it go because he's clearly not interested. But why does he still reply then? We have been in different countries and he could just let it go or tell me he's no longer interested, which he has not. Then others tell me that people are different and that he is probably still confused and needs time.\nI can usually read people well, but not him and I have never met anyone like him. Nonetheless, and I cannot quite explain it, for some reason, I just feel sure about him. I had the feeling we could have a lot of fun and a happy, stable future. We also have the same values and he meets MANY criteria. This sounds very odd, but it is true, just as I felt that the few words he told me were more true than anything I ever heard from any other man. So I know he told me the truth. He is also extremely funny, more so than any other men I know, and whilst of course I still don't know him well I want the chance to get to know him even better. From his comments he definitely views commitment as forever and he wants stability. \nAm I just impatient, and he is still interested, or am I just oblivious to disinterest, but he is still too nice to say he's no longer interested?  Or is it just kept lukewarm because confusion is ongoing?\nAside from mentioning \"let's stay in touch better and talk on the phone\", I have not asked, because well, it's been a while and given the context I feel quite silly to be spending so much emotional energy on a hypothetical. Also, I didn't want to be emotionally pushy.\nI only read up on Myer-Briggs classifiers recently when I saw that the type description fit very well, so there may be a chance I can get some clarity from similar-minded individuals. That's why I'm posting here. \nWhat's the judgement of  the INTJ jury? Is the curious creature interested or not? Is it normal to take years to make emotional decisions? I am puzzled. \n(Yes, I am focusing on myself - finishing my masters, starting a long distance degree and doing my thing; it's said that dating is a numbers game, the purpose of which is also to gain clarity, and I've thought about it quite long and he or someone like him would be worth the wait. Before thinking about any other logistics, I just wish an assessment of interest level. However, after my last relationship I want to make sure the next attempt is with the right person, and for good, and he's definitely set a standard. According to the typology I'm an INFJ - which I think is accurate by around 70%).\nThank you in advance for your insights! It's been a year and it's been on my mind a lot so it should get resolved at some point!\n\n"}, {"title": "How do you spoilers(in regards to movies and stuff like that)?  (self.intj)", "likes": "3", "comments": "2", "content": "My Ni has spoiled stuff for other people without having definitive knowledge of what would happen.\nView Poll\n\n"}, {"title": "Something I asked long ago still kept occurring to me. Would you rather be in a world with false beauty or ugly truth?  (self.intj)", "likes": "8", "comments": "18", "content": "I asked this to a small amount of people and lately I’ve been trying to bring up world issues to see if maybe I can bring them to light to see if people care to change or do something about it. The algorithm fell when I tried to do so and many people were less attracted to my page. \nIrl situation, many people seem to care less about kindness and seem to twist themselves when they hear the truth. It’s unimaginable, I feel as tho I can’t be an honest person, because I observe people over and over again, they can’t handle the truth. I don’t like lying, but maybe I’ll say less. \nWhy are most people like this?\n\n"}, {"title": "Mental stagnation in quarantine (self.intj)", "likes": "8", "comments": "9", "content": "My question to you guys is, how are you staying mentally active during this time? What topics are you finding interesting?  Whether it be intellectual, a guilty pleasure, or anything in-between.\nI don't know why, but recently I have been feeling mentally stagnant in quarantine (as the title says). I am still very lucky and have my job which keeps me occupied during the week, but I feel as though when not working my mind is becoming increasingly less active (which I hate). When I do sit and think and philosophize, recently the topics have been leaning towards more negative aspects of the world and actions that I regret doing in the past, or making negative connections between things happening now. \nI have dealt with depression in the past so I know that these are very bad roads for me to follow. I would love for suggestions as to topics you all enjoy, and areas of interest you all have found. I want to expand my knowledge and hopefully divert myself from these negative paths.\nThank you all,\nA fellow INTJ\n\n"}, {"title": "Are intjs the salt of the earth? (self.intj)", "likes": "0", "comments": "16", "content": "Guys, try this for me please. Doesn't take long. \nGoogle what limbal rings are and then go look in a mirror. I did this and had no ring when I started. For some reason I started judging myself mentally. As I was telling myself that I was a horrible person, limbal rings started to appear around my eyes. I kept going, more horrible thoughts, limbal started getting darker. The second I started praising myself and everything I like about me, they started disappearing. \nDoes this happen with all of us? Mind... Blown...\n\n"}, {"title": "What describe you(intj) more?  (self.intj)", "likes": "3", "comments": "18", "content": "Well, I maybe have autism, but whatever.\nView Poll\n\n"}, {"title": "Do many INTJ people suffer this ongoing mental and emotional exhaustion? Or just me? (self.intj)", "likes": "270", "comments": "148", "content": "\nYou are easily irritated.\nYou are getting affected by the smallest of things lately. You find negativity all around you and any minute negativity irritates you. You lose your temper easily. As days go by, you feel hopeless. The inability and the lack of power make you feel more and more irritated. Unfortunately, this can mean you take your frustrations out on those closest to you – those who probably don’t deserve it.  \nYou are always feeling low and lack motivation in your life.\nYou always feel that something bad is going to happen. You have lost faith in life and there’s nothing that can motivate you to move on. You feel like you’re incapable of getting the work done. You struggle to find the motivation you need. The goals that once stimulated you to work hard are not enough. This is especially difficult to contend with when you’re at the workplace or school since there are inevitably due dates for various tasks or assignments. But if you are not motivated to get to those tasks, you won’t get them done on time… so they’ll accumulate, which will make you procrastinate more. This can result in you failing classes or getting warnings at work. But if you’re feeling numb, you really won’t care much about that, will you?  \nYou experience fits of anxiety quite often.\nAs a result of your over-exhaustion, you feel more and more stressed than usual. Anxiety attacks are becoming a daily routine. You get worried unnecessarily. You are anxious at the slightest of things.  \nYou can’t sleep properly.\nYou often feel like you are out of the place. The overwhelming feeling of exhaustion makes it harder for you to calm your thoughts and fall asleep. And insomnia becomes just another thing on the list. You are so very, very tired, all the time, and all you want to do is sleep, but you can’t. Why? Because your thoughts are racing at top speed and you can’t break the loop. Just as you start to drift off, some worry will intrude and knock you back into wakefulness, so you can’t get that much-needed rest… which compounds the fatigue that’s already draining you dry.  \nYou sense a kind of detachment.\nYou don’t feel you’ve attached to anyone or anything anymore. Nothing affects you. You don’t feel good or bad. It’s like you are just a body without any emotion. You’ve gone numb. Whatever it is that you’re dealing with has drained your light to the point where you literally can’t feel the emotions you’d normally feel when you encounter a situation or subject. This is sort of like depression, only instead of feeling weighed down by emotion, you’re weighed down by the absence thereof.  \nYou cry or feel like crying for no reason at all.\nIf you’re at the point where having toothpaste fall off your toothbrush first thing in the morning is enough to bring you to a bout of hysterical weeping…that’s not good at all. When we’re exhausted both physically and mentally, we pretty much lose the strength to cope with challenging situations, and regular day-to-day stress is intensified. It’s totally understandable that you’ve probably found yourself crying in front of colleagues, friends, or even random strangers. \nYou feel dizzy and nauseous.\nA feeling of nausea and dizziness are signs that you need rest and it should be your primary priority. These things happen because you are so stressed out that your body can’t take it anymore and is suffering a break-down. Whenever a person experiences a mental breakdown, this naturally manifests physically as well. This is especially true if you’re the sort of person who carries stress in your belly, or if you clench your muscles subconsciously to brace against whatever is hurting you.  \nYou’re constantly tired.\nFatigue is something different from just regular tiredness. We can be exhausted after a few days’ worths of partying, but that kind of exhaustion can be remedied with a couple of nights’ worth of decent sleep. Fatigue can’t. When you’re suffering from fatigue, it doesn’t matter if you sleep 20 hours a day or drink 30 coffees in the span of a few hours: you will still be tired to the very marrow in your bones. This isn’t just an occasional thing. This level of energy is your default setting right now. It just never seems to end.\n\n​\nI saw this posted today elsewhere and it really hit home. Wondering if it's just me or a shared INTJ trait to fall into this category.  I have had it for most of my life.\n\n"}, {"title": "Are you guys ever interested in topics that show you how to make sense of reality, your own human processor, how to process data efficiently, and how to take action with that awareness?  (self.intj)", "likes": "30", "comments": "15", "content": "Does that sort of thing interest you at all?\n\n"}, {"title": "What type of learning style do you learn best?  (self.intj)", "likes": "4", "comments": "14", "content": "For me I cannot read a book and immediately apply the knowledge for my life. I need to get hands on and be doing the project/skill/activity to actually learn and get a solid feel.  So this would be Physical or Kinesthetic learning. Also i excel better visually and possibly solitary. I’m interested in your learning style, especially from y’all, thanks. \nVisual (Spatial) \nAural (Auditory-Musical) \nVerbal (Linguistic) \nPhysical (Kinesthetic) \nLogical (Mathematical) \nSocial (Interpersonal) \nSolitary (Intrapersonal)\n\n"}, {"title": "How would you build your Fantasy World ?  (self.intj)", "likes": "5", "comments": "4", "content": "The world in question needs to be in medieval time, supernatural phenomenon is accepted. \nHere are some questions to help you get started but you can add anything you want:\nWhat is the reign/authority like in your world? \nWhat is the social scale there ? \nWhat are the rules and the punishments for breaking them ? \nWhat is the weather and vegetation like ?\nWhat are the customs and traditions there ? For example what is the salutation like ? \nHow is the relationship with the neighbouring countries/kingdoms? Are there wars, threats, alliances? \nHow is the state of the people ? Who is rich/powerful in your world ? \nWhat is the primary source of income in this world ? \nWhat are the transport means ? \nHow far is the knowledge/science ? \nWhat are the challenges the people need to overcome ? \nWhat makes this world special ? What makes it different from our world?\nWhat is the geography of your world ?\nWhat is considered to be good/evil in your world ? What is socially unacceptable ?\n\n"}, {"title": "If you could change your MBTI type, which type would you choose (even of like being an INTJ)  (self.intj)", "likes": "9", "comments": "33", "content": "I would personally choose ENTJ because this type is the most productive, dominating type and society is dominated by Extroverts\n\n"}, {"title": "ENTP-INTJ crush is better now. Part II (self.intj)", "likes": "6", "comments": "11", "content": "About a month ago I made a post talking about my crush INTJ, and I appreciate a lot of the advice I received as it helped me give her a lot of space and put focus on doing more things in the time I wasn't talking to her.\nYesterday I decided to talk to her again after a week in which we didn't exchange more than two messages, and the conversation went great, we talked for quite a few hours.\nI started asking her how she was, and she told me all the things she did in a pretty descriptive way and I also did the same thing.  \nI asked her if she had the time to talk about an idea I was having at the moment (as a good ENTP I always like to talk and discuss unconventional topics). And her answer was: Talk as much as you need, and then we got it all together.\nI started to talk a lot, and she seemed interested in everything even though she didn't make many comments about it. I told her a few things about myself so she could get to know me better, and she was surprised by one of the things I told about. I also asked her questions to get to know her better.\nBut at one point I noticed that she didn't ask any questions, she just read everything I told her, I made the comment that why she wasn't curious to ask me about something. Her answer was: The truth is that I can't think of anything to ask you, and we continued talking for a while, with me leading the conversation while she answered lengthy texts to some of my questions.\nMy doubt now is, what does it mean if an INTJ doesn't know what to ask or say to you? I thought you guys were really curious, but she just lets me talk and is actually interested in what I say. Could it be that she likes me and she finds it hard to have a conversation or she just doesn't have interest in me and she's just being polite?\nThanks for reading.\n\n"}, {"title": "How to develop Ni?  (self.intj)", "likes": "9", "comments": "10", "content": "Hey guys. I am a young, immature ENTJ. I wanted to develop my Ni, and figured I should learn from the masters, so here I am. How do I improve it?\n\n"}, {"title": "Don’t you just hate videocalls?  (self.intj)", "likes": "80", "comments": "37", "content": "During this quarantine some people asked to videocall them. And I just can’t take it, because I hate normal phone calls to begin with, but having to awkwardly look at the camera and at the screen while talking is just awful.\nI don’t know what it is about them, but I just cannot look at a person directly while talking for extended periods of time. In real life you don’t usually notice it, but video calls kind of force you to do so. Share your opinions below, please.\n\n"}, {"title": "How to handle multiple perspectives?  (self.intj)", "likes": "4", "comments": "20", "content": "I think having the ability to see things from multiple perspectives can be an asset but there are times where I'm just overwhelmed by seeing things from different angles.\nI'm a 23F architect and a forex trader, so this is usually my thinking process:\n\nI'm always looking for better concepts, ideas, skills and mentalities\nthen I translate those new thoughts to align with my current personality and thinking\nwith the aim of refining how my brain works and its content as well\nso that I could produce better solutions to the work/life problems\n\nOver the years of refining my ideas, solutions, etc., I've been with a lot of mentors and I've gained a lot of infos and perspectives from different sources. \nI have no problem in understanding new concepts continuously.\nBut right now, since multiple perspectives are compiling as I grow older, I'm having trouble on deciding which perspective/solutions to use in my current projects or dilemmas in life.\nIt's like the more I see the different angles of a problem, the more I see different solutions. \nSo I'm left with a lot of solutions / approaches to a single problem in a complex problem. \nI think having the ability to see things from multiple perspectives can be an asset but there are times where I'm just overwhelmed by seeing things from different angles.\nI've explored different extremities in life (eg. becoming very aggressive then very patient, doing hard work then smart work, having a very complex lense then a simple lense to view a problem) and right now I'm confused of which tools to use, the ratio between the dualities and the overall balance.\nOne concrete example: \n\nThe big 'problem' is the forex/stock market itself\nThe small problem is when to enter the trade\n'Solutions' can come from multiple perspectives like technical analysis, fundamental analysis, sentimental, and even from an astronomical point of view.\nI can understand each perspective fully, but I can't seem to create a coherent solution/approach to the big problem from the multiple perspectives. What more if I put my own personality and thinking to the mix.\n\nI'm fairly new to reddit so I'm sorry if this is vague and I'm not sure if I expressed it clearly.\nThanks in advance for the insights.\nEdited the whole thing since the previous version is so vague :)\n\n"}, {"title": "How to conqueror the world  (self.intj)", "likes": "2", "comments": "6", "content": "So guys hear me out I believe the country to be able to militaristic control or occupy space(space traffic, shutting down Satellites, gaining resources on foreign planets) will be the only country at the time to be able to control the world\n\n"}, {"title": "INTJs don't accept authority but surely clueless bosses are even worse than the strict ones?  (self.intj)", "likes": "5", "comments": "9", "content": "Hello, this is my first post on Reddit. I decided to write it here because I feel like I've been conflicting myself. I don't like strict rules but dear me, if there's a boss who's always angry like Gordon Ramsay but knows what He's doing, I would gladly switch my current job.\nA bit of background story if you want a concrete example:\nI'm an INTJ. 25 years old. I have been working as a Programmer for almost 5 yeas now. I work in a very small team where everything isn't organized and the \"vision\" and \"targets\" my boss told me are never clear. Each one of team member was told to finish specific projects at the start of the year but every time it doesn't work out it's always the same old \"Well, next year it is then\" \"Well, next year maybe We will outsource it because We're not capable\" \"Well, just laugh it off\" etc etc.\nIt is a bit ridiculous when your boss already set a limit on what you can do and judge you as an average person, so that if things are failing, We're just bad at it. Effectively preventing us to be better at our jobs, to grow and turning us into a SINGLE point of failure when things go wrong. What does my head in is that, it's not because We're not capable of finishing the projects (hint: We're paid as Programmers) but the boss rarely manage the projects and it's all down to us. The programmers have so much type of work that often get mixed up together, slowing the whole project down\nOften times He would start a Project and do the intro and the intro ONLY. He would invite people for a meeting, say a few words at the start and that's it, after that He walks outside of the room while answering Phone calls from his wife. Then He will often miss the next meetings due to reasons god knows what.\nThen the entire business process analysis, negotiation, time line creation, designs, coding, testing and user followups are done by ONE person only and that person is a fricking Programmer (written in the Job Desc) that often has very little say in Project Management. This boss is literally the complete opposite of the strict ones because He lets you do whatever it is that you want and theoretically, it should fit INTJ. But I feel like having one like this is much worse because after all You only have two hands and one head.\nHe's always playing it safe, if you tell him about newer things We could try to improve the process, He will go \"Umm ok, we will try it next year, You will try it, not me\" and by next year He will repeat the same thing. I often find myself with a lot of type of tasks to do such as sending email to the users, testing bugs, fixing it, coding new functions, designing with Photoshop, answering phone calls and even adjusting my own targets as if I don't have a boss... It's madness. I've become much more of a grumpy person due to this.\nWhat say You?\n\n"}], [{"title": "Are any of you guys an INTJ twin? If yes, what is your twin's type?  (self.intj)", "likes": "115", "comments": "62", "content": "Hey! I am an INTJ with a twin who is an ENFP. Our relationship is occasionally a push pull (bc I am very independent and she is very in need of attention and love) but we have grown so much individually because of our differences.\nShe taught me to empathize, listen, support people in the way they need to be supported, check in with friends far away, and generally to be a better person to myself and others. I taught her to stand up for herself, to trust her own intelligence, and to occasionally try to block out the social cues she is getting espec when they are negative vibes (it affects her wayyyy more than most people).\nShe takes things personally, but I think it's bc her \"sixth sense\" for people's thoughts/feelings and her emotional intelligence can make her self-conscious or feel defensive/embarrassed. I am totally oblivious to stuff like that and it weirdly makes me more confident (although I am the introvert and she the extrovert). I want her to get to that point too! I think I used to have a tendency to let my arrogance affect the way we talked to each other & the merit I would put into things she would tell me. Obviously now that I am older I regret that. She is the absolute best person - so thoughtful, endlessly caring, and FULL of love for her people.\nShe is a total empath and I am a bit of a depressive personality, so I want to make sure I am uplifting her, not bringing her down, and that she has others to connect the way she needs to. :) Any tips on helping to support her are appreciated. \nTL;DR: I'm an INTJ w an ENFP twin, she is the reason I am at all emotionally competent. \nSo twins - what are your types and how do you think that they affect your relationship?\n[edit:] if you want to answer this also, are you identical or fraternal?\n\n"}, {"title": "Using music to process anger. Relatable? (self.intj)", "likes": "104", "comments": "26", "content": "I have always questioned why my music taste veers towards the rock and alternative worlds- particularly the heavy, the angsty, and the subversive. I connected this idea with my tendency to repress my own emotions of anger (especially in relation to trauma) and noticed that it seems like music is one of the few places in my life I allow anger to live. How do you feel about your connection to music and emotion?\n\n"}, {"title": "Does anyone else keep themselves busy in order to suppress their emotions?  (self.intj)", "likes": "107", "comments": "22", "content": "I recently found out that whenever things don't work out my way or someone I trust hurt me, I always bury myself in my books. I hide all the clocks of my room and work for hours without any human interaction. I've been doing this for years. I mean forget about understanding other people's emotions I don't even understand mine. My brain always goes into the run-away-from-your-emotions mode. I just do anything to suppress them, to forget whatever I was feeling. It's weird. But aren't we all?\n\n"}, {"title": "The perks of being an INTJ  (self.intj)", "likes": "60", "comments": "31", "content": "1. THE GOOD ONES\n\nYou don’t keep a lot of expectations from other people.\nYou don’t feel disappointed when people don’t keep up their promises(maybe a little but you move on quickly).\nPeople can’t hurt you emotionally(biggest advantage I guess).\nYou learn a lot by yourself.\nYou actually enjoy solitude.\nYou can solve complex problems because you actually use your brain logically rather than emotionally.\n\n​\n2. THE BAD ONES\n\nYou don’t have a lot of friends for support(because you are your own pillar of strength). But it feels good to have friends around sometimes.\nYou feel rather awkward in social situations like parties and get togethers and act like an object out of place because you haven’t had a lot of social interactions lately(just because you don’t like it).\nPeople think you might be a wierdo because you don’t express a lot of facial emotions in situations which demand it(like when you are the topper of your class and people come to congratulate you and you don’t put on a smile and just shake their hands and say ‘thank you’ and people go around telling others that you’re egoistic).\n\n\n"}, {"title": "Is constant career change a known INTJ trait? (self.intj)", "likes": "20", "comments": "50", "content": "Hi, I'll preface this by saying that it's late and I've had a few glasses of wine - so please excuse the typos and poor grammar.\nI'm an INTJ-T male in my late 30s and I'm on my 4th career now, and I was wondering if constant career change is a common theme amongst INTJs?\nSome history on me...\n\n5 years - Left school at 16 and went straight into an engineering apprenticeship (instrumentation, process logic controllers etc) - I had to seek paid work due my dad being forced into redundancy, but I wanted to maintain some form of education. \n4 years - Self taught traditional sign writing and manufacturing (after dabbling with CAD design during my engineering apprenticeship and converting a broken X-Y plotter into a drag knife/vinyl sign cutter and building a small business from it) \n10 years - I had a very successful stint as a graphic designer from the design skills I acquired whilst working as a sign maker (I worked at senior level, covering print/repro, video, conceptual, branding, digital, animation etc etc - a few in house agency roles and freelancing around London supporting marketing departments for some big companies)\nRoughly 5 years ago through to today - my role evolved into digital bias, I self taught digital marketing and web design (I've taken more online courses than I can list here), I now work as Head of eCommerce and I support  4 other clients around my day job as a Digital Consultant (building eCommerce websites - I mainly specialise in full spectrum digital audits and generating growth strategy covering all aspects of growing business online - Lead generation, Content gap analysis, technical SEO, CRO, user experience, Social, PPC, Email etc etc - my design experience always helps here).\n\nI know I sound like a Jack of All Trades, but as I'm INTJ I literally spend all of my time researching and trying improve on what I did before - so I feel I have a better grasp of the industry I am in than most give me credit for. Plus my track record is pretty crazy, for example my main day job has experienced 66% YoY growth from a previous 8% trajectory for their eCommerce sales (not to mentioned 680% increase in direct leads) - pretty much the same story with my freelance clients too, all from a wide range of industries - eg,my regular clients include an aircraft parts manufacturer, antique dealer, corporate HR firm and a coffee house.\nIt's like I'm stuck in a continuous self-improvement loop (which I think is the turbulent nature of my personality - always self analyzing) and if a career doesn't fulfill my need to learn and develop both my creativity and my logical/strategic side, I move on. Also, I've had employers take liberties on my work ethic in the past, and just pile on more and more responsibilities and constantly move KPI goal posts with no additional support or remuneration (which is actually the situation I am in currently). \nBeing INTJ, my career has always been hampered by my social inadequacies - I don't do traditions,  I'm shit at thinking on the fly and I can come across a bit flat, I also have a nasty habit of under selling myself (ie when talking about my work I will hyper focus on what I could have done better rather than focusing on what I've achieved - I am working on this though). During meetings I appear as disengaged - which is never the case, as I like to think before I speak.\nIt frustrates me that my apparent lack of enthusiasm is in complete contrast with how fascinated I am by the industry I am in, and I spend every spare moment outside of work and family time researching - my idea of a good evening is watching a 3 hour long tutorial on building out a marketing funnel and then being so enthused that I end up spending a further 3 hours building it myself (queue going to bed at 3am, waking up for work at 7am - this happens at least once a week).\nAnyway, I'm rambling now - I just wanted to see if there are any others out there as weird as me, and with a similar back story?\n\n"}, {"title": "Ever had the one that got away?  (self.intj)", "likes": "20", "comments": "10", "content": "Have you ever had that special person that isnt in your life anymore. What made them special and what is it that you are missing in your relationship right now in comparison to the partner that got away?\n\n"}, {"title": "Focusing Ambition as INTJ  (self.intj)", "likes": "18", "comments": "17", "content": "First time posting here, but thought some advice from like minded people may help me get out of a rut I’m currently in. \nI’ve always been extremely ambitious and driven towards building / being something great. I always had a project or a huge goal I was working towards and I very much defined myself by whatever that project was. \nAs I’m getting older, none of the projects pan out to anything I consider worthwhile. It’s just not good enough and I’m starting to lose faith in my plans. \nI’m finding I’m having a harder time getting invested in things. I’m really struggling to focus in on one area as well. I have a million ideas and a million hobbies, but I can’t commit to anything enough to build real expertise. \nI feel like I’m spinning my wheels trying to feed my ambition but not having anything to work towards due to my crippling lack of focus. \nDoes anyone else struggle like this? Have you found a way to either kill the ambition or push through the pain and keep moving towards something?\n\n"}, {"title": "Is this the right sub for me? (self.intj)", "likes": "14", "comments": "12", "content": "I took three MBTI tests and got INTJ on all of them. My profile really resonated with me and it was a revelation - like I wasn't special or unique and it somehow validated my attitude to life.\nBut I don't really feel like I fit in on this sub. Maybe the posts on here represent the extremes of the type or something?\nI am not extremely introverted, extremely intuitive or extremely judging. I came out high on thinking but I can be very emotional at times too.\nIn my 20s I was probably a bit more arrogant and I would have been more extreme in my scores which I suppose represents type development. Might that be an explanation based on the demographics of the sub? \nWhat do y'all think?\n\n"}, {"title": "How to stop jumping to bad conclusions?  (self.intj)", "likes": "12", "comments": "13", "content": "Hey guys,\nToday I took a chance by acting as if I knew something I was actually hesitant about. When questioned about my thinking, I realized it was all insanely illogical, but it was too late. I had decided to connect the dots with very little information and had jumped to a theory that was hurtful for the other person. He debunked my pity-full argument in a matter of seconds. It really took a blow on my thought process, and I’m now questioning at what point it’s flawed. I’ve rarely had anyone to try and prove me wrong fact by fact before. I still always try to not mention things I’m not certain, or at least follow them with a disclaimer. But this time it really hit me hard. I’ve been lucky to get away with a lot and not have to prove my reasoning sometimes. Do you have any tips on how to stop jumping to conclusions or judging others when very little information is known?\n\n"}, {"title": "ENTP needs help with an INTJ  (self.intj)", "likes": "11", "comments": "24", "content": "Hello guys, sry for coming into your world but I need some of your precious knowledge ^ , I'll try to not write an essay. Ok so I met an INTJ and we've been speaking for 2 months now but I think like she loses interest for me and I don't know why. When we started talking she was really interested and always down to share memes and music with me and we also made a lot of plans she was really funny and was really motivated to see me but because of the quarantine we couldn't see each other's but we used to text like everyday.\nThen she suddenly just change, she became more distant her text was shorter and the texting frequency wasn't the same than before. \nI asked her to be honest and tell me if this is a problem with me and if she still wanna meet me after the quarantine, she told me that I'm not the problem but she's no longer ready to have new people in her life for now and quarantine is messing with her mind.\nI really don't know what I should do because at first we really had a super connection and I'm still interested, do you have any advices to conquer her frozen heart?\nOh crap I did write an essay but you guys enjoy reading haha.\n\n"}, {"title": "To what extent are INTJs created due to culture?  (self.intj)", "likes": "9", "comments": "10", "content": "I'm asking if the characteristics associated with the INTJ personality are present when one enters the world just based on how one's brain is wired or if they develop over time due to circumstances. Maybe there isn't an answer to this but I'd still appreciate some perspectives :)\nPersonally, I feel like if I grew up in a family that only emphasized cheerleading and popularity for example, I'd be a completely different person with different approaches to problem solving, emotions, alone time, socializing, etc. But at the same time, the core of my identity is my logical and analytical approach to life so I wonder if this would prevail over my hypothetical family's values. \nThis can really go for any personality type but I'm INTJ so I'm posting here (also the answer could potentially differ between personalities).\n\n"}, {"title": "People dislike me and I'm starting to worry (self.intj)", "likes": "8", "comments": "8", "content": "About a year ago I realized no one really likes me, and not in a self-pity way, after a pretty harsh series of unfortunate events I was staring at the ceiling at night, just trying to think objectively about what had happened in my life since my late teenage years and I couldn't help but come to the conclusion that nobody has ever liked me or found me worthy enough to keep in their lives. \nI would like to believe that I just had bad friends but it is something that has happened to me since I was a kid and was always left out, in all the circles of life, including my family: nobody likes me. \nOf course I have gone to therapy and thought about it enough to identify why people dislike me or why I cannot be loved. I lost my fear of going places by myself and tried to focus on getting my things done without disturbing anyone. I'm still trying to convince myself it will be for the greater good, that somehow, this situation will get me some superior knowledge I may not access otherwise. \nBut I simply can't help but think something's missing in me. Everyday I think about some terrible things that were done to me in the last 6 years and that I certainly did not deserve. I'm not saying I am all good and nice, of course I've hurt many people as well (just like everybody does), but it just sickens me how some people I have met who are just pure evil have people who loves them while I am just discarded by everyone I meet. \nI also know nobody has the duty to love me, they'd just do (or don't in this case). That's alright, and I don't think they should or that they're bad just because they don't. But even knowing that, I am not happy, not even calmed. \nMaybe, I just think about it too much. Is this just a phase? I'm 23 and I'm very tired of it.\n\n"}, {"title": "INTJs and connecting with people  (self.intj)", "likes": "7", "comments": "7", "content": "I'm not sure if anybody can relate, but I rarely feel connected to people. \nMost of the people I meet I just don't feel any connection with. \nFor example when I was starting out in high school I was told I can make friends by joining clubs that align with my interests, so I did. I joined the Pokemon club as a freshman but didn't make any friends in my time there, despite being super into competitive battles at the time (and winning the tournament we held that year). Unless it was Pokemon being discussed, I just wasn't interested in talking to any of the other kids. If they were all bullshitting I just pulled out my 3DS and tuned it all out because it didn't interest me, which in retrospect I realise probably came off as rude. \nBut all my life really I've rarely felt a connection to other people. But when I do feel connected to another person on that rare occasion, I know it right away and I just become super happy and fiercely loyal to my person. And when I meet my person I don't have very much interest in meeting any more friends. Right now I have this connection with my boyfriend, and like I said I knew right away way before we started dating we had something. Maybe it's an Ni thing, I have no idea. My boyfriend is an INTP though and I know there is a synergy between those two types. \nIs anybody else like this when it comes to connecting with others where you just know if you will or will not get along with somebody upon meeting them? And most of the time you don't feel anything so you therefore just have no desire to really talk to them? But when you meet somebody you do connect with, you know it right away and eventually have this inseparable bond with them?\nThis has been me my entire life, even as a kid. I wonder if this is something common with INTJs.\n\n"}, {"title": "INTP Here. Want To Know How To Forge Better  s With INTJs  (self.intj)", "likes": "7", "comments": "5", "content": "Ok so I'm trying not to write an essay or go on a traditional INTP tangent, but I need some advice/guidance. I  really don't know why INTJs and INTPs are so magnetically drawn to each other but the notion is no less true in my situation. I've had an INTJ friend for years now that I have lots of fun around but I still feel the friendship lacks something. While I enjoy my friends ability as an INTJ to keep up with my constant over the top analysis and theorizing, I feel as though we only really get to have a fun time when discussing or debating a range of topics that we share interests in. The thing is I know that he is going though some stuff and I really want to help out, but I'm completely clueless as an introvert as to how I'm supposed to reach out, the fact that my friend is also introverted makes me even more apprehensive on the notion of reaching out to him. I have another INTJ friend who honestly is the only reason that I'm not behind in all my classes now. It helps out so much to to study with her, and it doesn't feel like a chore because I get to have fun with her. Because I'm so unintentionally nosy, I know that she also is going through quite a rough time, and it looks as though her dad might to be still here this time next year. I don't want to force myself onto them cause I know I personally would hate that, but I just want to break the INTP stereotype for once and be someone who can offer their support.\n\n"}, {"title": "Dealing with the finity of relationships  (self.intj)", "likes": "6", "comments": "4", "content": "I noticed that I put very much weight into my personal relationships in the past \nI don't know if it's me or them but atm I don't feel like they can always be there.\nIs this the start of the decline of my social network?\n\n"}, {"title": "I absolutely despise group projects (self.intj)", "likes": "5", "comments": "4", "content": "And not in a clichèd “ew people I’m an iNtRoVeRt” (can you tell I hate this stereotype?) way. \nI hate working in groups because anyone who takes charge that isn’t me has the risk of being incompetent (and often is, at least in some regard). Not that I’m perfect, but I at least like to have some say in decisions that are made. I’m very take-charge and assertive (I come across as ENTJ to some) and do not like to be led, especially when I feel that the person leading is not doing things the best way possible.\nProbably just needed to vent but someone in a group I’m in right now arbitrarily took out paragraph on a very specific and technical science procedure that I stayed up until 7am writing. Their reason? The paper was “too long”. Naturally, they kept their poorly-worded paragraph. And don’t get me started on the amount of spelling and grammar issues I had to correct on this paper before. Oh yeah, and they didn’t know how to cite sources properly.\nWe’re going into our senior year of university...\n\n"}, {"title": "A common INTJ fear  (self.intj)", "likes": "5", "comments": "2", "content": "one of my most reoccurring dream or it would be rather adequate to say nightmare, is that i am either taking or shouting and no one can hear me or that everyone is ignoring me, in my waking life i tend to have a prediction of how things would go wrong and i try to bring it to everyone's attention but most of the time i end up being ignored, now at this point i got used to it and not to deny the fact that it bothers me but i just got used to it, but after all it tends to scare me from time to time, how do you deal with that type of fear?\n\n"}, {"title": "Books. (self.intj)", "likes": "4", "comments": "8", "content": "Need recommendations on books.\n\n"}, {"title": "What should you do if someone tries to convince you that something is not true knowing that believing it is true will hurt you in the long run? Kind of like some type of conspiracy theorist that points out pseudo-logical proof that your parents don't like you to the point that the sense he makes...  (self.intj)", "likes": "5", "comments": "8", "content": "... starts feeling creepy and true.\nIt's some kind of manipulator. I've experienced alot of them in my life. They're like they make so much sense in what they're saying that you just don't know if you've been living a life of ignorant bliss.... especially me... I love searching for the truth and the last thing I want to be called is a delusional.\n\n"}, {"title": "Have intjs internally and involuntarily sacrificed their presence of mind for focused thinking (self.intj)", "likes": "5", "comments": "2", "content": "The title is quite self explanatory imo. I have never been one to doubt my intelligence, However the past few years being in one of the best engineering universities of my country I can't help but feel incomplete and imperfect. Unsurprisingly a large strata of our University students are N types especially NT types and having gotten the opportunity to see them live in action in projects has gotten me insecure. Although hard for me to come to terms with I have observed that I have the least talent in quick/ presence of mind thinking style. I have found these people to be brimming with new (albeit sometimes uncooked and infeasible) ideas. I have also found that I am the least creative types out of the NTs.. and I hate it. If any one could shed some light on my situation or share their experience about this. I would be greatful.\nP.s Just a heads up that I am always the main guy for planning and indepth research work in our projects and hence understand that I am uniquely gifted. But just that I find areas where I am lacking a lot\n\n"}, {"title": "Is there something wrong with me? (self.intj)", "likes": "5", "comments": "3", "content": "​\nBefore I start, I want to apologize for grammar, English is not my first nor second language.\nIm an INTJ female, 15 and i really won a bingo. My both parents are SJ´s and sister has an ENFP personality, which is something i think no NT deserves.\nMy father keeps controling me, and doesnt accept my point of view. When Im not good enough for his standarts, he takes it as his personal failure and i have to be punished.\nMy mother is the most touchy-feely person I ever known. She wants to hug and kiss and want to know what happended to me. Why am i quiet. If am i angry at her. When I am not , why I am frowning when I walk by street.\nMy sister is the sun. Always shining, smiling happy 14, who doesnt care about anything. She keeps talking and talking and going out with friends and i really love her.\nAt least I hope I do.\nBecause we really struggles about everything, literally every day. They dont understant that i like to be in my room, alone and reading books. That I love my piano more than doing small-talk with them. That i hate that stupid romcoms theyre watching in evenings and that i sucks in social interaction. And that i really dont need more friends.\nWe have an arguments, on daily basis, and I am so exhausted.\nMy mom always cries, she is telling me I am not normal, that she dont deserve me and that nobody was ever that evil at her than i am. That nobody has ever hurt her like i do.\nShe is telling me I am autistic, because i dont like hugging her.\nOnce i almost started to hyperventilating and she called me a freak.\nAnd its repeating again and again.\nJust because i didnt cry at grandmother´s funeral. Just because I act like nothing happened after our disagreement.\nJust because when she asks if i know that they love me and then asks if i love her back, i can not say yes.\nJust because when mother of her friend died, i ask what she died of and said that that’s what people do sometimes. Die I mean. I suposse i should be sorry for her or something?\nAnd thats why im so scared. I know i have feelings, because every their word hurts me and sometimes i cry in good book when nobody is around me and theres places in the world i like but when i see her crying, i dont feel anything. Im not sad, angry, happy just tired.\nAnd when i see a baby in the street, which fell on the ground and cry, im just annoyed.\nIm scared, because i dont want to die alone, because it feels like some people are not meant to be loved, when thay cant love you back.\nBut it feels like theres nothing i can do with that either.\nI think theres something wrong with me and the worst is that i dont mind.\nThree days ago, we had a scary episode in which end my father told me he will contact a psychologist.\nAnd i realized, that theres nothing i can lost.\nBut when i talked to my mother yesterday morning she told me that if somebody of our family would needed a psychologist, they would contact him before.\nBut i actually realy liked that idea of talking to someone, even if i am not good at it and even writing this feel little wierd.\nBut i just want to be happy in my own way and live my own dreams and i know, that until i will live like this with my parents, i will just feel like i am broken.\nAnd thats all my fault.\nJust somebody tell me, what to do. Please. Should I contact a psychologist on my own?\n\n"}, {"title": "Intj here, how do you guys cope with super annoying people?  (self.intj)", "likes": "4", "comments": "7", "content": "My family is driving me crazy, need ways to cope. Plz respond\n\n"}, {"title": "INTJ or INTP ? (self.intj)", "likes": "4", "comments": "7", "content": "After doing some study about the primary cognitive functions I always relate my self to both TI and Ni\nThere is some way of discern which one i’m ?\n\n"}, {"title": "How do you use your cognitive functions at work?  (self.intj)", "likes": "4", "comments": "6", "content": "How do Ni, Te, Fi, and Se make you great at what you do?\n\n"}, {"title": "Dear INTJ’s  (self.intj)", "likes": "4", "comments": "11", "content": "What music do you enjoy listening? \nAs for me (INTJ as well), I do enjoy from classical music, indie (kinda) lo-fi beats; to rock (but not too ‘heavy’, more like imagine dragons and similars) although I don’t really explore other genres besides those. And what about you guys?\n\n"}], [{"title": "INTJ in love? Truth? (self.intj)", "likes": "3", "comments": "10", "content": "How do I know you guys actually like me? Yes this INTJ has said so, but how do I know it’s not because I may be that rare person who has shown interest? How do I know it’s actually me you like rather than an idea of some rare love interest? - from an ISTP female\n\n"}, {"title": "Ya'll talk funny?  (self.intj)", "likes": "3", "comments": "6", "content": "Howdy,\nI was recently told by a guy that my speech is archaic, anachronistic, and cartoonish.\nCouldn't quite tell if I should take it as a compliment.\nSo how about it? Do any of youzguys have your vocabulary and manner of speech commented on?\n\n"}, {"title": "Struggling with empathy  (self.intj)", "likes": "3", "comments": "2", "content": "I am highly opinionated about most things but with experience I have learnt not to point things out for the greater good of the relationship. I do speak up, however, when someone tried to walk over me. But I try my best not to make it personal and try to talk as objectively as I can if they are too rude to me. Then the same people who were rude to me call me rude because I'm apparently snobbish for pointing out things like their own hypocrisy. Then I feel like though I'm an INTJ, who's supposed to have this heart of stone is much more empathetic than them.\nIf you have experienced something like this, how did you deal with it?\n\n"}, {"title": "Here’s a fun subreddit to be in. r/FollowThePunchline (self.intj)", "likes": 0, "comments": 0, "content": "r/FollowThePunchline Basically OP needs to make an incomplete unfunny joke and others are tasked with making it funny.\n\n"}, {"title": "   (self.intj)", "likes": "2", "comments": "11", "content": "Hey. I have a thing with a Intj (f20)\nWe were dating and then due to corona and our issues, we said let's keep this thing on hold for now, we'll talk it out once the quarantine ends. We both agreed.\nWe don't talk now.\nShe comes online though doesn't text and it hurts.\nI know we agreed to talk about it after the lockdown... it's just taking forever to end this lockdown.\nI'm afraid that by the time this ends, she'll not have feelings for me.\nIf you want the details then it goes like this :\nShe said she don't feel like my gf anymore.\nTho she'll help me move on and then she'll move on.\nAll of this obviously went for a month, and I didn't know what exactly she wanted,what I wanted.\nIt was harming both of us to talk about who we are, everything except that was fun.\nSo I sent a voice message cause she'll know that I'm not begging or something.\nThere I said let's go to college and let things happen how they are supposed to happen.\nHer reply to that text was : i completely agree, let's keep this on hold.\nThen after few days,\nI texted her, she replied.\nThen I saw a post on Instagram,that said ,\" are they texting you or responding to your texts?\"\nI over thought over it and then \nI replied her with ya.\nShe's seen it and now not texting.\n\n"}, {"title": "What to do now?  (self.intj)", "likes": "2", "comments": "2", "content": "You guys know that in the current state of the world it is inadvisable to do many things that were once the norm. Well since the quarantine started in my region I had been extremely busy working on finishing my masters degree, but now I'm done. And I'm bored out of my mind. A lot of us can identify with being pretty high-functioning overall. I was wondering what some of the things you have been doing to keep busy and/or improve yourself in some way. Any suggestions are appreciated, thank you!\n\n"}, {"title": "Iq and depression (self.intj)", "likes": "3", "comments": "20", "content": "I recommend watching from minute 50-60 but at around minute 53 jordan Peterson suggests that religion is for those that are stupid and dumb ppl should follow a more conservative approach. What do you guys think about that? \nAnd this leads me to wonder, are ppl with low iq more likely to have mental health issues and be in need of abstract systems like religion to help keep their moods regulated while the more intelligent people don't need it as much since they are more say, mentally durable and can withstand the hardships that are caused by the complexity of life simply by virtue of a high iq. Could be why ppl with high iq live healthier happier lives. Ik this is a dangerous thought and that ppl for some reason say smart ppl are more likely to have mental health issues and i don't think that might be the case. \nCan we try and view this other perspective? \nhttps://youtu.be/PqpYxD71hJU\n\n"}], [{"title": "A common day in the life of an INTJ in a non-quarantined office. (self.intj)", "likes": "56", "comments": "23", "content": "Girl comes to the hand sanitizer spot in the office and asks aloud:\nWhy is this hand sanitizer blue?\nMe being who I am I found the question stupid, but answered it nonetheless:\nBecause it is from a different brand than the previous one \nThen the social dude a few desks away goes:\nIt's blue because it's for the boys, look for a pink one\nThe girl and everyone in the room laughs. The end.\nedit: My first gold TYVM.\n\n"}, {"title": "INTJs aren't *emotional*, not *emotionless*  (self.intj)", "likes": "478", "comments": "139", "content": "One thing I see again and again across MBTI subs is this stereotype that INTJ types are robotic and emotionless. Sometimes I see people who claim to be INTJ acting like they don't have common sense when it comes to recognising basic social skills because BEEP BOP BEEP BOOP, AM ROBOT, NO COMPUTE. For instance, I saw a post a while back about someone \"not getting\" why people would be sad about severing ties with their best friend because \"I'm An INTJ, mE No GeT sOcIaL oBsErVaTiOnS\".\nI just think we need to make it clear that we have emotions, at just aren't governed by them and don't let them cloud our judgement.\n\n"}, {"title": "Failed my work eval because of feelings (self.intj)", "likes": "349", "comments": "113", "content": "Just had my 90 day review at work. It was a shitshow. My boss collected anonymous feedback from random coworkers and made me read each and every unfiltered comment. \nNow, I welcome constructive criticism, but this wasn't that. It was a burn book. Most of the comments started with \"I feel like she thinks this or that,\" which to me, have no place in a performance review. No mention of my achievements. No mention of the clients who sing my praises. Just an interrogation lead by a woman I report to but don't actually work with. \nThen there were the racial microaggressions. Comments about how I lack professionalism, never socialize and generally act like a bitch to everyone. \nHere's here's thing: I am a 30 something black woman at an all female company. 98% of my coworkers are white 20 somethings so I expect some stereotyping. But I never expected my boss to start swinging her neck and waving her finger like Shanaynay while explaining to me why my regular email to a colleague was rude. She even admitted if someone else wrote it, the language would've been fine. \nYes, I've gone to HR. Yes I'm getting a new supervisor. Still, my mind is blown. Thanks for reading my vent.\nUPDATE: THANK YOU to everyone who has responded to my rant lol. Your kind words and wtf's have lifted my spirits.\n\n"}, {"title": "Being introverted does not automatically equal poor social skills. (self.intj)", "likes": "482", "comments": "58", "content": "What greatly irritates me is the assumption that just because one is introverted and prefers solitude over social interaction automatically means one is antisocial and has poor social skills. This is also a very toxic assumption. \nUntil very recently I thought because I was very introverted I thought I had bad social skills. Then I actually looked up what social skills are, and I saw that I actually do have good social skills.\nI am also irritated by the assumption that extroverts all have good social skills. The assumption that extroverts have good social skills is why extroverts are able to get away with rude behavior, like getting into people's faces and violating their personal space.\nLastly I want to say that there is nothing wrong with with preferring solitude. There is nothing wrong with not liking going to parties.\n\n"}, {"title": "Your lack of social skills does not mean you have a high IQ (self.intj)", "likes": "355", "comments": "106", "content": "Too often I see people (often of this type) using IQ as a crutch for their bad social skills and extreme introvertedness. \n\"Yeah I just don't like being around people. All they want is money or social status and I don't care about those things.\"\nBullshit. You're just not good at those things. \nYes, it's true that a high IQ can make it hard to communicate and relate to others, but you shouldn't use that as an excuse. \nI don't care what your IQ is if you can't be a normal human around others. It's time to take your weaknesses into your own hands and work on the things you're not good at. Go out. Go to parties. Be around people. Stop saying that your IQ prevents that. Don't use your strength as a crutch and an excuse to not work on your weaknesses. \nI'm an introvert. I understand wanting to be alone, but it's unhealthy to remain in solitude too long.\nEdit: People don't like being told to take matters into their own hands and work on their weaknesses. I'm not sorry if this offends you.\n\n"}, {"title": "I think many of the posts about social function aren't due to INTJ traits. (self.intj)", "likes": "191", "comments": "37", "content": "I think it is important to recognize that more than one think can be going on with a person. The MB types are not dysfunction measures. There is also a tendency to medicalize introversion & treat introverts as broken extroverts. INTJs are systems level thinkers & can recognize social expectations & cues. If you are struggling with this you need to figure out why - family culture, autism spectrum, anxiety, etc and get assistance from a therapist or trusted friends. INTJ is rare and that makes for a different experience but isn't a fixed dysfunction.\n\n"}, {"title": "The \"Not like me\" bias. (self.intj)", "likes": "212", "comments": "117", "content": "I see a lot of people here having this reasonnement: \"You don't think like me, therefore you're not INTJ\". That's biased. You're spreading misinformation (Which is everywhere around here) and enforcing stereotypes. Also describing yourself does not describe an INTJ. For one INTJ or another can have developped differently (Some tell we don't care about how we dress, nah, we do when we have developped Se). Also being a saying you hate people, that you're a robot, not like everyone else, hate parties, etc etc just makes you look like a pathetic sociopath.\n\n"}, {"title": "I will always be an artist first (self.intj)", "likes": "544", "comments": "102", "content": "The MBTI community tends to neglect the deep, artistic side of the INTJ. Even in comments when I reference my preference for science and data, I've had people presume I want to fit into the \"robot\" stereotype of the INTJ-- because such pattern is SO prevalent... especially among INTJs looking for their identity/young or mistyped INTJs.\nThe \"robot\" stereotype applies to me only in my social behavior, though I would honestly rather call that alien.\nI will always be an artist, a creator, imaginitive. Ni is probably the most dominant part of my life, and I will always be imagining. I will always be in my head. \nI may come off rigid, skeptical, critical, analytical(all these things are accurate), but my inner world is deeply nuanced, creative, complex, and spectacular. Most hours of my life since childhood have been reserved for thinking and imagining. Years of such activity will fill your mind with an expansive, ever-growing world. \nINTJs are deep thinkers-- not logical thinkers. A logical thinker is the ISTJ. We are rational and critical, but our minds are fantastical and complex.\nJust take a look at HP lovecraft, an INTJ who had worlds in his head, dedicated his life to creating.\nI will always be a creator, an imaginer. My academic life may be all science, math, and Te-loving activities, but my inner world will always be rich with fantasy, philosophy, art, complex and imaginitive concepts. \nI could live without science and data. I could never live without my imagination. Maybe that's why we become conspiracy theorists.\n\n"}], [{"title": "Loneliness (self.intj)", "likes": "38", "comments": "15", "content": "I apologize this is all going to be one block of text as I’m on the mobile site.\nI’m an INTJ HS freshman girl and I don’t really have any friends. I tried making some at the beginning of the year, but things fell through. There was one group of friends that I was invited to hang out with, but they were all really loud and raunchy and kept tackling each other, basically average freshman in a cafeteria, and when I’m around them it makes me unhappy.\nI have two problems with making friends - one is that I hate small talk and the other is that most kids my age are pretty shallow, not to be rude or anything. I’m really bad at just coming up and striking up conversation with someone, and even worse when it’s at some trivial topic like how the homework is. Also, a lot of the people around me I don’t really want to be friends with. Many of them, at least the ones I see the most, are the types that are all “oh x girl talked to y boy on Snapchat and z friend got involved and z friend is a bitch blah blah” Not exactly my cup of tea.\nI’ve always been really good friends with adults, weirdly. I make excuses to talk to my teachers before school, and let my homework question transform into a great conversation. One of them even sent my father a random email about what an intelligent young lady I was, so hopefully they actually like talking to me (I don’t disrupt them or anything, I check to make sure they’re not grading or anything before I carry on with talking).\nI really just want to have a deep relationship with one person, if anything. I want another half, sorry for the cliche. I just want to have really deep conversations with someone close in age to me, but I’m not really sure how to find/make friends.\n\n"}, {"title": "INTJ women - The \"I'm not like other girls\" syndrome (self.intj)", "likes": "340", "comments": "200", "content": "Although INTJ's are rare and female INTJ's are even rarer. I have even fallen into the \"I'm not like other girls\" trap.\nHere's what I've learned, so I thought I'd share. Because sharing is caring....right?\nJust because you may have a rare personality, does not mean you are not relatable. \nWe have plenty of things in common with other women, as we are all.....women, and there are things that are synonymous amoungst all of us. \nI feel there is enough media pining women against each other, especially with the \"pick me\" syndrome in dating. We are all trying to prove how unique and special we all are, but really, we are all the fucking same. A guy is not going to \"pick\" you because you are so obscure from other women, it all comes down to whether or not you are BOTH compatible. \nSo yeah, INTJ women, don't do it. Yes, I know its hard to be understood sometimes. But please, look for the similarities not the differences first.\n\n"}, {"title": "Thank you  (self.intj)", "likes": "181", "comments": "71", "content": "I my very short 18 years of existence i have never, ever felt so connected with like minded people. There is literally no other intj in my life, no one with whom i can fully share my thoughts and fundamentals. I know being stern and antisocial are the common stereotypes of intj category, but i feel like it's the basic human nature to connect with like minded people. I was conditioned to think that there was no one like me, but this  subreddit thankfully negated that thinking. Thank you all for being a part of this amazing community (i don't really like this word). I am very grateful for being here.\nEdit- seriously a platinum badge? I can't find enough words to say thanks.\n\n"}, {"title": "Y'all are really lonely (self.intj)", "likes": "242", "comments": "83", "content": "So I feel like there's a post a day along the lines of \"I will be inevitably alone\". Since I used to experience this quite often, I figured I would compile some tips that helped me. \n\nAccept it. As pessimistic as it sounds, not everyone is going to have dozens of friends or deep relationships. As soon as I accepted that, it became a lot easier for me. \nTalk to people (no duh). Seriously, just strike up more conversations with people. Many might find you intimidating, and just being friendly and saying 'hi' can be the beginning of a new friendship. \nUnderstand why you are lonely. Is it because you can't find people you relate to? Are you just a cold asshole that everyone hates? Maybe do a little bit of introspection. \nBe less picky. One point I realised was that I was being WAY too picky about who I wanted to hang out with - no one is going to be highly intellectual, fun, responsible, kind, into the same hobbies as you etc. all at the same time. It's amazing the diversity of friends I've gotten after being more open. \n\nSorry for the long post, but I hope this helped some of you. Yes, there aren't many INTJs out there, but that doesn't mean there's no one that \"gets\" you.\n\n"}, {"title": "Hey, keep being awesome! (self.intj)", "likes": "273", "comments": "118", "content": "ENFP here, been lurking on this subreddit for awhile. I just want to say I think you guys are great and deserve way more appreciation!\nSome of you struggle socially and that's okay. To be honest a lot of extroverts are just jerks and don't actually care, and I feel like I've had some of my most genuine conversations with INTJs\nYou have so many amazing ideas for the world and what it can be! Don't give up on that.\nYou are some of the most deep thinking, inventive, clever people I know, with intricate inner worlds.\nJust wanted to give you guys a shout out for being so awesome :D cuz you are.\n\n"}, {"title": "For you younger INTJ's it does get much better later in life. Some life lessons. (self.intj)", "likes": "689", "comments": "104", "content": "I am a male 27 year old INTJ. Still relatively young but I like to pass on some wisdom to hopefully give any younger INTJ's a leg up on life.\n------------------------------------------------------------------------------------------------------------------------------------------------------------------------\nEdit: I see some replies about being too serious about an MBTI type. Of course it is not an all encompassing reality. We are all different because we all experienced life in a different way, culture, environment, teachings, and interests. I still believe it is a good indicator of your base thought patterns. Some may not agree but it helped me come to terms with why I think the way I do.\nEdit2: There is no need to thank me. I'm just a fellow internet stranger who posted words on reddit. I'm just glad this helps someone in someway.\nEdit3: Wow, Thanks for the gold internet stranger! I was not expecting that when I posted this morning. I posted a new section about personal development and financial success strategies hope these help as well.\nEdit4: People are saying I mistyped Elon Musk so I listed some other INTJ in history/present as an example. Stephen Hawking, Isaac Newton, Nikola Tesla, Dwight D. Eisenhower, Arnold Schwarzenegger...\n------------------------------------------------------------------------------------------------------------------------------------------------------------------------\nINTJ Specifics...\n- I'm sure you are all too familiar with the social anxiety that comes from being this type as you are younger. You think differently, you don't understand social conventions and probably think most of it is downright stupid. Don't worry you will grow out of it. My tip is to try to say yes to any social gathering, going is 80% of the work. A good way to think about this is always in the terms of personal development. Interpersonal and social skills is highly relevant to boosting your career and opportunities in life.\n- You are not a robot. You feel emotions intensely probably more than most types. The reason you feel like a robot is because you try to rationalize everything, even your own emotions. You need to utilize your emotion to drive your work ethic at times. The strangest thing is when I feel angry from some kind of failure I try to channel that into bursts of productivity. Sometimes you need to learn how to be present in the moment this is especially relevant to relationships.\n- Hitting the gym early in the morning like around 5-7am every day will turn you into a literal human terminator. There is something called Brain-Derived Neurotrophic Factor. Essentially its a 20-30% boost to your ability to learn and think. During the evolution of the human being we were programmed to think better on the move. If you were being chased by a predator you'd hope your brain was firing off on all cylinders. The boost in testosterone and the confidence you get from having a better figure will make you highly confident. Confidence is an amazing ability as you will notice most people in life have deep self-esteem issues. Be confident in your INTJ-ness.\n- I know its fun to dream but eventually if you want to turn that into reality you have to execute. Think about the end goal the big picture, then just go out and execute immediately. INTJ are great at figuring things out as we go. We are able to derive patterns from everything we experience in life so have more life experiences.\n- It is ok to fail, even repeatedly. You can't go anywhere in life without failing. I think for our type it is especially painful since we care quite a lot about winning and often jealous of other people's success. Think of failure as the natural progression towards success, learn why you failed, absorb that lesson and then move on to the next opportunity.\n- Try to take initiative and lead. Your natural ability to see the inefficiencies of every system, your creative + logical thought patterns, combined with a more developed social skill will make people want to follow you.\n- You are naturally an interesting person because of your differences. You might not notice this but your co-workers and acquaintances actually want to hang out with you. Give them a chance before giving them the wall.\n- Motivation will only get you so far. To achieve goals utilize discipline. Form good habits.\n- The most important thing as an individual is to see yourself a year back and go \"Yeah, I am a much better and improved person than last year\". Everyone has a different level of success don't stress too much and just be better than you were in the past.\nIf you need an example of a highly developed INTJ just look at what Stephen Hawking, Isaac Newton, Nikola Tesla, Dwight D. Eisenhower, Arnold Schwarzenegger is able to achieve. Cast away your insecurities and go after what you want in life. We are some of the most capable people on earth.\n------------------------------------------------------------------------------------------------------------------------------------------------------------------------\nThis post seems to be really helping people so I can share a bit more info on how I tackle personal growth and financial success.\n​\nSelf Improvement and ways to think and structure your life...\n- Be in the state of constant improvement. There are many categories. Knowledge, money, career status, communication skills, fitness, obtaining hobbies, improving hobbies... and much more areas of life you can improve upon. There is nothing more satisfying in life when you realized how much you grown just a year ago.\n- Time is your most valuable asset in life. Use it wisely. Money comes and goes but once a second ticks over it is gone forever..\nLet's say you are traveling by train. The typical person would be playing some game on their phones but this is the perfect opportunity to learn things. While walking try to listen to podcasts. This may not seem like much but over time all the time you spend commuting it doubles over as learning.\n- Becoming motivated is hard. It is human nature to be lazy and complacent. Do not be like most people and become temporarily motivated by some motivational bullshit it doesn't work long term. Instead rely on discipline. One of the greatest ability of a human is the ability to adapt and grow accustomed to a set life style. Make sure that life style is one of personal growth.\nI use google calendar to stick to a rough schedule with a focus on self improvement. Either before you go to sleep or right when you wake up, plan your day. Investing in a smart watch is also a good idea. You have a lot of useful things right on your wrist saving some time.\n​\n---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\nMoney...\n- Early on in life say less then 120k income or so, it is worth way more to spend money on career development then investing in any kind of asset.\n- For those with some spare cash. Learn about investing as soon as you can. Even if you only have a bit of money to spare each month the power of compounding interest will serve you well later in life. Money opens the door to personal freedom.\nThere are many styles to investing but the slow approach will serve most people the best. Look into value and dividend investing. I personally utilize an income focused investment strategy rather than relying on timing the market and luck. I do a lot of REITs, Dividend Aristocrat stocks, and rental properties.\n- Learn about tax advantage accounts. 401k. opening your own LLC, getting your own real estate license, Credit Card Churning, Deal websites apps like slickdeals/Honey, ect\n- Be cheap and stingy with most things. Only buy things that make you more productive and make sure you buy things that are of good quality so they last longer. Place all extra funds into investments, even that dollar sitting there will make a difference over a long time span.\nMy three golden rules in this order\n\nSpend money to make more money\nSpend money to make your self more productive\nSpend money to make your self happy\n\n- It is also ok to purchase things that are fun on occasion. Things that put you in a good mood makes you a more productive person. Just make sure to not buy toys that are above your means to pay.\n- It is also good idea to spend money on hobbies. Hobbies and interests makes you a more interesting person which will serve you well in your professional career.\n- If you can try to eliminate commuting to work. The cost and sanity savings here are significant.\n- It is ok to live with your parents rent free until you have enough to invest in a piece of real estate, be the landlord not the renter. Rent adds up and if you can divert those costs instead to investments it will start compounding at an early age. Of course explain to your parents what your plan is and most will understand. Real estate is an appreciating asset.\n\n"}, {"title": "How excrutiating are chatrooms in r/intj?  (self.intj)", "likes": "1", "comments": "20", "content": "i had a very bad experience with it, so poor , nothing to learn from the chats!only motto 'mock as many people as much as possible' talking all shit vulgar stuff! hate it altogether!\nthere needs to be a reform in it!\nEDIT:\nI'm making it clear \nThere is NO attack on freedom of speech\nThere is NO ideas on intrusion\nFeel free to comment (replies only for rational ones!)\n\n"}], [{"title": "So you're looking for tips on dating a female INTJ (self.intj)", "likes": "224", "comments": "95", "content": "There are a lot of posters here asking for advice on 'dating a female INTJ'. These are just some of my thoughts based on what I like:\n+ INTJs generally shy away from passive social outings like sitting around drinking and eating, though if there is some sort of fun activity involved then it perks our interest eg bowling, music jam etc. If that's the case, involve her as much as you can and be happy that you're on the same team. Don't try to over-control her strategy.\n+ If you're wondering where to take her on a date, make a list of the following and let her choose: arthouse movie, picnic,   art gallery / museum, drawing class etc. INTJs love to be surrounded by nature and art. If you can do both in a day, even better.\n+ Try not to be argumentative for the sake of it. INTJs actually don't care for 'arguments' but are open to respectful discussion. If you disagree on religion, for instance, let her TALK. If she goes on lockdown, you've lost her interest and respect.\n+ Never try to change something about her unless it's life threatening. Don't try to change her hair, her clothes, or her personality. If you don't like her outfit, be prepared to change yours first.\n+ Compliment her first on her wit and intellect before her aesthetic. INTJs don't mind being told occasionally they are 'pretty', but it shouldn't be the currency in your relationship. If you laugh at her jokes, that means SO MUCH more.\n+ INTJs don't really like receiving gifts, so don't stress about buying her flowers or expensive jewellery. However, make an effort by being on time and being in a good mood on your dates. Show you respect her, not how much money you have.\n+ If your INTJ wants to learn a difficult skill from you (like driving), you have to be SUPER patient and not patronising. Compliment her small achievements. Sometimes the physical world eludes us, but given time, we will become super awesome at it.\n\n"}, {"title": "Can we stop posting posts about not posting posts like \"can we stop posts\"? (self.intj)", "likes": "4", "comments": "9", "content": "I dont know what I'm doing. Its bedtime now\n\n"}, {"title": "Pssst... Hey, you! Yes you!  (self.intj)", "likes": "214", "comments": "107", "content": "I just wanted to say that I think INTJs are fricken amazing! You guys are wonderfully intricate and just plain brilliant! I feel like people misunderstand INTJs way too often and I don't think you get told enough just how awesome you are!\n\n"}, {"title": "Nothing should hold you back (self.intj)", "likes": "312", "comments": "32", "content": "I have been lurking on this sub for a while now, and I have a few things to say.  I don't mind the 'no one loves me' or 'i cant make friends' posts.  I think those posts are important.\n​\nI used to be one of those people, I never understood why I didn't have a lot of friends, and I never understood why relationships, social activities, and life in general seemed so hard. I was depressed (though i never admitted it).  \n​\nI look back at who I was, and it makes me so happy now that I felt those ways then. It is encouraging to see my progress and see where I am going in life.  After some heartbreaking situations, I realized I didn't need a lot of friends, just a few good ones that would always be there for me no matter what.  I found someone without looking and fell in love, we've been together for 10 years now.  I know now that I don't have to enjoy social activities and the pressure around them, I can be myself, and if people don't like it, then that's their problem.  I finally admitted that I have been suffering from depression for 15 years and I am working through it.\n​\nI know this is a long post, but I think it is important for young INTJs to feel things like these.  We are not robots, don't convince yourself that you are.  We feel emotions and we hurt.  That's OK. In fact, embrace those emotions and let yourself feel them.  You will be a lot better off in the long run.\n\n"}, {"title": "An appreciation post for all the female INTJs (self.intj)", "likes": "391", "comments": "79", "content": "Let’s commence the circle jerk and give ourselves a round of applause!\nI kid, I kid. Just wanted to say that, while rare in the wild, it makes me happy to see you all here. When I read your posts, it makes me feel relieved and understood that others experience the same interests, struggles, and outlooks. \nI felt very weird and for lack of better words, incorrect, for a lot of my life. I’ve struggled with maintaining friendships and blending in. This isn’t to say, “I’m so quirky and different! Not like the other girls!” It actually really sucks at times and it’s not a reflection of how interesting and worthwhile I am as a person. Anyway, coming here makes me feel understood. I’m sure you know what I am trying to say. \nI also want to point out that one of the most valuable friendships I’ve ever had was with another female INTJ. She was quiet, extremely direct, and had a heart of gold. She opened up to very few people and I am grateful that I was one of them. \nHer non-sugarcoated advice when I was going through personal struggles was always what I needed to hear. Her advice was not only accurate, but pure. No bias. \nIt worked out quite well because we both hated being social and going out, so our workplace was the perfect environment to catch up here and there, laugh, and leave it at that. \nWhen we worked together, I admired her ability to cut small talk short, and call people on bullshit in a blunt way that I’d be too afraid to do myself.\nI felt like we connected deeply, and I enjoy feeling that once again here. \nRegardless of personality type, being yourself, in all of your glory, is a brave thing to do. I think as females we have to navigate that with caution for our own self interest at times. \nSo. Props to the way you think, who you are, and not always blending in. Fuck the people who give you grief for not being a social butterfly or not sharing the same interests. You’re perfect the way you are.\n\n"}], [{"title": "To Young INTJs: We aren't all socially awkward 'losers' that can't manage relationships, schooling and careers (self.intj)", "likes": "862", "comments": "74", "content": "Every other post on this subreddit begins with 'I have no friends...' or 'does anyone else do this weird thing?' or 'why won't my brain slow down?'\nWe get it, you're young and life is hard.\nBut please...\nStop attributing all of your quirks and problems to your personality type. INTJs are all different with only the way we think in common. It's more than likely you're just a teenager with worries every other teenager has.\nWant friends? Talk to people, be genuinely interested in their lives, share some fun facts you know.\nDoes anyone other than you get sad? Yes. Does anyone else overthink? Yes. \nDo others struggle with homework? Yes.\nBeing an INTJ is hard but it's also only as hard as you make it. Try to focus on yourself and not on what it takes to fit in because we were born to stand out. Losing sleep over how 'weird' others find you will only make you more sad. Embrace it while you're young and things will get a lot easier. \nAnd remember, we peak later than most people so stop wasting your energy on feeling sorry for yourself and just remember that your time will come. \n\nan older INTJ\n\n\n"}, {"title": "Whats a rule you used to live by but changed? (self.intj)", "likes": "95", "comments": "216", "content": "The other day someone posted top 3 mottos you lived by or whatever it was. It got me thinking about how our beliefs change over time due to experience or getting wiser, or being taught something that changed your perspective etc. \nThe one that stuck out to me was something i think i created (prob not) that goes like this; \"Do the least to achieve the most\". Basically it means whatever it is you are doing , be efficient as possible and use the least amount of resources to get the best ROI. Eg; spend the least money to earn the most money, invest the least time to achieve the max goal of that time, etc. Generally speaking this sounds logical and sound. However it has a flaw in that you are trying to do the least work possible instead of the most work possible. If the efficiency you have at the low end is theoretically the same at the high end then you should \"Do the most to achieve the mostest\" or however you would say it. This is also flawed though, because there is a psychological/mental aspect to work and achievement. Having worked hard at something and earning it is worth way more than being giving something. Eg; being handed a 1st place marathon medal when you came in 34th does not feel as good (if at all) as actually training hard and actually getting first. It feels like cheating , or that it was just given to you and you dont need to work hard if things are just always given to you and you end up not appreciating things. This sort of ties into the old daying; \" the journey is the destination\".\nWork in itself is an achievement. Therefore 'doing the least to achieve the most.' is terrible for a person. Work is satisfying and gives drive and ambition and goals and so on. Regardless if the work is shitty or tedious or whatever negative emotion you associate with work. The old addage of 'live to eat, not to work.' is along the same line , you should actually 'live to work, not to eat.' \nBeing efficient and doing the minimal creates a 'meh' baseline mentality and doesnt propel you further than you need and can also cause you to resent people, employers, the goverment, etc. \nMy new motto is (not really concise and catchy but )\"Work harder than you think you should, do more than you think you need.\" Even if you arent getting a great ROI on your work, your efforts alone creat eudymonic happiness. A satisfying baseline of life that feels more accomplished in whatever work you do. You are striving to be the best at whatever you are doing and in theory it opens up more doors and by proxy also covers the other old mottos of doing the least to achieve the most, or doing the most to achieve the mostest. \nSorry if i am rambling, i hope i got my point across.  I guess the TLDR is that trying to find the sneaky, or efficient, or cheating, or 'getting by' method of work and life is ultimately unfulling and evryone should just work hard as fuck.\n\n"}, {"title": "Parenting as an INTJ (self.intj)", "likes": "29", "comments": "47", "content": "I love my kids, I really do. But it took me a while to really bond with them. And I worry all the time about whether my approach to a particular situation is correct; whether I'm giving them too much of one thing and not enough of another; if they're overanalyzing everything like I do; etc.\nAnd when they are struggling with their emotions, I can be that calm, rational, helpful parent for a while...until I hit a wall. Then, it's like I'm completely exhausted and depleted and have no energy or patience to deal with them anymore. I need to physically distance myself from them in order to recharge.\nHow about you?\nEDIT: OMG GOLD? Thank you!!! (This after I disappeared into my bed for a good 10 hours because this week has been...well you know ;))\n\n"}, {"title": "Anyone willing get some struggling families some Christmas presents, link below.  (self.intj)", "likes": "46", "comments": "5", "content": "/r/SantasLittleHelpers\nI know us INTJs can be skeptical of their supposed struggles, but just in case anyone is able and willing to do something small and let karma work itself out :]\nI should also note I heard of this sub through /u/VaderMosh via a random comment. Thank you, stranger!\n\n"}, {"title": "An older INTJ's perspective on happiness (self.intj)", "likes": "257", "comments": "50", "content": "I'm in my mid 40s, and as some of you might be able to relate, during my youth I felt different from those around me and struggled to find happiness. Because I never fit in, I experienced a lot of insecurities, and it took me a long time to come to terms with who I am and what I have to offer. I am pleased to report that I am now happier than ever, and unlike many other middle aged people, I have yet to see any signs of the dreaded midlife crisis (and I don't expect any to develop). My life isn't perfect, but I wouldn't trade places with anyone else in the world at this point. I thought I'd share some of my thoughts on achieving happiness with my fellow INTJs, in the hopes that some of you will find it useful.\nI've researched some other people's perspectives on happiness, and I think we INTJs define it a little differently. For example, more extroverted people consider things like a sense of community, providing value to others, a large group of friends, a busy social life, and experiences (parties, travel, etc.) to be key contributors to their happiness. However, as an introvert, community isn't something that I find all that important (other than for basic things like public infrastructure and safety). In my job, I provide value to others as a means to an end, but it isn't a source of personal satisfaction for me. I don't care about having a large social circle because I only have time for a few select close friends, and I don't mind spending time alone (I enjoy being with my SO or my family when I'm not alone). As far as experiences are concerned, as an INTJ my mind is constantly filled with thoughts, so I have less of a need for external stimuli to keep me preoccupied. In fact, I enjoy many mundane solitary activities (listening to music, working out) as it gives me a chance to think about and reflect on things.\nHaving said that, I've found there are three primary areas that I need to focus on and maintain in order to achieve long term happiness.\n\nPhysical health/fitness. Keeping our bodies healthy and fit is not only important for optimal function, but it can also serve as a source of confidence for INTJs since it is one of the few external visual cues that non-INTJs can see. I've maintained my health and fitness since my 20s, and it's particularly satisfying to know that I am capable of the level of discipline and dedication required to achieve a challenging long term goal.\nFinancial health. As an INTJ, I value the freedom to be able to pursue my interests. In our current society, that means having money as it buys freedom and security. Here is why I think it's important to pursue financial independence, and here is how I'm achieving it.\nEmotional health. INTJs are normally logical beings, however we tend to struggle with emotions which can be completely irrational. Emotional issues, if left unchecked, can grow and manifest into physical and financial problems. In the past I used to try to deal with my feelings on my own or with friends, but that wasn't always productive due to a lack of knowledge or objectivity. As an adult I've found it helpful to consult a qualified professional when I'm struggling with emotional issues. Don't be embarrassed to work with a qualified therapist or counselor if you feel overwhelmed, and don't be afraid to utilize your employer's employee assistance program if they offer one.\n\nI believe that as long as I'm physically, financially, and emotionally healthy, I can deal with most of life's challenges and remain happy. Here are a few more tips for achieving/optimizing your happiness:\n\nFocus your time and energy on the things that are within your control. Worrying about stuff you can't do anything about leads to wasted time and unnecessary stress.\nAvoid social media, as it can lead to comparing your life against an unrealistic portrayal of other people's (since you're most likely seeing the highlight reels of their lives).\nLearning to be content and appreciating the little things are important for happiness, but some people struggle with this because they live in a bubble--which amplifies their problems. A good way to counter this is by volunteering to help the less fortunate. Being around those who are doing without will cause you to be more grateful of your own circumstances, and make it less likely for you to take your life for granted.\nAccept that you will have good and bad experiences in life. We wouldn't be able to appreciate the good if we never experience the bad. Try to learn from the bad experiences and grow from them, and don't forget them so that you can always keep a balanced perspective.\n\nEdit: Thank you /u/east-wrest for the gold!\n\n"}], [{"title": "Anyone act charismatic to counteract your awkwardness? (self.intj)", "likes": "50", "comments": "21", "content": "I've always been around extroverts in my friend group, so I kinda had to learn to keep up. So what happens is I have this outgoing personality when I'm with a group of people, but when I'm one on one with my girlfriend or just alone in my room my introvert pops right back out.\n\n"}, {"title": "How do i be happy? I'm a 21 year old INTJ at Princeton, I'm going to have a good career and make lots of money, but I am so sad and I don't know if I can do it anymore  (self.intj)", "likes": "17", "comments": "29", "content": "Reddit, please help me. I'm finding it really hard right now. I'm a 21 year old INTJ, I go to Princeton, I'm studying computer science, I don't have good grades but I'm on-track to having a high-paying comfortable career, but I feel so empty inside. I feel so so so lonely. \nI don't know how to do it anymore. I'm interning at a tech company this summer in SF, my favorite part is when I'm at work and surrounded by my coworkers who are older than me but who I think are super cool. I love working. I fall apart on the weekends, and when work ends. I fall apart when I have to be alone by myself. If I could, I would work 24/7, sleep at work, just be around my coworkers all the time, hanging out and working. What's really sad is that I wish they could be my real friends. The truth is, they're just my coworkers and not really my friends even though I think of them as my friends. \nI don't know how to make real friends. I don't know how to be around people. People get bored of me because it's like I don't have a personality. I'm always so closed off to everyone. I grew up with a single mom who was unhappy and emotionally abusive, and I don't know how to actually connect with people. \nI don't know what to do. I'm losing it. I just feel so so alone and I don't think it's ever going to get better. \n\n"}, {"title": "Does anyone else watch movies at 1.5-2.0 speed to spare time?  (self.intj)", "likes": "17", "comments": "38", "content": "I've never heard of anybody else doing this, so I thought maybe worth asking it here.\nWhen I watching something I quickly get bored, so I speed it up. Others say it's not enjoyable this way, but I like it because I get the same informations but the procedure takes less time.\nEdit: my first reddit gold, thank you! And thanks for the second too! Wow third, thank you! \n\n"}], [{"title": "Another post addressing the problem of \"fake INTJs\" or \"INTJ wannabes\" (self.intj)", "likes": "78", "comments": "114", "content": "Here's the deal. \nI don't have a problem with who ever you think you are. \nBut when I call my self an INTJ and you call your self an INTJ; but you go around telling everyone you are an emotionless sociopath who hates all humans and wants to take over the world and kill stupid people because of atheism... I have a problem with that. \nOk? \nAnd on the most basic of levels, that is just not okay. \nYou should not be proud of your \"lack of emotion\" and if you feel you are emotionless; get a doctor or therapist! \nIt's not a sign of greatness or entitlement; it is a sign you are a idiot and do not deserve our attention. \nAs an intj you should be able to figure out that emotions are vital in life. That they are an important part of society and give our lives joy. And that no one here is actually emotionless!!!! Unless you are a psychopath, in which case you'd still have emotion. Just not nice ones. \n Now having said all that.. Maybe you disagree with me; that is fine. Disagreement is vital. \nI come to this subreddit for conversation; I come to learn things; To talk to others I respect; To hear others opinions. \nBut all I ask is this:\nDon't be a dick. \nDraw the line at \"asshole\". \nIf you are rude; I have every right to not like you. \nIt doesn't matter if you are a real intj, a fake intj, or a none intj; don't be stupid. Don't be a dick! \nThis is a respectable subreddit. And a lot of people, including me, are not happy with the amount of seeming \"attention whore intjs\". \nPlease stop it. Thanks. \nIf anyone would like to add to this or has  a different opinion, please comment. \nAlso. Another thing is the people who attack the people who are mad about this. Like I bet someone's gonna come be like \"why are you so mad? You are a fake intj your self. You are the problem\" which is just what I don't want! I want peace! I am only making this post because it's getting to be tense on here. People are mean a lot more often. I don't know why. Just be respectful. Let's deal with this like civilized humans. And if you disagree. Ask me for clarification. Don't just jump to the conclusion you hate me and need to ruin my day. Thanks again. \n\n"}, {"title": "Traits I find frustrating as an INTJ (self.intj)", "likes": "157", "comments": "39", "content": "Just as the title would give away, this is a list of annoying traits I have observed about myself related to being an INTJ, in no particular order. NOTE these are not traits OF INTJS but are related to the traits of being an INTJ. All of these traits I find to be day-to-day headaches that complicates my life more than it needs to be. Side-note, I acknowledge I am not the best with conveying my thoughts into words accurately, but please bear with me.\n1) If I used one word to describe my mind it would be: duality. I am decisively indecisive. If I have not already set it in stone, my thoughts will argue until it finally does, it can never just be \"let it be\". I am always at conflict with myself, which is not always bad, but sometimes it gets far too chaotic for any sane person. Hell, my username came from my conflicting nature!\n2) I always need to add emotion to my conversation. I'm pretty seemingly stoic, unless I truly care for the discussion. I am always aware to add emotion and correcting my wording in a way that won't be seen as blunt and/or insensitive. Even then, people tend to notice my very direct sense of thinking.\n3) I am brutally honest. I am direct to the meat of the topic and I do not sugarcoat it, unless I see it as an actual need. And when I do sugarcoat, I will do so as minimally as I see is necessary. This is a result of lacking an emotional connection most of the time\n4) Related to 1, I act detached, but really I feel emotions very strongly (following logic of course). As a child my emotions were too strong for me to control, it was easy to elicit a very strong emotional reaction (especially crying). It was a genuine problem, the lack of control caused me many problems with socializing with others my age. I obviously have much more control over my emotions now, but I still feel emotions very strongly at times, I just show it far less than before.\n5) I am my biggest critic, nobody can bring me down worse than I can. It could be the tiniest of details, but I will think of it as a big failure all the same. This has caused me to be self conscious about every little detail about myself (this list is a pretty damn good example of that) that most would not even give a thought to.\n6) I can never just enjoy something, I always have to analyze it. I will have to force myself to not think and just relax if I'm not trying to be serious, which doesn't always work.\n7) When I think, I'm usually thinking of something big, like say nature of humanity and all that jazz. Can't I just take a chill pill and think about things normal for a 19 year old?\n8) I am knowledgeable in many areas, but I do not have great knowledge on many of them. I intensively study something and then once I am satisfied, I archive the summary and remove the details. This gets pretty annoying when I get deeper into a discussion on that topic and I just can't accurately back up my thoughts as I would like.\nEdit: Some mistakes I caught long afterwards \n\n"}, {"title": "Nietzsche's Most INTJ Quotes (self.intj)", "likes": "75", "comments": "26", "content": "I love Friedrich Nietzsche (he's probably my favorite philosopher), and as many of you may be aware, he was a straight-up INTJ. He was also arguably a major precursor to Jung and to psychology in general.\nSo for fun, I decided to go through his quotes and pick out the ones that seem to express the INTJ ethos the most. I tried to sort them by function when possible. So here is something along the lines of an INTJ type description as presented by Nietzsche. Enjoy!\n\n\n(Ni) \"Mathematics would certainly have not come into existence if one had known from the beginning that there was in nature no exactly straight line, no actual circle, no absolute magnitude.\"\n\n\n\n(Ni) \"We believe that we know something about the things themselves when we speak of trees, colors, snow, and flowers; and yet we possess nothing but metaphors for things — metaphors which correspond in no way to the original entities.\"\n\n\n\n(Ni) \"We have already gone beyond whatever we have words for. In all talk there is a grain of contempt.\"\n\n\n\n(Ni/Se) \"The pride connected with knowing and sensing lies like a blinding fog over the eyes and senses of men, thus deceiving them concerning the value of existence. For this pride contains within itself the most flattering estimation of the value of knowing. Deception is the most general effect of such pride, but even its most particular effects contain within themselves something of the same deceitful character.\"\n\n\n\n(Ni/Se) \"I would not know what the spirit of a philosopher might wish more to be than a good dancer.\"\n\n\n\n(Ni/Te) \"The drive toward the formation of metaphors is the fundamental human drive, which one cannot for a single instant dispense with in thought, for one would thereby dispense with man himself. ...It continually manifests an ardent desire to refashion the world which presents itself to waking man, so that it will be as colorful, irregular, lacking in results and coherence, charming, and eternally new as the world of dreams\"\n\n\n\n(Ni/Te) \"It is my ambition to say in ten sentences what everyone else says in a whole book — what everyone else does not say in a whole book.\"\n\n\n\n(Ni/Te) \"As a genius of construction man raises himself far above the bee in the following way: whereas the bee builds with wax that he gathers from nature, man builds with the far more delicate conceptual material which he first has to manufacture from himself.\"\n\n\n\n(Ni/Te tension) \"There are ages in which the rational man and the intuitive man stand side by side, the one in fear of intuition, the other with scorn for abstraction. The latter is just as irrational as the former is inartistic. They both desire to rule over life: the former, by knowing how to meet his principle needs by means of foresight, prudence, and regularity; the latter, by disregarding these needs and, as an 'overjoyed hero,' counting as real only that life which has been disguised as illusion and beauty.\"\n\n\n\n(Ni/Se tension) \"Only by forgetting this primitive world of metaphor can one live with any repose, security, and consistency: only by means of the petrification and coagulation of a mass of images which originally streamed from the primal faculty of human imagination like a fiery liquid, only in the invincible faith that this sun, this window, this table is a truth in itself, in short, only by forgetting that he himself is an artistically creating subject, does man live with any repose, security, and consistency.\"\n\n\n\n(Ni/Fi) \"To what extent can truth endure incorporation? That is the question; that is the experiment.\"\n\n\n\n(Te) \"In Christianity neither morality nor religion come into contact with reality at any point.\"\n\n\n\n(Te) \"I am no man, I am dynamite!\"\n\n\n\n(Fi) \"The surest way to corrupt a youth is to instruct him to hold in higher esteem those who think alike than those who think differently.\"\n\n\n\n(Fi) \"We want to be poets of our life — first of all in the smallest most everyday matters.\"\n\n\n\n(Fi) \"Morality is herd instinct in the individual.\"\n\n\n\n(Fi) \"Whatever has value in our world now does not have value in itself, according to its nature — nature is always value-less, but has been given value at some time, as a present — and it was we who gave and bestowed it.\"\n\n\n\n(Fi) \"Today as always, men fall into two groups: slaves and free men. Whoever does not have two-thirds of his day for himself, is a slave, whatever he may be: a statesman, a businessman, an official, or a scholar.\"\n\n\n\n(Fi) \"Thoughts are the shadows of our feelings — always darker, emptier, simpler.\"\n\n\n\n(Fi) \"What does your conscience say? — 'You shall become the person you are.'\"\n\n\n\n(Se) \"One has attained to mastery when one neither goes wrong nor hesitates in the performance.\"\n\n\n\n(Inferior Se) \"The mother of excess is not joy but joylessness.\"\n\n\n\n(Inferior Se) \"For believe me! — the secret for harvesting from existence the greatest fruitfulness and the greatest enjoyment is: to live dangerously! Build your cities on the slopes of Vesuvius! Send your ships into uncharted seas! Live at war with your peers and yourselves! Be robbers and conquerors as long as you cannot be rulers and possessors, you seekers of knowledge! Soon the age will be past when you could be content to live hidden in forests like shy deer! At long last the search for knowledge will reach out for its due: — it will want to rule and possess, and you with it!\"\n\n\n\n(Shadow Fe) \"Ah, we lonely ones and free spirits. ... We wish for nothing more than truth and straightforwardness ... and despite our most ardent wishes we cannot help our actions being smothered in a cloud of false opinion, attempted compromises, semi-concessions, charitable silence, and erroneous interpretations. ... We hate more than death the thought that [such] pretense should be necessary, and such incessant chafing against these things makes us volcanic and menacing. From time to time we avenge ourselves for all our enforced concealment and compulsory self-restraint. We emerge from our cells with terrible faces, our words and deeds are then explosions, and it is not beyond the verge of possibility that we perish through ourselves. Thus dangerously do I live!\"\n\n\n\n(Shadow Si) \"The advantage of a bad memory is that one can enjoy the same good things for the first time several times.\"\n\n\n"}, {"title": "\"In this world, you must be oh so smart or oh so pleasant. Well, for years I was smart. I recommend pleasant.\" (self.intj)", "likes": "219", "comments": "67", "content": "Hi, Reddit INTJ. I am a successful attorney in my young 30s, writing to offer a more mellow INTJ perspective. I find myself not identifying with many of the negative posts here. I probably would have identified with them more when I was younger. Here are some thoughts that you may or may not find useful:\n \nI consider the Harvey quote in the title to be words to live by, especially for INTJs. I was the smart kid in grade school. I turned in my assignments before everyone else. I quietly read for fun rather than interact with my classmates. \"Smart\" was my defining characteristic. \"Well, for years I was smart. I recommend pleasant.\"\n \nDuring college and law school I made a conscious choice to do the following:\n \n(1) Live a life of joy rather than pessimism or cynicism;\n(2) Try to bring joy to others;\n(3) Make people laugh;\n(4) Learn about other people's stories; and\n(5) Be willing to share my own story with others.\n \nThere's more to it but that is just off the top of my head. Over the past decade or so, the positive change in my life has been enormous. I enjoy meeting people, experiencing new things, cheering people up, getting to know people better. I am known as a pleasant, cheerful person.\n \nUnderneath it all, my INTJ mind still chugs away constantly. I sometimes finding myself thinking negative, cynical, sarcastic, or otherwise unpleasant thoughts. I make a conscious decision not to verbalize them. Because actions shape thoughts, as well as vice-versa, I have found my outlook truly changing for the better over the years. I think every INTJ is entitled to his or her own thoughts, but we do have a responsibility to make sure our actions (particularly speech) help rather than hurt others.\n \nWhat inspired the change? First, I have personally known older INTJs who made the choice to cultivate social skills, kindness, and humor. It worked very well for them. Second, I was inspired by characters from stories: Vash the Stampede from Trigun. Elwood P. Dowd from Harvey. Captain Picard. Carrot from the Discworld stories.\n \nIntelligence does not have to be your defining characteristic. You can still be super smart, capable, and extremely powerful in your own way. But at the same time, you can choose to be pleasant, kind, and truly interested in others. This will improve your life.\n \nIf you've made it this far, thanks for reading.\n \nP.S.: Socializing is still tiring. I still need alone time to recharge. Few things make me happier than finding other INTJs, in real life, and thinking, \"Oh my God I can finally relax with people like me. We can use big words without hesitation and discuss abstract topics, as happy as pigs in the mud on a hot summer day.\" I am still an INTJ. But that's not all I am.\n\n"}, {"title": "A short list of reminders (self.intj)", "likes": "103", "comments": "46", "content": "Last night I wrote down a sort of instruction manual for myself with behaviors/tendencies I need to be aware of and work on (some of it is fairly tongue-in-cheek). Perhaps some of you can identify with the things I've written, so I thought I would share. Please share your own personal rules in the comments if you feel so inclined. The following list is addressed to myself: \n1) Don't make snap judgments about people. You didn't like a lot of the most important people in your life at first, so don't continue to make that mistake. \n2) Ask for help and don't be ashamed of ignorance. After all, it's more efficient.\n3) When/if you realize someone is a potential interest, dive in and get to know them. Resist the urge to sit back and analyze them. By the time you decide for sure if you're interested, they will have long moved on.\n4) Remember to smile and/or have a pleasant and open countenance and posture. \n5) When the urge to be creative overcomes you, don't try to make something artistically pure or perfect, just make something \"good enough.\" Try to make something with the intent of selling it or as a gift for someone else, otherwise, you will obsessively ponder the philosophical truths underlying aesthetics, art, and reality itself, and enter a spiral of existential crises. \n6) Do not excise people from your life simply because you don't think they can help you. You will be wrong frequently, and wish you had them as a resource. \n7) However, you should excise people from your life if they hold you back from your goals.\n8) Don't get frustrated that many people are illogical. After all, that this quality makes them easier to manipulate (I'm half joking here). \n9) Don't lie to yourself to protect you ego and self image. This is your knee-jerk reaction, so be mindful of it.\n10) Never research anything to do with abstract physics when you have an important deadline coming up. It will feel like the most important issue (which it might very well be... on a cosmic scale) and will attempt to consume your mind and prevent you from studying. \n11) Speak up, make an effort, and be heard. It's not as easy to express your thoughts as it is to think them, but it's often worth it. \n12) Most other people are more sensitive than you are. Initiate pleasantries and other exchanges to make them happy. Also, go easy on the edgy jokes.\n13) Limit your teasing. Just because you know someone well doesn't mean you have license to pick on them--this hurts people sometimes. Encourage them as much as possible.\n14) Forgive yourself for not being perfect. You're not going to be. Give yourself a break every now and then.\n\n"}, {"title": "How do you respond when you feel someone is \"handling\" you using Fe? (self.intj)", "likes": "25", "comments": "25", "content": "When a Fe-dom or a 2-Fe slyly manipulates their way\nThrough the crafty things they do and hint\nand suggest and shout and say,\nDo you bristle, do you lurch? Do you want to climb a birch?\nDo you reel and rage and fumble?\nDoes your ego take a tumble?\nHow do you act, my Fe-less friends?\nDo you act out now and later have to make up, make amends?\nOr do you use ninjitsu skills, a delayed-reaction arrow in the back?\nOr some other thing, some secret, fun, incredible life hack?\nDoes your Te win the day since your boss is ENTJ?\nOr are you unfamiliar, so it doesn't matter anyway?\nRegardless, some transparent Fe has ruined my day so far,\nSo I thought I'd ask and get a feel for what your ideas are.\n\n"}, {"title": "/r/INTJ Frequently Discussed Topics (self.intj)", "likes": "62", "comments": "8", "content": "If you have contributions of other topics and links not currently on this post that you’d like to make, please feel free to share them in the thread!  The following will be eventually added to the wiki as a permanent reference, and members of this sub are welcome to contribute now and in the future.\nIt comes as no surprise to most subscribers here that a lot of INTJs experience similar personality-related difficulties and frustrations in life, nor that other types have some frequent common questions related to understanding/relating to the INTJs in their lives.  Anyone who has spent much time on the sub has seen certain questions and topics come up periodically - some even as often as a near-weekly basis.  \nIn an effort to give a more consolidated set of resources regarding these topics, below is a list of several of the most common ones, including links to relevant threads (chosen for this list according to the extent of discourse/advice given within them) and, where such a thing is possible, short summaries of commonly-given answers and advice that may be found in those threads. \nOn Life as an INTJ\nVery few of us completely fit the stereotypes!\nWhat is the meaning of life?  A thread, another thread \n\nTLDR: Most (though not all) of us have to create our own meaning.  There are a lot of different specific ways people go about that.\n\nDifficulty dealing with difficult emotions and overthinking things. \nDifficulty picking a college major\nCareer advice from fellow INTJs\nHandling the necessity to deal with people more than is comfortable in one’s day-to-day \nExperience of being a female INTJ \n\nTLDR: There are some common experiences unique to female INTJs due to the personality type’s clashing with the cultural norms and expectations surrounding Western femininity.  Far more detail available on the 2X_INTJ sub. \n\nWhat types of music do INTJs like?\n\nTLDR: All kinds.  Music preferences don’t seem to have much or anything to do with MBTI, but we have a good time swapping recommendations anyway…\nThread 1\nThread 2\nThread 3\nThread 4\n\nProductivity\nINTJs are prone to having a large variety of interests, some of which we will pursue to the level of obsession.  But many of us also experience difficulty in pushing our ideas and plans and projects to completion, whether they are necessary for school or work, or simply chosen on our own.\nWhen I’m stressed out, I get nothing done.  And when I get nothing done, I get even more stressed \nWhat are some good organizational tools/methods that people use? \nGeneral Interpersonal Communication\nSmooth and effective communication is a skill like any other - it’s rare that it comes very naturally to INTJs (at least, in communicating with people of other types), and there are several common themes:\nHandling small talk gracefully\nThings I say don’t tend to come out how I mean them\nBeing argumentative, being persuasive, and how those are frequently not the same thing\nReading nonverbal cues that indicate interest from others\nFriendships\nHow do I better go about making (1) them? (2)\nHow do I make them more satisfying and less superficial?\nHow do I maintain them once I’ve got them?\nRomantic relationships\nWhile this is a big topic of concern on the sub, it should be noted that many INTJs are comfortable in their lives without romantic relationships, and a theme not currently represented in the links below is that many of us feel social pressure to pursue such relationships when we may not care that much about them.  \nWhat INTJs wished they’d known before they started dating\nOther general relationship advice\nDifficulty forming deep connections in dating \nReading cues and working up the confidence to make a move \nDating ENFPs, specifically \nExperiences with INTJ-INTJ relationships \nPainful breakups \nDifficulty as a female INTJ (all generally applicable advice, but this thread specifically contains a lot of stories from INTJ ladies)\nNon-INTJs Relating to INTJs\nINTJs’ tendency toward outward stoicism, extreme independence, dislike of talking “just to talk,” and bluntness sometimes makes it a unique challenge for other types to be comfortable around us, particularly in romantic/dating scenarios.\nWhat kinds of special things could I do to celebrate a special occasion with my INTJ SO?\nIs this INTJ interested in me?  What about this one?\n\nTLDR: If you’re not already a serious couple and the INTJ is voluntarily interacting with you, they at the very least like you platonically.  If you think they’re flirting, more likely than not, you’re right.\n\nProblems in a relationship with an INTJ\nFemale INTJs and social norms in dating \n\nTLDR: Ew, social norms.\n\n\n"}, {"title": "What's your latest obsession? (self.intj)", "likes": "22", "comments": "60", "content": "~~~\nAs Always, we welcome ideas and comments of your own!\nFeel free to submit to me your own post like this \n\n"}]]}