{"data": [[{"title": "PSA: You are all moderators. (self.INTP)", "likes": "262", "comments": "95", "content": "To start off, I do think link flair is a good idea and makes it easy to quickly identify the type of discussions you want to read.  This is something that I will work on this week.  \nEvery once in a while there's a flare up of people asking for hands on moderation.\nI've said this from the very start when I was brought on as a moderator to do garbage duty with the spam queue and to add to the sidebar:\nI really don't care to police content, nor do I think omfgninja does.  There is no reason to on reddit; that's literally the whole point of the site and the reason user voting is such a popular format for content/discussion on the internet for the past few years.  It allows everyone to feel a degree of control and relevance regardless of whether they participate or contribute directly.  Invariably the content which is most popular with the largest amount of people will be the most successful. \nIf it really bothers you that someone is shitposting, or saying something that really rambles your jambourines, all it takes is 5 of you to downvote it and then no one else will have to see those hurtful words on their computer monitors.\nIf there is obvious spam, report it and I will 9/10 times see it within a day.  That's the most control I would ever see necessary for a select few people to have over the content on a broad discussion subreddit like this.  Who am I or anyone else to decide what the thousands of active members like to see?  \nFor the record, I hate circlejerky PersonalityCafe-esque shitposts such as:\n\nDAE THIS AN INTP THING?\nDO ANY OTHER INTPS HAVE A VERY DIFFICULT TIME BEING VERY SMART AND INTERACTING WITH OTHER HUMANS WHO ARE LESS SMART? \nMAN I HATE HOW SMART AND LAZY I AM.  WHY AM I NOT MAKING $150k A YEAR YET?\nWHAT IS OBJECTIVELY THE BEST CAREER FOR INTPS (ESPECIALLY ONES WHO ARE REALLY SMART BUT HATE DETAILS AND DISLIKE SOCIAL INTERACTION BUT LIKE LOGIC AND RATIONALITY)?\n\nThis type of shit is the worst on /r/INTJ.  It's not as bad here but it happens.  I still don't see any reason to remove it because if more people disliked it than it wouldn't have a positive score.  It really doesn't bother me to downvote something stupid and stop caring about it 10 seconds later.\ntl;dr: the moderation team here is literally fucking useless and don't even read the subreddit and just dont want to do any work.  i don't even think they have internet access.  honestly i hope they kill themselves IRL.  also, why am I not a moderator yet?  I read this subreddit LITERALLY more than anyone else, and one downvote isn't enough for me.  also, i called jungle in lobby and this guy instalocked without even saying anything WTF please all 9 report after game im way too sick of dealing with trolls in this game dude.  my teams always throw and i'd be like 5k mmr in dota, this game just has too many feeders.  i can't believe i'm being forced to play this stupid game.  i wish the guy with the gun here would just fucking leave.\n\n"}, {"title": "INTP subreddit chat (self.INTP)", "likes": "140", "comments": "88", "content": "It exists now.\n\n"}, {"title": "Stop playing the game (self.INTP)", "likes": "8", "comments": "8", "content": "I think I've realised something pretty important that I'd like to share with you guys and see what you think.\nI don't think people appreciate how subjective and vague language is -- especially written words. I think our interpretation of other's words isn't moderated by anything like 'truth', but rather I think it's largely influenced by how much we can empathise with the other person's opinion. No matter how logical one might feel their argument is, I think it's fundamentally indistinguishable from stupidity to those whose worldviews differ too greatly from your own. For this reason, thinking that people should agree with you because you feel you have a logical argument alone does little but cause friction. I think we feel anger towards those we disagree with simply because we cannot see how they could ever believe what we think they believe, and so I don't think the solution is to argue with them and try to change their mind through spewing one's opinion at them, but rather the only solution I see is to open-mindedly seek to understand their point of view. I don't think that the idea that \"they're wrong\" exists, you just personally fail to understand their point of view. If you feel you can empathise with them but still disagree with them, the only thing you can do is explain why you personally don't feel like you can agree, but this doesn't need any frustration or anger. Being honest, I wrote this to just clarify my own thoughts but I'll post it to see what you guys think. I'm desperately trying to figure out a way to avoid getting angry at people I'm talking with which I feel just leads to each person talking to themselves, and I think this is the best way to rationalise it. The idea of spewing ideas at each other which you're not trying to understand is the game I don't think anyone should be playing.\n\n"}, {"title": "Has any other INTP ever had a fictional affair with a stranger totally within their head? (self.INTP)", "likes": "5", "comments": "1", "content": "New account for obvious reasons.\nI’ve always had intricate complex recurring daydreams, but, they’ve always been solo.   I’ve never had one that involved anyone else, and to have one now that involves a romantic partner is messing with my mind.\nI’m married and I’ve never cheated (not even before on anyone else).  I’m not even that sexual, so this makes no sense.  Putting aside the moral implications, the sheer amount of effort required, for something as trivial as sex, would prevent me from doing this.\nI feel like I’m having a full blown mid-life existential crisis, and, have no idea how to deal with it.\nAnyone else experience this?\n\n"}, {"title": "Best INTJs In Your Life? (self.INTP)", "likes": 0, "comments": "1", "content": "Ok I'm gonna TRY to not write an essay but I know you guys can understand better than anyone if it happens anyway. Basically I want to ask about the INTJs in your life (if you have them) that help you keep yourself together. I don't know why the two types are so inexplicably drawn to each other like magnets but personally I know that one of my INTJ friends is the only reason I'm not behind in all of my classes now. Anyone else have similar relationships?\n\n"}, {"title": "A poetic description of INTP (self.INTP)", "likes": 0, "comments": "3", "content": "You are the rapid clicking of a Rubik’s cube under clever fingers, the glint of dark steel, the soft sigh of rain on concrete. You are the flash of unexpected rage, the sound of a chair scraping against the floor as it is pushed hastily back. You are the flipping pages of a textbook, and the squint of eyebrows while reading scrawled writing. It is no wonder that you love asking questions so much, INTP, for you yourself are a Question.\nSource\n\n"}, {"title": "Favorite shows growing up? (self.INTP)", "likes": 0, "comments": "1", "content": "I was mostly into Ben 10 and Avatar.\n\n"}], [{"title": "INTP but enjoy going out with people? (self.INTP)", "likes": "7", "comments": "10", "content": "Hello, tests keep telling me that I am INTP, which is kind of understandable. I'm more on the introverted side coupled with social anxiety, but there is something paradoxical about me. I don't like going outside unless I'm going with a friend or family. Currently I am trying to pick up skating so I'm desperately trying to persuade my brother to take it up too, so I won't be learning how to skate alone. Is there anyone else who is like this?\n\n"}, {"title": "Problems Integrating my Natural Personality into Fulfilling Work (Socio-Technically Introverted?) (self.INTP)", "likes": "3", "comments": "2", "content": "So I've figured some things out about myself and to start, I've broken some up activities into a few categories:\nTechnical: Learning guitar, Taking apart a computer and putting it back together, Untying a knot\nSocial: Tabling for an organization, Listening to people's problems (ie. customer service-type stuff), Generally socializing \nBoth+Theoretical: Cooking, Language learning, Consuming media and writing analyses\n​\nWith the more technically oriented activities, I have found that I can do them, and I can do them very well, (aside from certain process-oriented flaws like my perfectionist/completionist tendencies where I will focus too much on one particular part of the task and forget to move on or pace myself) but just because I am skilled and have the ability to doesn't mean it translates to enjoyment, quite the opposite actually, it's more of a numbness. I find extended, technical, object oriented tasks like deconstructing and reconstructing a computer for instance, force me to sit in this kind of hollowness I do not enjoy. I remember one time I was untying a knot in a piece of metal chain jewelry and I looked at the clock and around 45 minutes had passed. I go into this hyper focused Flow State in which I am able to do the task very well but I sort of disappear in a sense, and this is not fulfilling. Upon exiting I just feel like i'm in a sort of daze instead of any sort of tangible fulfillment, even if I had a good reason it just doesn't always feel 'worth it'.\n​\nThe exact opposite happens when I do tasks in the social category. I can perform them and I do have a sort of inherent desire to, as I find I am extremely empathetic and tend to consciously attempt to listen-to-understand instead of filtering conversation through my own desires and biases, as I see far too often, but I usually feel overwhelmed quite quickly. The strain of trying to juggle: avoiding social faux pas, not hurting people's feelings, trying to constantly deconstruct people's true intentions/hints, keeping the speaker-listener ratio balanced, being hyper aware of my appearance and body language, and so much more is emotionally (and egotistically?) exhausting, and I am not super proficient in it in practice. Noticing why people do what they do doesn't necessarily translate into being able to handle those situations efficiently, suavely and charismatically.\n​\nThey both make me feel as though I'm only using 'half of my brain' in a sense, and are never necessarily rewarding. But I seem to have have found the balance in activities like language learning, cooking, and writing media analyses.\nI found the reason that language learning is so natural and enjoyable to me is because of how dynamic it is. Dynamic in that it has the perfect balance of social, theoretical and technical processes. I can contemplate subtle nuances in human communication in order to understand the difference between synonyms, delve deep into grammar as a sub-system of communication and figure out how it works because it is interesting, I can emotionally and (socio-?)scientifically engage in media of different cultures, I can study people's idiosyncrasies and idiolects to understand what, why, and how they are talking, I can analyze social context and philosophies etc. Cooking is similar in that I get very clear personal and interpersonal gratification through physical pleasure, as well as the ability to endlessly experiment and integrate technical knowledge (cook times, flavor combinations, etc.) to a direct application. Same with media analyses, writing theories and thematic/character analyses, and comparing and discussing my ideas with others is very natural to me.\nI've been able to deduce that I really do enjoy socialization, and it is the foundational focus of pretty much everything I am interested in, but I like to engage in a more removed, technical-theoretical way. \n​\nThe problem at the moment is monetizability and how to achieve that. \nMy brain is made for coding. I do not want to code. \nI can not handle constant socialization.\nI pursed BAs in Writing and Communications because it made the most sense, but they have, as expected, only done so much, as I still feel rather unbalanced.\nSo how do I find those fulfilling, full-brain-and-heart in-betweens that actively and fully engage me?\nI've never been privy to the 'find your passion' and understand it is more about making one, nor do I agree with the complacent \"you don't have to enjoy what you do\" as now I've finally understood how I am fulfilled and want to pursue that to sustain myself. I just want to not be miserable, stuck doing something that only uses 'one half of my brain' in that sense. Or even worse, a bastardized technical version of the things that should be enjoyable (line cook for instance).  Suggestions or just general thoughts that might help me along?\n\n"}, {"title": "Favorite INTP antagonists in movies/series? (self.INTP)", "likes": "3", "comments": 0, "content": ""}, {"title": "What’s are the two most INTP things you’ve done in the past ten days? (self.INTP)", "likes": "24", "comments": "17", "content": "For the negative: I only just remembered that you actually have to verbalize complements to people. An individual with whom I have been friends for five years started blushing and crying today. I thought I had accidentally said something awful at first. But apparently that was the first complement I had said out loud to them, and apparently they had no idea that I actually appreciated their company. \nFor the positive: After hassling through my notes and getting over the euphoria of the Spinosaurus paper mid-week, I managed to make some ground on my own S. aegyptiacus paper. I may have figured out the hydrodynamics of the animal, and the paper is inbound...probably.\n\n"}, {"title": "Why he stop replying? (self.INTP)", "likes": 0, "comments": 0, "content": "So I have online friend, like more than four months now. We texted everyday. We had two almost one weeks break, one because of me and one because of him. We have been texting all days, most one never ending conversation. Just someone didn't respond at night/evening so we continued it at the morning and next days. But sometimes it was 3h at night and he was texting me 'goodnight' when I've need to sleep. In my side we had really good connection. But\nTwo days ago, our conversation was end after more than 2 hours fast texting and it ends his 'goodnight, sweet dreams' text. I text him again, in the evening next day, sending him 'hey with song I wanted him to listen link' but he didn't reply. It's not he's busy thing cause he's online almost all day and create posts but ignoring me as well. What went wrong? What should I do? I'm INTJ if it help or change something.\n\n"}, {"title": "Hey intps I uploded a new video on how I view infps as an enfj for anyone who can be interested in an infp this would be a video for you to give you insight on infps like comment subscribe thank you (self.INTP)", "likes": 0, "comments": 0, "content": "https://youtu.be/uPQ7jhweAAE\n\n"}, {"title": "Are you aware of your surroundings? (self.INTP)", "likes": 0, "comments": 0, "content": "Bullshit stereotypes aside please.\nAlso, don’t let your answer to the question determine whether or not you post your answer or not. I want a relatively accurate representation of the inclination of the type with reference to the inquiry.\nHow aware of your surroundings are you?\nIs it a conscious or subconscious type of attention?\n\n"}, {"title": "Does anyone else think of words weirdly? (self.INTP)", "likes": "14", "comments": "8", "content": "Idk why but sometimes I will think of some word and just say it over and over in my head while deconstructing it until it is meaningless and I then become kinda sick of the word for a few day, like stop, or bingo.\n\n"}, {"title": "Intp vs intj remorse (self.INTP)", "likes": "3", "comments": "9", "content": "Hey guys ...so do you even feel remorse or regret something ?? I think intjs have a very sensitive gauge as compare to intps in this domain. Whats your take on this?\n\n"}, {"title": "\"Your MBTI Type Can't Change\" Rant (self.INTP)", "likes": "7", "comments": "18", "content": "I'll keep it short and bitter. I think it's absolutely stupid when people say one's personality can't change. Their argument, \"oh, people can change over time, but that's just their iNfeRiOr fUncTIons dEVelOPing.\" Well, my friend who lacks critical thinking, if one can develop their inferior functions, what is stopping them from developing those and neglecting their superior functions to the point where their inferior ones become what is natural to them, and superior become unnatural? The problem is that people, even intuitives, are stuck in their ways to the point where they will never change. INTPs will keep utilizing Ti Ne because that is what's comfortable to them, so why change amirite? Hop on the Ti Ne bandwagon at a young age, Si and Fe therefore feel uncomfortable to increase later. Your personality type can change to the point where it's natural to be another type, it's just hard. Don't know why this is so controversial.\nAnother point I may address some other time is the newbies who think everyone only has 4 functions. Every person has every function. Even ExTPs utilize Fi (in fact, higher Fi than of course ExTJ, despite ExTJ \"haVInG fi\"). Because of this, an INTP can become an ESFP despite \"sharing none of the functions\" as people would say. Very extreme example of course, it would be a very rare occurrence because of the huge differences between these types. Still possible. People even say INTP and ESFJ aren't opposites because \"thEY shARe tHe sAmE fUnCTIons.\" Umm, no, the INTP likes using Ti Ne whereas ESFJ hates their use, and vice versa. You know what fuck this MBTI bullshit I'm going for a walk.\nTL;DR: Your natural personality can change, it just takes getting out of the comfort zone for a while. And everyone has every function as a bonus.\nEDIT: I'd like to keep replying, but it's 6 am so I'm going to bed.\n\n"}], [{"title": "Visit r/FollowThePunchline It’s a challenge where OP makes an unfunny incomplete joke and others need to make it really funny. (self.INTP)", "likes": "2", "comments": 0, "content": "r/FollowThePunchline\n\n"}, {"title": "Summoning INTP brethren. (self.INTP)", "likes": "6", "comments": "12", "content": "INTPs, when you guys talk about things which you're too much interested in and expel a lot of information in a short duration of time.\nAside from the frowning faces, do you often get being called \"creep\" or \"weird\" or something like that a lot?\n\n"}, {"title": "How did you finally start becoming successful (self.INTP)", "likes": "8", "comments": "5", "content": "Hey guys, I have recently just come to the conclusion that I lack the knowledge on how to be successful.  I am aware of the steps and this and that but I do not fully know how to convince myself to take those steps.  I want more than anything to have drive to achieve something but I cant focus my efforts on it.  I also can't find anything in the world I actually desire besides things unrelated to my professional life.  I did not have very much structure growing up and things came easy to me in school.  I never had to study until about high school then I realized i couldn't do everything in my head anymore.  Instead of learning to study I just gave up.  I recently just ended my contract in the military and decided to become and engineer but after realizing the rigor that an engineering degree entails I switch to finance.  I am still a finance major but am not sure i'm making the right choice.  I do not particularly have any interest in anything that can provide an income.  \nI guess my question is, for those INTPs who dealt with this at a younger age.  What happened that you finally understood how to want to become successful.  Thanks guys I hope I didn't ramble too much!\n\n"}, {"title": "Food for thought (self.INTP)", "likes": "2", "comments": 0, "content": "So I just got done watching a extraordinary YouTube video, possibly one of my favorites of all time.\nThe video was a about a extra feature of a anime called cowboy bebop, I'm sure most of you either watched it or at least now about it and its splendors.\nHowever, this video is a compilation of a bunch of narrative quotes from the 4 main characters basically expressing their philosophical perspectives on life in general and I couldn't help but to be moved by some of those wise statements. \nI just think most of you guys would really appreciate this gem and could possibly also be just as moved as I was by it. So pleas check it out. \nhttps://youtu.be/DwQqTpo83Nc\n\n"}, {"title": "INTP and stress (self.INTP)", "likes": "3", "comments": "1", "content": "Have anyone of you guys told your professor or boss about you being an INTP who unless until isn't pressurized won't stick to a plan and finish stuff. \nI mean do you guys keep people as beacons which would timely message you and keep your momentum intact so you don't fall back into your unproductive zone of doing nothing?\n\n"}, {"title": "Am I an INTP or ISTJ? (self.INTP)", "likes": "4", "comments": "20", "content": "I only want to know because one's really good at accounting and the other isn't, and I plan on becoming an accountant. Do you think you guys could tell based on these characteristics.\n\nI'm constantly living in my own head, usually thinking about films or other people.\nI procrastinate a lot, but I still manage to get really good grades in school.\nI have horrible eye contact and trouble keeping a conversation going.\nI'm good at math, and I enjoy solving problems that I know how to do. I find it satisfying.\nI think about philosophy and art a lot.\nI have pretty bad OCD.\nI act strange around people I don't know (staring, weird mannerisms, etc.)\n\nThank you for your help!!!\n\n"}, {"title": "This sub is just (self.INTP)", "likes": "3", "comments": "4", "content": "OP: Asking a question & giving an example.\nINTP’s: Giving their opinion on OP’s example and not answering the question.\n\n"}, {"title": "Calling all Downvoters (self.INTP)", "likes": "1", "comments": "4", "content": "Most of the memes and gifs posted in this sub are stupid and irrelevant. I wouldn't be surprised if it's just bots farming karma. Please downvote more often.\n\n"}], [{"title": "Is it normal to have feelings as an INTP-T (self.INTP)", "likes": "5", "comments": "10", "content": "I can't say I have no feelings, I can manage them and keep my life going on. Don't let my feelings control my life.\nBut recently something different's been going on. My crush started dating my best friend, I'm trying to forget them but I can't stop thinking about them. I don't cry or I still don't let it stop me from doing my daily chores but it makes me avoid them. \nI mean, yeah I can write essays but I can't stop thinking about them. I started questioning my being an INTP tho, why I give a damn about such childish thing? Am I an INFP in the deep. I'm so confused.\n\n"}, {"title": "Any other INTPs awful at flirting? (self.INTP)", "likes": "15", "comments": "18", "content": "So I don’t know if it’s just me but whenever someone flirts with me or compliments me I literally have no clue what to do. Saying thank you comes off as super un-flirty and ‘dry’ so I usually laugh because I literally don’t know what to say. Does anyone else struggle with this?\n\n"}, {"title": "I'm curious if there are any truly happy INTPs? (self.INTP)", "likes": "3", "comments": "16", "content": "I was truly happy with life for 2 nights in a row, and then depression hit full force again the next night.  I had never experienced anything like it before, and I can say  it's the first time I've ever been truly happy, not just excited about something.  While the conditions of my life were complicated, there was no major changes in my situation.  The experience blew me away, and had me wondering if any other INTPs are regularly happy.  \nI was going through a phase where I needed to rest my mind - I accomplished housework and other little stuff, shut my brain off in the evening, and was truly, blissfully happy.  And then my mental needs emerged with a vengeance and the lack of mental stimulation on a daily basis drove me to despair... somebody tell me they've figured it out.  I spend most days wishing I could euthanize part of my brain.\nView Poll\n\n"}, {"title": "Books. (self.INTP)", "likes": "4", "comments": "6", "content": "Need recommendations on books.\n\n"}, {"title": "new mbti discord server (self.INTP)", "likes": "5", "comments": 0, "content": "hi:) i made a new mbti discord server and we don’t have many intps.  come represent your type and get to know other types! https://discord.gg/kzyvfb\n\n"}, {"title": "Have you found your talent? Then, How? (self.INTP)", "likes": "6", "comments": "8", "content": ""}, {"title": "Have any of you guys been creating systems for life? It literally makes you go ENTJ mode. Once everything \"clicks\" and you ask why enough for every aspect of your life... you have a logical purpose tailored to you. (self.INTP)", "likes": "6", "comments": "1", "content": "For example:\nYou ask why why why about reality. You come to the conclusion that everything is subjective.\nSo you have two options: end it all or choose to live.\nOkay why do I want to survive over ending it all? Well, probably because I'm conditioned for it biologically but also because I rather enjoy life, despite all the bullshit. Okay, so how I can make it more fullfilling and enjoyable? Let's see...by developing coping mechanisms? Okay, so why don't I just use any coping mechanism? I like lying down and eating junk food and scratching my ass and not doing shit. Isn't that a coping mechanism? But... what's the most beneficial mechanism for me to cope with reality and provides the most output for input? A healthy coping mechanism. What's the difference in terms of coping? It feels better, and it lasts longer, but it takes more focused effort.\nWhat's the healthiest coping mechanism? Creating a purpose. How can I do that? Well, what drives me? I'm an INTP...think. The thing that drives me is absorbing knowledge infinitely. Okay, how can I turn that into a purpose? Let's see... how about becoming my own subject to learn from and experiment on? Humans are so complex, I'll die before I figure it all out. Okay, and how can I learn infinitely about myself for as long as I live? By making that my purpose. My purpose in life now is to keep evolving myself infinitely. And it doesn't matter that everything along with my purpose is subjective and meaningless, because the reason why I do it is that it's logical and is the most efficient path. It also feels pretty damn rewarding. For my specific way of life, any other path is irrational. It's not grounded in reality. They're fluff possibilities.\nSo from this already, I've already beat nihilism. This is literally what conquered depression for me.... creating a logical system. NOTHING ELSE. The emotional regulation techniques came afterwards. Maybe it's thanks to introverted thinking, and I don't want to be one of those online bullshitters that comes up with \"just don't be depressed broooo/guuuurl\", but I believe that as INTPs, we can use our worst enemy and turn it into a biggest tool to grow. I just had to make sense of it. At least for myself, this isn't some eureka to beat nihilism for everyone... but it WORKS. Logic is ultimately about what works. If the thing that guide our reality is logic, we can twist it rationally to make reality our bitch.\nAnd I apply this same rationality for everything. Then it just \"makes sense\" and no time is spent overthinking because flaws for yourself are accounted for. And you build and branch from there.\n\n"}, {"title": "Thoughts on Getting Written Letters as an INTP (self.INTP)", "likes": "2", "comments": "6", "content": "TL:DR- Thoughts on getting a written letter from a close friend…. Too cliche? How personal would you want it to be?? Would it make you feel like they cared???  Would you prefer verbal????  If the person has expressed previous feelings for you, would you find it too forward or awkward?????\n​\nFor context, we’ve known each other for years, but about a month ago I confessed my feelings for him and explained how I had never said it before because I did not want it to be awkward between us. He said we should not make it awkward and stay good friends. However, since that day he has completely changed for the better. He initiates contact everyday for us to get together, has opened up more than ever about his future/feelings, and is all around just kinder to me. There's a chance we may not see each other again and he has admitted he is sad to leave me, but he has said multiple times he could never do long distance (I think is honestly the reason he did not want to move forward). \nThe thought of never seeing him again is overwhelming, and I guess I just want to reiterate to him how important he is to me and how much I care about him.  I am not the best at expressing my feelings verbally, so I feel I would do better writing them down, but I don’t want him to take it as some desperate attempt of me trying to manipulate him into feeling something more. Or for him to think I am being too sappy by writing a letter. As much as I care about him, I ultimately want him to be happy whether it's with me or someone else and I don’t want him to think I am overly attached. \nAnyway, thank you for any advice and sorry for my overthinking rant... :)\n\n"}], [{"title": "INTPs with INFJ SOs, how did you meet? (self.INTP)", "likes": "2", "comments": "1", "content": ""}, {"title": "Any other INTPs disgusted at all the people who just have to make plans and get together in groups during this pandemic ? (self.INTP)", "likes": "2", "comments": "6", "content": ""}, {"title": "Did anyone else think that they were asexual for a long time ? Or is it just a me thing.. lol (self.INTP)", "likes": "11", "comments": "9", "content": ""}, {"title": "Disrespectful mother talks over me/yells at me in front of other adults and I’m 31? (self.INTP)", "likes": "1", "comments": "7", "content": "I unfortunately live with my mother because I cannot fully afford the down payment on a home right now. She has also retired/is about to divorce and I am responsible for paying the bills and tax payment for the home since she is only living on pension and social security. She treats me like I’m a little child and belittles me or commands me in front of other people. Or will tell me to follow her around like I’m a dog. It’s driving me nuts because she doesn’t not respect me at all. What do I do?\n\n"}, {"title": "Quiz to find friends who have the same personality!! (self.INTP)", "likes": "9", "comments": "2", "content": "I have finally found it! I feel like I have been searching for something like this for months! It started when I was browsing online on 'how to make new friends', as I am new to London. Then after some research I learnt that the best friendships are formed when there is a shared value system - because there is a sense that you both look out to the world with a similar set of eyes. Now the question is, how do I find people who share my values?? I could only find tests online that told me my own personality or MBTI ...\nThen, I came across this quiz - you take it and it connects you with people who have the same personality as yourself in your local area!\nI'd appreciate if this got upvoted so more of us can meet people who we really click with :)\nAfter all, having strong social connections is so crucial to our happiness! In the Harvard Study of Adult Development – one of the longest studies of adult life (running since 1938) – it was shown that it is the strength of our social connections that has the largest influence on our happiness. So lets help each other and create meaningful friends!\n\n"}, {"title": "I'm mad I tell you. Completely bonkers. (self.INTP)", "likes": "2", "comments": "1", "content": "I used to think that S's were the most troublesome to get along with.\nThey aren't.\nIt's people who have to Te every possible action and every possible consequence before deciding what to do during a round of combat in D&D, and do this every turn despite the available actions and consequences not changing significantly from turn to turn.\n\n"}], [{"title": "Develop your internal intuition to get shit done. (self.INTP)", "likes": "4", "comments": "1", "content": "Learn chess to develop Ni.\nGo to https://lichess.org/ and start with basics.\nTry to find the solution purely with your inner eye. That is periodically you'll see yourself slip to verbal reasoning. Stop it when that happens and visualize the options with your inner eye. At first this will become tiring quick. Take a break and come back to it after a bit. Once you get the idea, try to do it in a relaxed manner instead of the intense focus that you had to start with. Let it develop and see things at its own pace. Make it fun.\nThe benefit is as soon as you have a desire to do something in your mind, your mind will figure out how to do it and will get on with it without skipping a beat. You'll see the results in the same day.\nBest.\n\n"}, {"title": "Opinions on INFJ? (self.INTP)", "likes": "2", "comments": "5", "content": "Hi INFJ here! I was reading up on INTPs and INFJs, so i wanted to ask y'all if you know any INFJs and what you think of them? I haven't had the pleasure of meeting an INTP yet so I'm counting on you guys for answers :) Thanks!\n\n"}, {"title": "MBTI is the Car, Enneagram is the Driver, and Hexaco is the Destination. (self.INTP)", "likes": "3", "comments": "1", "content": "Hexaco is actually scientifically used and can give you your exact results in the present moment, and MBTI and Enneagram are more observable/anecdotal but they make logical sense. Even if they're \"off the mark\", MBTI (how you percieve and judge the world) and Enneagram (how you process trauma and how it impacts fears/desires) are still powerful tools through which you can navigate towards your ideal destination which is going from your current Hexaco score on a spectrum, towards your ideal one. You use your MBTI and Enneagram types (after a SERIOUS understanding of how it works, not just a few tests you did that don't encompass mistypes), then use your MBTI/Enneagram strengths and accounts for the weaknesses to increase your Hexaco score in the ideal direction of your choice. The only one you can't is extrovertedness, but you could still simulate being an ambivert with serious work and pushing how you manage your energy.\n\n"}, {"title": "How much do you think the \"confirmation bias\" affects you as an INTP? (self.INTP)", "likes": "4", "comments": "6", "content": "View Poll\n\n"}, {"title": "How do you cope? (self.INTP)", "likes": "5", "comments": "20", "content": "Lately I’ve been bringing up so big topics to my friends that I have spent a lot of time researching and teaching about. My stance is firm and won’t change simply because the other argument just has to many flaws and can’t be logically explained. But they say I’m dumb and don’t know what I’m talking about yet I’ve spent massive amounts of time coming to a logical conclusion. Yet they won’t even take a minute to think for themselves and blindly follow what’s “accepted”. Like how does someone just accept anything as truth without questioning it and then have the nerve to say I’m dumb when I understand the topic more than they could even comprehend. \nEssentially why don’t people think logically. Sorry this post is kinda pointless in just really upset that I know the truth and it’s just dismissed.\n\n"}, {"title": "How do you feel about groupchats with colleagues/classmates? (self.INTP)", "likes": "2", "comments": "4", "content": "Do you feel comfortable with them more than face-to-face talking? What about Facetiming or zoom meetings?\n\n"}, {"title": "Self-Monitoring Mode vs. INTP Mode (self.INTP)", "likes": "15", "comments": "2", "content": "When I regularly treat my life seriously and approach it through a self-help lens, and am going outside: I follow a schedule. I also journal regularly and find patterns in my thought and emotions, I get myself feeling positive emotions before interacting, am more conscious of others' needs and am very empathetic, I don't care what people think about me while still being considerate towards them, I dress as a way to represent my inner self, I actually care how I present myself, I speak with sub-text, I'm very hygenic, I make sure to be a good listener, I do something for others and reach out to them regularly, I am aware of my surroundings and meditate, I'm aware of exactly how I feel and how it's portrayed, I'm patient with people and smile around them to give positive vibes etc. This mode takes self-regulating myself every day, literally treating how I live my life as a process that I moderate.\nWhen I live in my normal mode and I'm in INTP research mode (like during this quarantine, where I let go and am being my 100% \"naturally-oriented\" self): I'm offensive as fuck, I just vomit my thoughts, I enjoy pissing people off that don't make sense and get a rise out of it (it's foolish but it's how my wiring works when I'm in my \"base-level\" mode), I shower once every few days, I speak out loud to myself, my hair is a mess, I forget tasks and chores, I consume info (books/videos/articles) and come up with theories and systems, I get eureka moments where I laugh like a crazy person then I find a flaw in what I came up with and get really depressed, I'm on edge and annoyed with everything and everyone, I keep a perpetual moderate cold look or frown on my face, I'm not aware of how I'm coming off and I lose sight of my feelings, I'm more easily offended or combative if I think someone's being dumb etc.\n\n"}, {"title": "Stereotyping, man (self.INTP)", "likes": "3", "comments": "1", "content": "Why is everyone calling me a weeb? And a bookworm..? I honestly find anime extremely boring and reading is just unbearable.\n\n"}, {"title": "What was/is your studying style in HS/college? (self.INTP)", "likes": "2", "comments": "2", "content": "So, first of all, I'm not that sure about being an INTJ or an INTP and that's mostly because of my approach to studying and related things to it.\nI was quite good at HS, my average was an A when I finished it but the way I did was quite weird.So, in middle school, I didn't skip many classes, at least as far as I remember and I was rather a C/B student than an A student. I got how things worked fully by the time I entered my HS, well, I always knew how they were but I just decided to change my attitude to it. My school didn't care that much about the attendance rate but about their student's grade rate, so I decided to skip pretty much often, I skipped like 30-35% of my last school year. First of all, I found it quite easy to study subjects at high school, so anytime I attended classes I answered them, sometimes without preparing, sometimes studying during the class or just before it. Everything was relatively easy, even exams were so. I was sitting rather in the first row or in the last: In the first case because I wanted to interact with my teacher well, in the second case because 2 of my friends were always sitting there. The reason why I was skipping was that I hated going there, I didn't hate the process of sitting there and just being there, I didn't hate my school itself. I just hated that I have to waste my time on it because I could do other things that were more interesting to me and I could simply better take some sleep than going there. I was self-teaching myself. I sure knew I wanted to enter university so I was preparing on my own. I never learnt English at my school, in middle school I got a C on that but when I started learning it on my own I easily got an A. I prepared for all my exams on my own and got As on them. My parents decided to send me to additional lessons with private teachers but I hated the idea and eventually managed to talk them out from that.\nSo I managed to enter one of the top unis in my country so I felt rather happy about it but I wasn't that glad about my majors. It's regional science while I'd like to code more. Anyways, I took first weeks quite serious to understand how It works and what I will do and It seemed the same as easy as It was in my HS. I sit rather in the first or the second row, the same reason as It was. I skip a lot, uni stated that students mustn't skip more than 36h in a term but I realized It was not that true. If my grades are fine and I don't skip too much, I'm safe. So I skipped about 60h-70h in my first midterm and nothing happened, I closed my exams A-B-A-A. But It's this year, I actually entered my uni a year before but I took a year off because I was stupid, I won't deny it. My grades were fine and I skipped pretty the same but I was failing my german language, although anything would tell It was that big of a problem but I felt depressed that year, there were reasons for that but still It was rather stupid. After that, I started feeling insecure as hell about studying: I always feel like I can be expelled and that's really not on my plan. This year my grades are fine but my new language class (which is Korean) makes me feel insecure, that's the only subject I got a bad grade (E). I still don't study for my classes pretty much at all and especially since It's online classes now. I always cheat on or slam off everything I'm given to do. I do that because I know It'll work. I knew how to trick on the anti-plagiarism system so all my papers are not actually mine but the system never found it out so I got all As on them. I always find short-ways to do my homework, like, I do my Korean home literally just translating things in google, changing some words to those that are supposed to be used (I just cntr+F our book) and then give it to Koreans in a discord server to check it. I actually did my translation test exactly like that I got my first C+ on Korean (before It was F-D). I realize I should study it and I do but It's not that easy, unfortunately, so I set up a plan that I have to study Korean every day for 2 hours. I'm just bad at memorizing stuff from doing the same thing again and again (remote memory), I wouldn't say that I get things through practicing either. I understand it conceptually, I know-how It should be but because of not remembering all stuff at once I suck at it.\nSo I know what I want from it, I wouldn't say I don't care about my grades (although I often say it irl but more in an ironic way). I'd even say I want to be an A student but because of my Korean and PE, oh yes, I forgot about PE classes, yes, they also influence our grade and they're obligatory, the attendance rate is the grade of this crappy subject and what do you think I got on that? a D for sure. So due to some reasons, my average in the first midterm was a C++. I also code and I strive for learning it fully and I want to try it as a job. So I want to do completely not what I'm studying but I'll still do that to feel safe. It's due to many reasons I planned for my future.\nAbout how I sit in classes, well, usually I dream away and my attention is the worst thing here. Even if I try to focus, later on, I forget about focusing. I might have ADHD but I don't think I will see some therapy.\nYet I forgot to mention how I hate PE, that's just pointless for me and that's all.\nSo that's pretty much it. Would you relate to it? And probably give some advice on how to not being unproductive?\n\n"}], [{"title": "What’s are the two most INTP things you’ve done in the past ten days? (self.INTP)", "likes": "24", "comments": "17", "content": "For the negative: I only just remembered that you actually have to verbalize complements to people. An individual with whom I have been friends for five years started blushing and crying today. I thought I had accidentally said something awful at first. But apparently that was the first complement I had said out loud to them, and apparently they had no idea that I actually appreciated their company. \nFor the positive: After hassling through my notes and getting over the euphoria of the Spinosaurus paper mid-week, I managed to make some ground on my own S. aegyptiacus paper. I may have figured out the hydrodynamics of the animal, and the paper is inbound...probably.\n\n"}, {"title": "Does anyone else think of words weirdly? (self.INTP)", "likes": "14", "comments": "8", "content": "Idk why but sometimes I will think of some word and just say it over and over in my head while deconstructing it until it is meaningless and I then become kinda sick of the word for a few day, like stop, or bingo.\n\n"}, {"title": "Stop playing the game (self.INTP)", "likes": "9", "comments": "8", "content": "I think I've realised something pretty important that I'd like to share with you guys and see what you think.\nI don't think people appreciate how subjective and vague language is -- especially written words. I think our interpretation of other's words isn't moderated by anything like 'truth', but rather I think it's largely influenced by how much we can empathise with the other person's opinion. No matter how logical one might feel their argument is, I think it's fundamentally indistinguishable from stupidity to those whose worldviews differ too greatly from your own. For this reason, thinking that people should agree with you because you feel you have a logical argument alone does little but cause friction. I think we feel anger towards those we disagree with simply because we cannot see how they could ever believe what we think they believe, and so I don't think the solution is to argue with them and try to change their mind through spewing one's opinion at them, but rather the only solution I see is to open-mindedly seek to understand their point of view. I don't think that the idea that \"they're wrong\" exists, you just personally fail to understand their point of view. If you feel you can empathise with them but still disagree with them, the only thing you can do is explain why you personally don't feel like you can agree, but this doesn't need any frustration or anger. Being honest, I wrote this to just clarify my own thoughts but I'll post it to see what you guys think. I'm desperately trying to figure out a way to avoid getting angry at people I'm talking with which I feel just leads to each person talking to themselves, and I think this is the best way to rationalise it. The idea of spewing ideas at each other which you're not trying to understand is the game I don't think anyone should be playing.\n\n"}, {"title": "How did you finally start becoming successful (self.INTP)", "likes": "8", "comments": "5", "content": "Hey guys, I have recently just come to the conclusion that I lack the knowledge on how to be successful.  I am aware of the steps and this and that but I do not fully know how to convince myself to take those steps.  I want more than anything to have drive to achieve something but I cant focus my efforts on it.  I also can't find anything in the world I actually desire besides things unrelated to my professional life.  I did not have very much structure growing up and things came easy to me in school.  I never had to study until about high school then I realized i couldn't do everything in my head anymore.  Instead of learning to study I just gave up.  I recently just ended my contract in the military and decided to become and engineer but after realizing the rigor that an engineering degree entails I switch to finance.  I am still a finance major but am not sure i'm making the right choice.  I do not particularly have any interest in anything that can provide an income.  \nI guess my question is, for those INTPs who dealt with this at a younger age.  What happened that you finally understood how to want to become successful.  Thanks guys I hope I didn't ramble too much!\n\n"}, {"title": "\"Your MBTI Type Can't Change\" Rant (self.INTP)", "likes": "7", "comments": "18", "content": "I'll keep it short and bitter. I think it's absolutely stupid when people say one's personality can't change. Their argument, \"oh, people can change over time, but that's just their iNfeRiOr fUncTIons dEVelOPing.\" Well, my friend who lacks critical thinking, if one can develop their inferior functions, what is stopping them from developing those and neglecting their superior functions to the point where their inferior ones become what is natural to them, and superior become unnatural? The problem is that people, even intuitives, are stuck in their ways to the point where they will never change. INTPs will keep utilizing Ti Ne because that is what's comfortable to them, so why change amirite? Hop on the Ti Ne bandwagon at a young age, Si and Fe therefore feel uncomfortable to increase later. Your personality type can change to the point where it's natural to be another type, it's just hard. Don't know why this is so controversial.\nAnother point I may address some other time is the newbies who think everyone only has 4 functions. Every person has every function. Even ExTPs utilize Fi (in fact, higher Fi than of course ExTJ, despite ExTJ \"haVInG fi\"). Because of this, an INTP can become an ESFP despite \"sharing none of the functions\" as people would say. Very extreme example of course, it would be a very rare occurrence because of the huge differences between these types. Still possible. People even say INTP and ESFJ aren't opposites because \"thEY shARe tHe sAmE fUnCTIons.\" Umm, no, the INTP likes using Ti Ne whereas ESFJ hates their use, and vice versa. You know what fuck this MBTI bullshit I'm going for a walk.\nTL;DR: Your natural personality can change, it just takes getting out of the comfort zone for a while. And everyone has every function as a bonus.\nEDIT: I'd like to keep replying, but it's 6 am so I'm going to bed.\n\n"}, {"title": "INTP but enjoy going out with people? (self.INTP)", "likes": "5", "comments": "10", "content": "Hello, tests keep telling me that I am INTP, which is kind of understandable. I'm more on the introverted side coupled with social anxiety, but there is something paradoxical about me. I don't like going outside unless I'm going with a friend or family. Currently I am trying to pick up skating so I'm desperately trying to persuade my brother to take it up too, so I won't be learning how to skate alone. Is there anyone else who is like this?\n\n"}, {"title": "Summoning INTP brethren. (self.INTP)", "likes": "7", "comments": "12", "content": "INTPs, when you guys talk about things which you're too much interested in and expel a lot of information in a short duration of time.\nAside from the frowning faces, do you often get being called \"creep\" or \"weird\" or something like that a lot?\n\n"}], [{"title": "Is it normal to have feelings as an INTP-T (self.INTP)", "likes": "6", "comments": "10", "content": "I can't say I have no feelings, I can manage them and keep my life going on. Don't let my feelings control my life.\nBut recently something different's been going on. My crush started dating my best friend, I'm trying to forget them but I can't stop thinking about them. I don't cry or I still don't let it stop me from doing my daily chores but it makes me avoid them. \nI mean, yeah I can write essays but I can't stop thinking about them. I started questioning my being an INTP tho, why I give a damn about such childish thing? Am I an INFP in the deep. I'm so confused.\n\n"}, {"title": "new mbti discord server (self.INTP)", "likes": "5", "comments": 0, "content": "hi:) i made a new mbti discord server and we don’t have many intps.  come represent your type and get to know other types! https://discord.gg/kzyvfb\n\n"}, {"title": "Have you found your talent? Then, How? (self.INTP)", "likes": "5", "comments": "8", "content": ""}, {"title": "Has any other INTP ever had a fictional affair with a stranger totally within their head? (self.INTP)", "likes": "4", "comments": "1", "content": "New account for obvious reasons.\nI’ve always had intricate complex recurring daydreams, but, they’ve always been solo.   I’ve never had one that involved anyone else, and to have one now that involves a romantic partner is messing with my mind.\nI’m married and I’ve never cheated (not even before on anyone else).  I’m not even that sexual, so this makes no sense.  Putting aside the moral implications, the sheer amount of effort required, for something as trivial as sex, would prevent me from doing this.\nI feel like I’m having a full blown mid-life existential crisis, and, have no idea how to deal with it.\nAnyone else experience this?\n\n"}, {"title": "Am I an INTP or ISTJ? (self.INTP)", "likes": "4", "comments": "20", "content": "I only want to know because one's really good at accounting and the other isn't, and I plan on becoming an accountant. Do you think you guys could tell based on these characteristics.\n\nI'm constantly living in my own head, usually thinking about films or other people.\nI procrastinate a lot, but I still manage to get really good grades in school.\nI have horrible eye contact and trouble keeping a conversation going.\nI'm good at math, and I enjoy solving problems that I know how to do. I find it satisfying.\nI think about philosophy and art a lot.\nI have pretty bad OCD.\nI act strange around people I don't know (staring, weird mannerisms, etc.)\n\nThank you for your help!!!\n\n"}, {"title": "Books. (self.INTP)", "likes": "4", "comments": "6", "content": "Need recommendations on books.\n\n"}, {"title": "Best INTJs In Your Life? (self.INTP)", "likes": 0, "comments": "1", "content": "Ok I'm gonna TRY to not write an essay but I know you guys can understand better than anyone if it happens anyway. Basically I want to ask about the INTJs in your life (if you have them) that help you keep yourself together. I don't know why the two types are so inexplicably drawn to each other like magnets but personally I know that one of my INTJ friends is the only reason I'm not behind in all of my classes now. Anyone else have similar relationships?\n\n"}, {"title": "A poetic description of INTP (self.INTP)", "likes": 0, "comments": "3", "content": "You are the rapid clicking of a Rubik’s cube under clever fingers, the glint of dark steel, the soft sigh of rain on concrete. You are the flash of unexpected rage, the sound of a chair scraping against the floor as it is pushed hastily back. You are the flipping pages of a textbook, and the squint of eyebrows while reading scrawled writing. It is no wonder that you love asking questions so much, INTP, for you yourself are a Question.\nSource\n\n"}, {"title": "Favorite shows growing up? (self.INTP)", "likes": 0, "comments": "1", "content": "I was mostly into Ben 10 and Avatar.\n\n"}, {"title": "Problems Integrating my Natural Personality into Fulfilling Work (Socio-Technically Introverted?) (self.INTP)", "likes": "3", "comments": "2", "content": "So I've figured some things out about myself and to start, I've broken some up activities into a few categories:\nTechnical: Learning guitar, Taking apart a computer and putting it back together, Untying a knot\nSocial: Tabling for an organization, Listening to people's problems (ie. customer service-type stuff), Generally socializing \nBoth+Theoretical: Cooking, Language learning, Consuming media and writing analyses\n​\nWith the more technically oriented activities, I have found that I can do them, and I can do them very well, (aside from certain process-oriented flaws like my perfectionist/completionist tendencies where I will focus too much on one particular part of the task and forget to move on or pace myself) but just because I am skilled and have the ability to doesn't mean it translates to enjoyment, quite the opposite actually, it's more of a numbness. I find extended, technical, object oriented tasks like deconstructing and reconstructing a computer for instance, force me to sit in this kind of hollowness I do not enjoy. I remember one time I was untying a knot in a piece of metal chain jewelry and I looked at the clock and around 45 minutes had passed. I go into this hyper focused Flow State in which I am able to do the task very well but I sort of disappear in a sense, and this is not fulfilling. Upon exiting I just feel like i'm in a sort of daze instead of any sort of tangible fulfillment, even if I had a good reason it just doesn't always feel 'worth it'.\n​\nThe exact opposite happens when I do tasks in the social category. I can perform them and I do have a sort of inherent desire to, as I find I am extremely empathetic and tend to consciously attempt to listen-to-understand instead of filtering conversation through my own desires and biases, as I see far too often, but I usually feel overwhelmed quite quickly. The strain of trying to juggle: avoiding social faux pas, not hurting people's feelings, trying to constantly deconstruct people's true intentions/hints, keeping the speaker-listener ratio balanced, being hyper aware of my appearance and body language, and so much more is emotionally (and egotistically?) exhausting, and I am not super proficient in it in practice. Noticing why people do what they do doesn't necessarily translate into being able to handle those situations efficiently, suavely and charismatically.\n​\nThey both make me feel as though I'm only using 'half of my brain' in a sense, and are never necessarily rewarding. But I seem to have have found the balance in activities like language learning, cooking, and writing media analyses.\nI found the reason that language learning is so natural and enjoyable to me is because of how dynamic it is. Dynamic in that it has the perfect balance of social, theoretical and technical processes. I can contemplate subtle nuances in human communication in order to understand the difference between synonyms, delve deep into grammar as a sub-system of communication and figure out how it works because it is interesting, I can emotionally and (socio-?)scientifically engage in media of different cultures, I can study people's idiosyncrasies and idiolects to understand what, why, and how they are talking, I can analyze social context and philosophies etc. Cooking is similar in that I get very clear personal and interpersonal gratification through physical pleasure, as well as the ability to endlessly experiment and integrate technical knowledge (cook times, flavor combinations, etc.) to a direct application. Same with media analyses, writing theories and thematic/character analyses, and comparing and discussing my ideas with others is very natural to me.\nI've been able to deduce that I really do enjoy socialization, and it is the foundational focus of pretty much everything I am interested in, but I like to engage in a more removed, technical-theoretical way. \n​\nThe problem at the moment is monetizability and how to achieve that. \nMy brain is made for coding. I do not want to code. \nI can not handle constant socialization.\nI pursed BAs in Writing and Communications because it made the most sense, but they have, as expected, only done so much, as I still feel rather unbalanced.\nSo how do I find those fulfilling, full-brain-and-heart in-betweens that actively and fully engage me?\nI've never been privy to the 'find your passion' and understand it is more about making one, nor do I agree with the complacent \"you don't have to enjoy what you do\" as now I've finally understood how I am fulfilled and want to pursue that to sustain myself. I just want to not be miserable, stuck doing something that only uses 'one half of my brain' in that sense. Or even worse, a bastardized technical version of the things that should be enjoyable (line cook for instance).  Suggestions or just general thoughts that might help me along?\n\n"}, {"title": "Favorite INTP antagonists in movies/series? (self.INTP)", "likes": "3", "comments": 0, "content": ""}, {"title": "Intp vs intj remorse (self.INTP)", "likes": "3", "comments": "9", "content": "Hey guys ...so do you even feel remorse or regret something ?? I think intjs have a very sensitive gauge as compare to intps in this domain. Whats your take on this?\n\n"}], [{"title": "INTP and stress (self.INTP)", "likes": "3", "comments": "1", "content": "Have anyone of you guys told your professor or boss about you being an INTP who unless until isn't pressurized won't stick to a plan and finish stuff. \nI mean do you guys keep people as beacons which would timely message you and keep your momentum intact so you don't fall back into your unproductive zone of doing nothing?\n\n"}, {"title": "This sub is just (self.INTP)", "likes": "3", "comments": "4", "content": "OP: Asking a question & giving an example.\nINTP’s: Giving their opinion on OP’s example and not answering the question.\n\n"}, {"title": "I'm curious if there are any truly happy INTPs? (self.INTP)", "likes": "3", "comments": "16", "content": "I was truly happy with life for 2 nights in a row, and then depression hit full force again the next night.  I had never experienced anything like it before, and I can say  it's the first time I've ever been truly happy, not just excited about something.  While the conditions of my life were complicated, there was no major changes in my situation.  The experience blew me away, and had me wondering if any other INTPs are regularly happy.  \nI was going through a phase where I needed to rest my mind - I accomplished housework and other little stuff, shut my brain off in the evening, and was truly, blissfully happy.  And then my mental needs emerged with a vengeance and the lack of mental stimulation on a daily basis drove me to despair... somebody tell me they've figured it out.  I spend most days wishing I could euthanize part of my brain.\nView Poll\n\n"}, {"title": "Why he stop replying? (self.INTP)", "likes": 0, "comments": 0, "content": "So I have online friend, like more than four months now. We texted everyday. We had two almost one weeks break, one because of me and one because of him. We have been texting all days, most one never ending conversation. Just someone didn't respond at night/evening so we continued it at the morning and next days. But sometimes it was 3h at night and he was texting me 'goodnight' when I've need to sleep. In my side we had really good connection. But\nTwo days ago, our conversation was end after more than 2 hours fast texting and it ends his 'goodnight, sweet dreams' text. I text him again, in the evening next day, sending him 'hey with song I wanted him to listen link' but he didn't reply. It's not he's busy thing cause he's online almost all day and create posts but ignoring me as well. What went wrong? What should I do? I'm INTJ if it help or change something.\n\n"}, {"title": "Hey intps I uploded a new video on how I view infps as an enfj for anyone who can be interested in an infp this would be a video for you to give you insight on infps like comment subscribe thank you (self.INTP)", "likes": 0, "comments": 0, "content": "https://youtu.be/uPQ7jhweAAE\n\n"}, {"title": "Are you aware of your surroundings? (self.INTP)", "likes": 0, "comments": 0, "content": "Bullshit stereotypes aside please.\nAlso, don’t let your answer to the question determine whether or not you post your answer or not. I want a relatively accurate representation of the inclination of the type with reference to the inquiry.\nHow aware of your surroundings are you?\nIs it a conscious or subconscious type of attention?\n\n"}, {"title": "Visit r/FollowThePunchline It’s a challenge where OP makes an unfunny incomplete joke and others need to make it really funny. (self.INTP)", "likes": "2", "comments": 0, "content": "r/FollowThePunchline\n\n"}, {"title": "Food for thought (self.INTP)", "likes": "2", "comments": 0, "content": "So I just got done watching a extraordinary YouTube video, possibly one of my favorites of all time.\nThe video was a about a extra feature of a anime called cowboy bebop, I'm sure most of you either watched it or at least now about it and its splendors.\nHowever, this video is a compilation of a bunch of narrative quotes from the 4 main characters basically expressing their philosophical perspectives on life in general and I couldn't help but to be moved by some of those wise statements. \nI just think most of you guys would really appreciate this gem and could possibly also be just as moved as I was by it. So pleas check it out. \nhttps://youtu.be/DwQqTpo83Nc\n\n"}, {"title": "Thoughts on Getting Written Letters as an INTP (self.INTP)", "likes": "2", "comments": "6", "content": "TL:DR- Thoughts on getting a written letter from a close friend…. Too cliche? How personal would you want it to be?? Would it make you feel like they cared???  Would you prefer verbal????  If the person has expressed previous feelings for you, would you find it too forward or awkward?????\n​\nFor context, we’ve known each other for years, but about a month ago I confessed my feelings for him and explained how I had never said it before because I did not want it to be awkward between us. He said we should not make it awkward and stay good friends. However, since that day he has completely changed for the better. He initiates contact everyday for us to get together, has opened up more than ever about his future/feelings, and is all around just kinder to me. There's a chance we may not see each other again and he has admitted he is sad to leave me, but he has said multiple times he could never do long distance (I think is honestly the reason he did not want to move forward). \nThe thought of never seeing him again is overwhelming, and I guess I just want to reiterate to him how important he is to me and how much I care about him.  I am not the best at expressing my feelings verbally, so I feel I would do better writing them down, but I don’t want him to take it as some desperate attempt of me trying to manipulate him into feeling something more. Or for him to think I am being too sappy by writing a letter. As much as I care about him, I ultimately want him to be happy whether it's with me or someone else and I don’t want him to think I am overly attached. \nAnyway, thank you for any advice and sorry for my overthinking rant... :)\n\n"}, {"title": "INTPs with INFJ SOs, how did you meet? (self.INTP)", "likes": "2", "comments": "1", "content": ""}, {"title": "I'm mad I tell you. Completely bonkers. (self.INTP)", "likes": "2", "comments": "1", "content": "I used to think that S's were the most troublesome to get along with.\nThey aren't.\nIt's people who have to Te every possible action and every possible consequence before deciding what to do during a round of combat in D&D, and do this every turn despite the available actions and consequences not changing significantly from turn to turn.\n\n"}, {"title": "Calling all Downvoters (self.INTP)", "likes": "1", "comments": "4", "content": "Most of the memes and gifs posted in this sub are stupid and irrelevant. I wouldn't be surprised if it's just bots farming karma. Please downvote more often.\n\n"}], [{"title": "Disrespectful mother talks over me/yells at me in front of other adults and I’m 31? (self.INTP)", "likes": "1", "comments": "7", "content": "I unfortunately live with my mother because I cannot fully afford the down payment on a home right now. She has also retired/is about to divorce and I am responsible for paying the bills and tax payment for the home since she is only living on pension and social security. She treats me like I’m a little child and belittles me or commands me in front of other people. Or will tell me to follow her around like I’m a dog. It’s driving me nuts because she doesn’t not respect me at all. What do I do?\n\n"}, {"title": "Any other INTPs disgusted at all the people who just have to make plans and get together in groups during this pandemic ? (self.INTP)", "likes": "0", "comments": "6", "content": ""}], [{"title": "Shouldn’t we be empowering each other? (self.INTP)", "likes": "177", "comments": "46", "content": "This entire subreddit is filled with the same rotation of self deprecating humor around being a lazy perfectionist or a waste of potential, or experiencing existential dread. You will see this, without fail, on any given day. \nThis is the reason many successful INTP’s don’t frequent this subreddit: to distance themselves from the negative atmosphere that is conducive to esteem decay. \nBy rewarding the negative posts in this sub, many INTP’s will internalize these negative characteristics on a subconscious level. As a indirect result, their identity is governed by “boundaries” that are constructs of INTP, which at the end of the day does not dictate the real potential for who you can be, what you can feel, or what you can achieve at ANY given moment. \nI love the posts where people help each other out and give advice, and share joy in their life, such as their personal adventures and successes. Used to love seeing INTP life hacks on here, though I see less of it now. \nI will openly say that I vicariously felt empowered by reading the success stories of other INTP’s and this motivated me on some level to win more in my life. Perhaps it is idealistic to envision the subreddit oriented more towards positive re-enforcement. \nLikely nothing will change from the result of a single post. it is still important to be aware of the BIASES that are imposed on you when you identify yourself as an INTP in combination with consuming the media of this subreddit\ndon’t ever feel afraid to ask for advice, show positivity, and share your successes! \nWe’re all here to look out for each other— there’s so much potential and value to be created. For those of you reading this, hope you make your day your bitch. Cheers\n\n"}, {"title": "Rant : What makes you think your an INTP? (self.INTP)", "likes": "0", "comments": "26", "content": "You ! Hey you! What makes you think youre an INTP? Did you just read about L being an INTP and decided “oh , i will be an INTP cuz my favorite anime character is INTP” or “hey im so smart , im like Einstein sp therefore i am an INTP “ ... bleh! Look at yourself, you went to a youtube video regarding the rarest personality type and then suddenly , the whole comment section INCLUDING YOU ! Is that “rarest” personality type , what a joke ! . Did you take the Brigs Meyers test? Or just like 99.99% of people in this sub they self diagnose themselves as a , loner ... check ... smart ,... check ... doesnt give a shit about time ... check .. ok im gonna be an INTP now ... great! Woopitido! Im only subbed to this subreddit for 25 hours and finished scrolling thru the popular post , i can only divide it to 3 types , 1 shitpost that has nothing to do with being an INTP that gets Upvoted by people who “relate” hence they are not a real INTP , 2nd , self loathing shit post and 3 , the most rarest type , real INTP post . What the fk is wrong with you? Im not gate keeping you by any means , all i am saying is stop deluding yourself ! Go post about funny memes about “laziness” and unnecessary shit on other sub , stop polluting this sub with worthless pieces of your thoughts that has nothing to do with INTP and is just incepted because you think you are something you are not .. stop it ..\nThe fact that most of you comment sht about “oh your spelling is wrong and im triggered” makes you not an INTP because it goes against the personality type! What a bunch of baloney pretending to be Einsteins ....\nSigh ...\n\n"}, {"title": "Hardest part of being an INTP? (self.INTP)", "likes": "51", "comments": "49", "content": "I think it’s the not being able to make close connections with people.  It’s not like I seek it out very often but introversion gets lonely after a while.  Anyway, enough about me.  Let me know in your experience what the hardest part of being an INTP is.\n\n"}, {"title": "Anyone else sick of trying to convince people to take control of their lives? (self.INTP)", "likes": "54", "comments": "38", "content": "It seems like I don’t know anyone that cares about anything even remotely important. I know the word important really is subjective here because everyone is different but seriously not a single person that I know of can think outside the box and think of their life as more than just: \n\nWork --> school --> career --> retirement --> death.  \nMiserable at work, can’t wait till it’s over --> few hours of watching tv when they get home --> bed --> repeat till weekend --> repeat till retirement --> what now?\n\nI’ve completed two college programs, tried both and have no interest in either. I’m working at a restaurant now and all I do in my free time is write essays about cool shit that I’m interested in. I’ve been doing that for a couple months but I am basically living in poverty because I can not find it in me to waste my time at this stupid job so I only work part time. \nIs this seriously it? To me it’s not a matter of what career I want to chose. I don’t want a career, I want to live my life. I want to learn, and I want to have fun. How can so many people just push this to the side while they waste over 1/3 of their time at work? When you include sleep people only get 1/3 of their total time before retirement to do whatever they want. Is that fucked up? How has this gone on for so long?\nThe reason I am posting this here is because I didn’t know I was INTP until a couple days ago and I didn’t know people like me even existed so I thought maybe someone could relate to this specific part of my thinking?\n\n"}, {"title": "I want to be completely honest and I feel like this is the only place I can (self.INTP)", "likes": "87", "comments": "13", "content": "This is actually quite long but I would appreciate it if you read it, I feel like you understand me and don’t judge me. \nSo, earlier this year, around February, my ex-girlfriend and I broke up because of many things. At the beginning of our relationship i was not completely sure I wanted to be with her, and after our first year together every now and then I used to wonder if I should break up with her. Our relationship lasted almost three years. \nIn the last sixth months we were completely different people. She developed her personality and began to frequent people I really didn’t like, I was not comfortable around them, I felt like I was incapable of satisfying her new personality and those people around her were a constant reminder of how I was socially awkward and how I was a failure to the modern teenager. I have always been a young grandpa, I listen to old music all day, i don’t like to go out, I don’t consider myself boring but I don’t do typical fun things. She wanted to go out more, she was always looking to get high, I like getting high, I actually convinced her to use marijuana for the first time, but for me it was a fun thing to do once in a while.\nAt the beginning of our relationship she told me a big secret about something terrible that happened to her, and i was fully supportive of her. Sometimes she would have these terrifying anxiety breakdowns and I always tried to protect her feelings. I knew she was in a lot of pain, so I tried not to bother her with my problems, that were significantly smaller than hers. But in the last six months I felt like I could complain about a few things every now and then. She used to tell me that that was annoying. I told her it didn’t seem fair that I had always been there for her, but she wasn’t willing to listen to my problems. \nIn the last 3 months of our relationship we decided to open our relationship. The idea seemed great, but I didn’t considered that I have really bad social skills and that it would be really hard to get another girl. A second thing I didn’t consider was that the kind of people she would open the relationship with were the very same kind of people that I couldn’t stand (artsy, modern, fashionable, “intellectual”, Bohemian people). Throughout our open relationship she only made up with one guy and that was it. I remember it was New Year’s Day and I was at my ex gf’s place. my grandpa was in his deathbed, my grandpa lives across the country, so I wasn’t able to be with him, however I read the family group chat and i thought well... I should be with my dad right now. I told her and I quote “I should go home, my grandpa will die any minute now, i should be with my dad.” And what did she do? She thought, hey, some free time I should go make out with that guy from my class.\nThat was a dick move, but I weren’t the same supportive guy as 2 years ago. I didn’t do it consciously but i made my ex gf feel like everything she liked was complete trash. The last thing we did together was a trip to New York (I’m not from the US). Along with two other friends, we spend a week in NY, we had a really big fight because she wanted to look at some paintings at the MET, and there wasn’t enough time, and i really preferred to see the antique weapons exhibit. I told her to go with her friend, she said I didn’t care about what she likes. And it was true, but in the end we came back to the MET and saw the paintings, and we missed the UN building (I really wanted to go, I’m a lawyer).\nI paid for the plane tickets and asked everyone to pay me back when they could. Eventually we broke up, she always held the moral high ground. She told me she was worried about me because in the very last day I called her to know where she was; she considered it was a toxic behavior. But the truth was that I felt really lonely and I just called her because my mind was overthinking about her being with other guys.  She called me toxic because of what I did the last day of our 3 year relationship, completely ignoring that for the last month she really didn’t give a single fuck about me.\nAlmost a a week past our breakup, I asked her if she could give me the plane ticket money, and she said yes. I was saving for a trip I had planned in June. I created a terrible habit, from time to time I would check her Twitter and see what she was up to. Around May i asked her for the ticket money, and she got really mad. Her mother had invited me on her family trips, but since the NY trip was something we (broke, low wage, hard working students) planned without our parents help, i didn’t thought it was rude to ask. She asked me how was I even capable of asking her for the ticket’s money after her family had invited me to their trips. If I knew she would do that, I would had never accepted to go on her family trips. \nA few days after that I checked her twitter account and I saw she had a new boyfriend (after only three months after our 3 year relationship.) and it was hard. But it was harder to read her tweets saying, I love you, I had never been in love before. If she said that she had never been so in love, i wouldn’t have paid it any mind. But it made me feel so angry, so sad. I was with her, she had whispered a million times I was the love of her life to my ear while we were as close as two people can be. So that was a fucking lie. \nI try not to check her social media but it’s impossible, i don’t miss her, i wouldn’t come back to being on a relationship with her. But I don’t know why I look for her tweets, i look at her photos. I think I’m developing a drinking problem, it’s almost 5 in the morning and i haven’t got any sleep because im writing about this to a complete stranger. I feel lost, i feel lonely, i feel pointless. And i don’t know why.\n\n"}, {"title": "What the &$@! am I supposed to do with my hands when in a standing up conversation. (self.INTP)", "likes": "27", "comments": "31", "content": "I'm pretty sure this is a common issue among us.\n\n"}], [{"title": "Modafinil saved me. (self.INTP)", "likes": "14", "comments": "4", "content": "Ill preface this by saying that i dont condone the use of legal or illegal substances, and that you shouldn't blindly take my word for anything. DYOR\nI've had an add diagnosis since i was six years old, though i rejected it along with my supposed aspergers until i was 14 or 15. I still somewhat do, but back then my only reason for doing so was fear for being labeled as different, and wanting to be like others. It was only when i got to my senior year of high school that i actually tried to get a birds eye view and compare myself to my peers, and after half a year of studying Jung and doing self analysis it started to become clear that something was hindering me from performing at the probably average level of my classmates. People around me seemed to have this somewhat magic ability and energy to act in their self interest. It was beyond me how people would find time to knock out a four hour assignment, see their friends and practice their hobbies in the same day. Between the mindless web surfing and rituals of hedonistic escapism,  I was struggling to even sit down and collect my thoughts. When i found out about the mbti and got further into jungian typology, the line between my previous diagnosis and mere  trait started to blur. I might be suffering from a bit of confirmation bias as i like many others on this sub have a somewhat emotional/romantic connection to the intp type, but one thing that i have noticed that isn't purely anecdotal, is  that a lot of the people in this community deals with the same issues that i do, and some have it really bad. There was a post in here from a guy in deep depression, filled with regret and desperate for an explanation to his selfish escapist behaviour, worded as if it was too early to even ask for a solution. Suggestions on ascetic self help rituals like cold showers and nofap were the top if not all of the replied suggestions. I tried that too, but my methods always became simply another distraction from the problem itself. Nofap wasn't about gaining energy or confidence, it was about out-doing the community by seeing how long you could last. Diets, therapy, vigorous exercise and meditation fell short as well. About half a year ago i got into nootropics. i read a post on the r/afinil subreddit from a guy with similar problems who with the help of medication finally managed to take a step in the right direction. At the time i thought the idea of unprescribed medication was a bit of a far stretch. It felt like cheating. Like i had to take a shortcut because i failed to walk the righteous path of self-help. When i realized i didn't have much to loose i ordered a batch anyway. they sat on my desk for a week before i gave in to my curiosity. I was blind but now i see. It was like i had been freed from the restraints that previously kept me from making any sort of meaningful progress. Within a week, i had not only caught up to the 20 hours of undelivered assignments i had due, i had started talking to girls, and actually socializing with my classmates. People took notice and asked what was up, but i evaded the questions. This wonderful substance seemed to simply work with no strings attached except for tolerance. Half a year later i use them sparingly to avoid building up tolerance, but i have as much succes with them as i did back then, and im incredibly grateful for the help they did. What i guess i wanna say is that for all the people in here plagued by their avoidance, with numerous failed attempts at getting their shit together, the pills just work. It's that simple, at least in my case. Ive tried Adderall as well, but it makes me a bit neurotic.\nTLDR: If self help fails at helping you get your shit together, there is always medication.\n\n"}, {"title": "INTP Care and Handling Guide: (self.INTP)", "likes": "1166", "comments": "237", "content": "CONGRATULATIONS! An INTP has deemed you worthy of their time (at least for now— this is subject to change without warning). For new users, this manual will provide all of the basic information that you will need to take care of your new INTP unit.\nYour INTP unit will come with the following accessories:\nOne (1) outfit to be used for exercise, socializing, working, and sleeping\nOne (1) pair of over-ear headphones\nOne (1) laptop with browser optimized for 100+ tabs\nOne (1) mobile device (equipped with find-phone app in event of misplacement , GrubHub)\nOne (1) comfortable blanket (for forts, sleep, security)\nOne (1) first aid kit\nOne (1) box of photographs and sentimental objects\nOne (1) The ’How and Why’ book of discussion prompts including but not limited to questions like ‘How did incels come to be?’ And ‘Why do people sell LulaRoe?’\nOne (1) extra-large whiteboard and a dry erase marker for aid in the communication/exploration of vast, abstract ideas\nOne (1) World Paradigm. Everything they know and understand fits into this model. There are no anomalies. This World Paradigm consists of several sub paradigms and many underlying theories.\nCustom Upgrades: Topic-Obsession packs like ‘Myers Briggs’ or ‘Serial Killers’. You can plug these in for your INTP unit to read, listen to, watch, mull over, categorize, and help them complete their World Paradigm™\nSoftware:\nYour INTP will be programmed with the following traits;\nTi: Your INTP will work hard to have a complete understanding of a situation or problem. They may answer questions with more questions. It is best to answer honestly and to the best of your ability, being careful with semantics. Your INTP unit may take a bit of time to compile new information so be prepared to wait for an opinion or judgement. If you are unwilling to wait, you may receive an ‘I don’t know yet’ error. A sure sign that your INTP is compiling is a glassy eyed stare in the middle of conversation. To interrupt the process, engage them directly and use eye contact to maintain their attention.\n​\nNe: Your INTP unit is equipped with additional pattern-detecting processes and can identify causes behind behaviors, predict behaviors, and link seemingly unrelated ideas. Your INTP unit may only feel comfortable revealing their findings if prompted. To start the pattern-finding processes, try the following queries:\n“new name for a company that mines cryptocurrency, but farm-themed”\n“why did my tinder date tell me I wasn’t funny after laughing at all my jokes”\n​\nSi: Your INTP’s main process might hang due to their tendency to daydream. They may zone out and be remembering their last vacation. They may ruminate on an embarrassing thing they did two years ago at that NYE party. They may be fantasizing about what they would have said as President of the USA in that situation. Your INTP may tell you about a past event they experienced once or twice (or three or four times …). But this also means that you can remind them of a past success or fun memory for a quick pick me up.\n​\nFe: Your INTP may have trouble being patient with the needs of other people. If the Fe function is left unchecked your INTP unit will completely dismiss a person, cut contact or develop a simmering resentment of them. If your INTP unit is acting unreasonably selfish you can usually use obligation or guilt to turn them around. If they feel that they have been in the wrong your INTP will likely apologize.\n​\nGetting Started\nTo turn on your new INTP unit:\n\nYour INTP will arrive in listening mode. Activate by reading one of the discussion prompts from the included 'How and Why' guide.\nAllow your INTP to wake up naturally after 18 years of simmering in isolation and a 12 hour sleep cycle. Make sure your INTP is covered in it's security blanket.\nGet your INTP out from under its blanket by reminding it of it's obligation to acknowledge you.\nIf step 3 didn't work, ask about one of the photographs in the included box.\n\nModes:\nSocial mode: You have invited your INTP to a party. Where did they go? They went outside to have a quiet chat with one of the other introverts. Don’t worry! They aren’t feeling left out. And they’re going to leave soon anyways. They are exhausted after having to fake-laugh at SEVERAL bad jokes on their way through the house.\nFriend mode: You’ve known your INTP for several months now. They have just now decided you are friends. In exchange for consistency and honestly, your INTP can entertain you with insightful jokes and interesting theories. Be sure to regularly stimulate your INTP with a hypothetical question, but don’t overwhelm them with too many obligations. Another plus: your INTP will never be mad if you cancel plans and they’re probably ok with winging it last second.\nGhost mode: Your INTP has just witnessed an Unreasonable Action™ by a third party. This may have been insisting on something like the flatness of the earth, or something that lacks total self awareness like extreme self-absorbtion. That third party will never be taken seriously again. Your INTP unit will not re-evaluate the situation. You may discount the possibility of EVER re-introducing your INTP to this person.\nProject Mode: Something has piqued your INTP’s curiosity! They have spent all of yesterday on their computer researching. Now they are coming home with an armful of supplies and a glimmer in their eye! This is the First Project They Are Actually Going To Complete At Long Last Maybe.\nProject Mode (addendum): Your INTP has covered their desk/living room/bedroom with items pertaining to their newest hobby. They are now scrolling absentmindedly through instagram with a family size Dorito bag. What happened? They have already glimpsed the theoretical result! How satisfying! Much more satisfying than putting in the work to finish it. Maybe they’ll at least clean up the living room later.\nI-Told-You-So Mode: The INTP gave you advice a few months ago. You didn’t follow the advice they gave you. Now you are complaining to the INTP about the predicted results. Your INTP is digging deep to provide you with sympathy, but they also want to be recognized as having-been-right-this-whole-time-thank-you-very-much.\nTroubleshooting:\nWhy isn’t my INTP doing anything? What does it want?\nYour INTP doesn’t know what it wants. In some ways your INTP is afraid to want things because what if what it wants won’t make it happy? What if  it fails at getting what it wants? What if it doesn’t finish? Your INTP has implicitly decided that things are Fine Just Like This. Best not to rock the boat, eh? If you’d like to motivate your INTP, reassure them that they are capable and that the only way forward is to make a choice.\nWhy does my INTP keep dropping their items/hurting themselves?\nYour INTP has an Se Trickster function which means it lacks awareness of the physical environment. Included in the accessories are a first aide kit and some paper towels.\nWhy didn’t my INTP notice/remember ______ about me?\nYour INTP has an Se Trickster function which means it lacks awareness of other people’s experiences. It is best to just remind the INTP unit of these facts— they mean no harm in forgetting.\nMy INTP seemed upset. Should I ask what’s wrong and what they’re feeling?\nNO. Your INTP does not know what it’s feeling. It may become flustered or misattribute the cause of its discomfort if pressed for an answer. In this scenario, bring your INTP unit the blanket from its accessory package and make it clear that you will be there when they want you. Your INTP greatly appreciates you, we promise.\n​\nFinal Notes:\nIn time (lots of time) your INTP will come to love you. And contrary to popular believe advanced-model INTPs know exactly how to show you their appreciation. They can be great gift-givers and patient conversationalists. They can accept reasonable criticisms and be good problem solvers. They're good at asking questions and absolutely want you to have a full understanding what they're saying (by simplifying something that is complex to it's essentials) and not overwhelm you with needless rhetoric. They can even use their introspection to better understand YOU!\n\n"}, {"title": "My mom and sister were having a deep discussion... (self.INTP)", "likes": "131", "comments": "26", "content": "It was a profound dialog about the end of days, and I sat in the back seat of the car listening, nodding along silently at their speculations on how the world would end.\nIt was winter and the street lights illuminated the snow along the road, frost filmed up the edges of the car windows, and the world seemed to only contain the three of us and our deeply held ideals.\nBut then.\nMy mom turned onto our street, and I saw our empty yard. No Christmas lights, no decorations, nothing; as if the long awaited Winter holiday were not fast approaching.\nJust then a natural lull occurred in the conversation, and I took the opportunity to interject an opinion of my own.\n\"You know what I think,\" I began, and they turned their ears to me and listened, as I had barely spoken that whole long ride. \"I think we should get some giant straw Yule goats, paint them Glow-in-the-Dark, and put them in the front yard.\"\nThe car erupted in laughter, and even I realized the discontinuity of my idea. Reader, I shall never live that down.\nEven better, some weeks later, I was Skyping with my boyfriend (now husband) and told him this story. I was laughing so hard I could barely breathe, I had tears streaming down my face, and somehow I was able to wheeze out the whole tale while he chuckled uncertainly.\nWhen finally I got to the end of my story, gasping and wiping tears of laughter from my eyes, he asked tentatively, \"What are Yule goats?\"\nAnd that set me off all over again.\nI hope you enjoyed reading\n\n"}, {"title": "Letter To A Young INTP (self.INTP)", "likes": "692", "comments": "166", "content": "My dear INTP,\n​\nAs you may have noticed, you're a bit disconnected from most people, and that's okay. It makes sense, doesn't it?  People like you represent a fraction of the total population, so it can be hard to relate to others sometimes. In a world of extroverts and judges, introverted dreamers can feel left out by society. Not that it bothers you too much of course.\n​\nYou may also have noticed, my young INTP, that the job market and this economic system do not align with your values and goals, for after all, isn't a modern job just a form of voluntary, paid slavery?  It's okay to be who you are, and most of your anxieties about life are most likely valid. But I want you to know something else, because I know you're not being taught this at school. I want you to know that the world is your playground, provided you don't spoil it for others. Be kind, and be trustful, but be aware. Danger lies beneath the sand.\n​\nTravel. But first, reboot your system. And try to be healthy, because there is nothing more pitiful than an unhealthy INTP, specially abroad.\n​\nMental health has a lot to do with habits. Be healthy and start by eating properly, exercising. Then get in the habit of cleaning your room. Or save time by getting in the habit of keeping your room clean in the first place. The trick is having multiple trash cans and laundry bins in the right places. And don't eat in your room, it's the easiest way to start a bad habit.\n​\nWith a healthy core and a healthy heart, travel. You think in terms of systems and patterns and theories and designs, so even though you think you have it all mapped out in your head, go out and shatter your own reality, go and smash it into the ground, and travel where your heart desires. Get lost in the world. As you experience your newfound ability to adapt and to thrive, free from the mental, social, and economic shackles imposed by others and adopted by you in your former place of existence, your change of perspective feeds fresh new information to your intuitive center, and therein lies the mechanism tasked with your mental innovation.\n​\nAnd you ought to innovate. You ought to innovate because you control destinies. So know that you are not condemned to merely survive your existence. An INTP needs purpose, even when the nihilist side prevails.  And you'll need friends for the journey, friends you can elevate and friends who can elevate you. Get yourself a book on body language, it's impossible not to pick up on physical cues when you're so adept at noticing patterns. Then acquire some leadership skills.\n​\nLearn to listen. Learn to talk. Learn to think. Learn to feel. Learn to live.\n​\nHealthy INTPs make for excellent leaders, though most prefer to be led by a leader they themselves believe in.  In your travels, you will realize that there are many ways to navigate life. Your preconceived notions will be destroyed, and when that happens, ask yourself whether you should be learning new things and expanding your mind, or unlearning everything and clearing your mind.\n​\nYour special capacity for thinking is a torment in and of itself. Tame it through meditation, and realize that nothing matters beyond that which minimizes suffering. And even then, it doesn't matter, which is why you are tasked with making your own purpose and meaning along the way. And though you may be wrong or you may walk along the wrong path, know that this is okay and a good thing in the grand scheme of things. The world will make you feel inferior for your failures, even when you dutifully set out knowing that you would fail in the first place, because you wanted to experience something. Do not falter when the naysayers get loud, it's a distraction, but do understand and anticipate the consequences of whatever you set out to do.\nAnd do not make the mistake of boxing yourself into your type. You are not your type, you are a being with particular preferences and desires and motivations, dreams and goals. Become a chameleon. Challenge perception. Set out to reinvent yourself. Evolve.\n​\nBecause the world is your playground, and you deserve to be happy.\n\n"}, {"title": "Just a question, how are you all still alive? (self.INTP)", "likes": "17", "comments": "63", "content": "Serious question. What's keeping you alive? How are you coping? I'm freaking miserable here, about to end it all, lol no joke, but seriously, answer please.\nedit: Not suicidal, just looking for coping mechanisms.\n\n"}, {"title": "i hate being an intp (self.INTP)", "likes": "203", "comments": "74", "content": "Being smart is cool and all but have you heard of“Ignorance is bliss”? The more stuff I know the more detached and depressed I get. Im jealous with my friends who are just simple and happy and normal.. Don’t even get me started on being awkward and weird as a child .. and maybe carry it on as an adult. Also, having a normal relationship with people is just impossible.. And the procrastination problem that many of us have?? Im ruining my own life.\nIm sorry for my rambling but I just wanna vent, I just wanna feel normal for once.\nedit: thanks everyone for sharing your similar experiences and others for your positive message. Knowing I’m not alone in this and there are ways to improve myself I feel much better now. There is hope for all of us (´°̥̥̥̥̥̥̥̥ω°̥̥̥̥̥̥̥̥｀)\n\n"}, {"title": "My Epiphany (self.INTP)", "likes": "24", "comments": "9", "content": "I can't remember what sparked this epiphany, but, man, was it the best thing to ever happen to me.\nI've always heard that dwelling on the past is never of any good to anyone, but I never really understood it. I always thought that I was living in the now, making spontaneous decisions in my life. But then it hit me like a truck.\nOver the last few years, I have been dwelling on the things that I wish I could have changed or had gone back and repaired, up until yesterday. Yesterday I realized that I shouldn't get caught up in what could have been, but what I can do now. I shouldn't let my mistakes make up all that I am, instead I should let them transform me in spite of them, better equipping me against them. I am the result of my mistakes, not the conglomerate of them.\nI have been depressed for years, but now I think I can start getting past it for real. \nThis is one of the hardest things I have ever tried to explain, but hopefully it makes at least a little bit of sense. Maybe this could help somebody out? I dunno, just felt like sharing my epiphany.\nEdit: Thanks for the Platinum?! I don't know what it means or why I got it, but thanks?!\n\n"}, {"title": "Is breathing an INTP thing? (self.INTP)", "likes": "451", "comments": "85", "content": "Ok, so i have this INTJ friend, and she said that she doesn't breathe at all. She even said that all of her other friends dont do it. Am I the only one?\nbye the wae, sorry for bad englysh i live in Australia\n\n"}], [{"title": "Being lazy, awkward and morose is not INTP (self.INTP)", "likes": "103", "comments": "35", "content": "It's just sucking and blaming it on your personality type.  If you are unhappy with yourself then change.\nThere's a lot of commiserating and negative trait circle-jerking in this sub. I joined hoping to find like minded people interested in talking about interesting things.  However most of the posts are some form of \"being INTP sure sucks, don't we suck guys haha fml\".\nThis is not INTP it's just pathetic.\n\n"}, {"title": "why to live (self.INTP)", "likes": "20", "comments": "16", "content": "no hippie spiritual shit, don't worry.\n​\ni've read some posts here in intp from people felling blue, sometimes for no reason. i've lived all my childhood with that feeling of nonsense. so i think i learned some things. first of all, avoid all that spiritual/emotional shit. it's not more likely that the answer is in gurus books or in self-help books or religions than in other more esential things.\n​\nphysiological reasons are the most likely to cause depression or simply that feeling of nonsense, that life has no reason to be lived. and im not telling you to believe me. fuck faith. just prove it:\n​\nfirst of all: take care of your diet. no matter if your skinny and don't have any health issue, you have to see how much you can improve your mood by just eating healthier. being brief: try to do a paleo diet or something very similar. long story short: basically beef and vegetables. no sugar, no flour, no soda. try to limit carbohidrates and fiber, eat organ meats.\n​\nsecond: slight exercise. neither sedentary nor pushing yourself too far. just relax. do some slight weight lifting. again brief: 3 days a week a fullbody routine. (don't complicate yourself. the only exercises you need are: deadlift, squats, chin ups, overhead press, bent-Over Rows, and push ups, in that order. you dont need any protein, no products, just your garden or room, a bar and some water drums. this doesnt have to take you more than 3 hours a week if you dont want to.\n​\nthird: sleep well. some hacks: if you dont eat any carbohydrate 4 hours before going to sleep, you will do it better. reduce light since sunset if you can, and avoid over stimuli. what about an audiobook while lying? remember than if you wake up at 6 to 8 am and see daylight (not directly to the sun please), your circadian rhythm will accommodate a little more.\n​\nfourth: the only rule you need. just make it simple. forget all those endless books about self help. i dont know you but i get lost a lot trying to remember their advices and i end up anxious. the only mental thing you have to do is to learn the \"habit of get things done\". as simple as setting a reasonable daily goal, and do it. no matter what.\n​\nfifth: if you fail at this point, you fuck everything: overcome your addictions. and im not talking about heroin or cocain. im talking about serious shit here. the most fucked up addictions for your mind and dopaminergic system are excessive sugar, caffeine, pornography, videogames, alcohol, tobacco, tv series, internet. They are so addictive that people look for excuses or try to put reasoning about their use. and dont try to figure out how much is too much. you will know it when you start feeling like shit. as simple as that.\n​\nsixth: a human being need a goal and to work for it. there is no happiness in the perfect life. unlike the freudian philosophy says, tension in life is necessary.\n​\nI've committed all the mistakes named above. even worse, i find it difficult to follow the right path. but now i feel better with my life even when i lose my way. my worst enemy is my procrastination. Everyone passed through bad experiences, but we cant just live on the shit of past anymore. from now on, you know you can feel better since youre actively searching what are your goals.\n\n"}, {"title": "Does anyone else have an alter ego when hanging out with people? (self.INTP)", "likes": "322", "comments": "84", "content": "For example when I am in some social situation I am not really me. I act super confident and friendly even though I am insecure and asocial. This just drains me completly, and after that I need some time alone to \"recover \" from human interaction. Does anyone else do this?\nEdit: Thanks for the gold !\n\n"}, {"title": "Mass suicide idea. (self.INTP)", "likes": "0", "comments": "44", "content": "I see many of you are nihilistic and depressed. What about commiting mass suicide (me including ofc)? If 25k people from here did it, we would beat Jonestown, and actually achieve something. What do you think?\n\n"}], [{"title": "INTP Career Cheat (self.INTP)", "likes": "109", "comments": "28", "content": "INTP Career Cheat\nMany of us have been guilty of swapping too many careers and leaving too many projects unfinished. We start, we learn, we get bored and quit. That seems to be the cycle. But what if there was a way to use our thirst for the new as an advantage and build a life/career around it?\nHere's the plan.\n\nPick a field of interest.\nIdentify the disciplines/professions/skills within that field that you'd like to explore.\nConsult with an expert on how to get those skills in 1 to 3 months of intense work.\nSet a SMART goal and devise a structured plan to achieve it. The goal should ideally be a project of some sorts with a clear and tangible outcome, i.e. a website, a six-pack, a drum cover, a short story, a business, a video etc.\nStart working on the skill for 2-4 hours every day. More is better. Document (shooting on video is best) every session. Keep a learning journal.\nOnce a week get feedback from the expert and apply it to your practice. Be constantly thinking how to get better.\nStart a blog/vlog and post weekly progress reports with your in-depth commentary about the process.\nFinish the project, post the final result.\nTake two weeks off to think about the experience. Write an article or a book, create a course, shoot a video about your experience. Sell it.\nMove on to the next thing. Repeat.\n\nAlso:\n\nMonetize through ads, endorsements, affiliate marketing, presentations, consultations, lessons, books and course sales, Patreon, Kickstarter, donations and sponsorship of all kinds.\nYou can also flip burgers or do whatever part-time shit you can.\nAfter finishing several projects in a year, write and publish a more thorough book.\nLearn public speaking (how's that for another project?) and do a TEDx talk.\nBuild a following and make more profit.\nLive the dream.\n\nMy background.\nI am a 28-year-old pretty good guitarist/composer currently in the midst of recording my first serious high-quality killer EP. After all those years in shitty bands, self-doubt, hours upon hours of practice, things were finally starting to look rosy and I thought, this is it, I can write top-notch rock songs, play in a band and get to have a career.\nGuess what happened next. Yep, I lost interest. The more I pressured myself into becoming a pro, the less I wanted to become one. The prospect of concentrating on the one thing seemed unbearable.\nSo, after several days of intense thinking I came up with the idea.\nI still have my doubts and spend time thinking about all the potential pitfalls. But hell, fucking beauty bloggers, gamers, self-help preachers, fitness chicks make a living off of much shallower things. With all the obsessive conceptualizing that we do, aren't we obliged to make great, well, concept creators?\nJust think how awesome it is.\n\nYou get to learn a number of skills that could potentially help you make money or find the job. In any case, you get a better understanding of the chosen field. Plus, you can always choose another.\nAND you get paid for doing that (theoretically, at least).\nYou get to use skills like video production, writing, marketing, web design, research, critical thinking to make the project happen.\nYou get to help the people who are wondering what it's like to do x or y, and the complete beginners by showing them how much can be done with focus in a short period of time.\nYou get to choose your working hours and space.\nYou never get bored. If you do, then nothing will save you.\n\nThat's it. Who knows what happens next. I might chicken out but I might as well go crazy and do that shit for real.\n\n"}, {"title": "Big thanks to my INTP brothers n sisters (self.INTP)", "likes": "138", "comments": "22", "content": "Last year at this time I was in a really bad spot. University drop out, making nothing at a retail job, living with my parents while all my friends had left to go do school. I was incredibly depressed and fighting some psychosis. I had no idea what I wanted to do, and no confidence in my ability to do anything regardless.\nIt was around then when I started spending a lot of time on this sub. It was you guys who gave me the confidence to pick a program, get my shit together and go back to school. \nI always wanted to end up in tech but didn't think I had the discipline. The posts I read here pushing others into IT careers and talking about their own success in theirs was what got me to stop fcking around and just try it. Year later and I've never been happier. Moved in with friends, top of my class in a program I love, even have a boyfriend. \nJust wanted to say thanks because I'm pretty certain if it wasn't for you guys I'd still be fucking around at my parents house and working a job I hate. I know I wouldn't have had the confidence to consider programming. \nSo big thanks for inspiring me get my life together r/intp. You really helped a girl out \nEdit: WOAH!!!! Thanks for the gold whoever you are!!!! Made a great day so much better :) 💜💜💜💜💜 \n\n"}, {"title": "I've been browsing this sub for 7 years and not once have I seen someone give another person gold here. (self.INTP)", "likes": "11", "comments": "21", "content": "Apparently there has never been a person who was even worth $3.99 to an INTP. I'm starting to suspect INTP's only care about ideas and not people. Screams\nEDIT: I want to give a big thank you to the anonymous user who gave me gold. It sincerely made my day! Thank you!! :)\n\n"}, {"title": "Solving communication problems in a relationship the INTP way... (I think) (self.INTP)", "likes": "16", "comments": "10", "content": "I am only sharing this here so that it may give you some ideas on how to talk to your partner if you're like me who's struggling to always express himself/herself (probably because there's a lot going on your mind, or you're trying to piece your thoughts together from your stash of facts and experiences in your very own mind libraries :D).\nI feel arrested and unable to speak immediately whenever my boyfriend asks me questions about myself and/or my feelings. Don't get me wrong—he's a nice person, but I feel like I can't come up with the best answer on the spot. More often than not, I would arrive at the best way to respond to him when I've given myself enough time to think about it (read: hours), but he's not around anymore. Of course, someone with a bad memory is bound to forget important thoughts, and this cycle drains me. \nWe went to an art supplies store tonight and I thought about how I liked writing, but struggled on what to write when I'm not writing for work purposes. I remembered the empty journals lying around my room, and then it came to me suddenly: what if I just write whatever it is that's on my mind (my own questions or late answers to his) and just make him read that on my journal later on? Not only this helps me write again but it allows me to document our journey to understand each other. I just finished my first entry tonight and I'll ask him to read it later on. While I'm treating it like a diary, I write as if I'm talking to my partner.\nHope you guys may want to try this out, and please let me know if you already did! I'm pretty sure I'm not the first one to to think of this, after all :) Best of luck to all of us!\n\n"}], [{"title": "Can we please stop self-diagnosing Asperger's? (self.INTP)", "likes": "167", "comments": "75", "content": "It seems like at least once every week someone on this subreddit makes a post about Asperger's wherein he or she attempts to draw a correlation between the INTP personality type and what happens to be a very trendy disorder at the moment. This serves to affirm my suspicion that many -- if not most -- people who browse /r/intp don't understand or outright disregard the function stack. \nEach personality type is defined by the expression of four main functions. For INTP, these are:\n\nIntroverted Thinking \nExtroverted iNtuition\nIntroverted Sensing\nExtroverted Feeling\n\nPeople with Asperger's are usually characterized as aloof, eccentric, excessively rational loners, which fits with our primary function and, admittedly, with some INTPs stereotypes. The problem with this diagnosis, however, is our secondary function: Extroverted iNtuition rapidly absorbs and interprets external data, recognizing patterns and forming impressions of situations or problems as a whole. This is crucial to the INTP typing, because it's what gives us the big-picture perspective that differentiates us from other Ti users, as well as our designation as social chameleons. The Asperger's diagnosis, by contrast, is based largely on a lack of these exact qualities. \nLet's consider some common indicators of Asperger's syndrome:\n\nDifficulties with high-level language skills such as verbal reasoning, problem solving, making inferences and predictions\n\nThis reads more like a list of our strengths than deficiencies. INTPs excel at critical thinking, hence our tendency to score high on IQ tests, which emphasize this primarily.\n\nDifficulties in empathizing with others\n\nINTPs may have difficulty expressing empathy, because Fe is our inferior function and, as such, is usually the last to be developed. That said, most of us have no difficulty assuming somebody else's perspective and imagining what his thoughts and feelings might be. Even when an INTP plays Devil's Advocate -- which we're notorious for doing -- we're not being insincere: we actually become someone, if only temporarily, who believes in that position. A person with Asperger's most likely would not be able to do this.\n\nProblems with understanding another person’s point of view\n\nSee above.\n\nDifficulties engaging in social routines such as conversations and ‘small talk’\n\nINTPs may not enjoy small talk -- it may seem boring or superfluous -- but we're at least able to understand its role in society, and given that most of us have a broad range of interests, it's rarely difficult to find something to talk about. Like all introverts, we may be shy, because we don't have as much impetus as extroverts to get over fear of social interaction, but Asperger's is not about being shy.\n\nProblems with controlling feelings such as anger, depression and anxiety\n\nAny time your Feeling function falls into the inferior position, it's going to take some effort to learn how to express it appropriately, but most of us seem to err on the side of excessively restricting our emotions, rather than acting out.\n\nA preference for routines and schedules which can result in stress or anxiety if a routine is disrupted\n\nIn my experience, and based on what I've read from others in this subreddit, we tend to have the opposite problem: forming routines is difficult for us and treated as a necessary evil at best, in most cases.\n\nSpecialized fields of interest or hobbies \n\nINTPs tend to burn through hobbies and interests, learning enough to feel competent, but rarely mastering anything. Once we've solved the main problems, we get bored and move on. One of our members, /u/Sherlocked_, created a subscription service called New Hobby Box that sends supplies to experiment with a new hobby every month. That's INTPs for you.\nFrankly, I don't know how someone with Asperger's could possibly type as INTP, given that they would not exhibit the qualities for Ne to appear as a secondary function -- which is not to say it can't happen, but I certainly don't see a greater risk among INTPs than other types. However, if you honestly feel you might have Asperger's syndrome, please seek an evaluation from a professional: while I think the stigma surrounding disorders like this is unwarranted -- being different doesn't necessarily mean there's something \"wrong\" with you -- it can be seriously limiting if left untreated. In the meantime, over- and self-diagnosing trivializes the disorder for people who are actually suffering and makes it more difficult for them to get the help they need, so could we go ahead and knock it off? Thanks.\nEdit: Thanks for the gold, anonymous redditor!\nEdit 2: I feel I need to clarify that my original post specifically concerns people who diagnose themselves with Asperger's or who claim that INTPs are more likely to have Asperger's than other personality types. I'm not claiming that INTP Aspies don't exist, nor am I doubting anyone here who claims to have Asperger's, as long as he or she has been professionally diagnosed. To reiterate: while INTPs may have Asperger's, the personality type itself does not resemble Asperger's, and please don't diagnose yourself with a condition people legitimately suffer from based on a few articles you've read online. \n\n"}, {"title": "The most INTP College Application Ever (self.INTP)", "likes": "52", "comments": "10", "content": "My little brother's college app:\nThe Prompt: Describe your academic and career plans and any special interests (for example, scientific research) that you are eager to pursue as an undergraduate\nHis answer: \"I have a strong desire to pursue a degree in both mathematics and philosophy because both enforce an understanding of ideas that have depth and logic. \nThe desire that I have is to explore and develop ideas fully.\nAlong with this, I am looking for the peace of mind that comes with being able to think about the world in a rigorous way. A way of thinking that that is logically rigorous in its solution. I want to logically be able to perceive and understand abstract problems, coming to later evaluate the subject. I want to learn to think with depth and learn to be comfortable with not knowing the solution to a problem, but rather enjoy the process of solving. \nI think that learning this attitude is incredibly important for me, because if one can have happiness and peace of mind in solving difficult, abstract problems instead of being so previously concerned, and ultimately neurotic about getting the solution, I think that this can lead to a higher quality of life, and a fusion of the purely rational way of thinking and the faith and intuition that is so necessary to being able to stick with a process over the longer haul. The solution to the problems I will develop will be purely rational, but the process won’t be due to the amount of initial guesswork I’ll have to do. I’ll have to be wrong many, many, many times before I can even approach a solution that is close to being right. \nIn the end, I want to study subjects without immediate application so that I can formulate and learn a way of thinking that is, at its end product, is seemingly read as purely logical. But if you dive deeper into this process, this is a process that also requires patience, intuition, and faith in sticking with and understanding the process for what it is instead of trying to come to a dubious conclusion immediately. \nPerhaps I will never get a solution to the problems that present themselves, but the enjoyment of solving the problems drives me to try to solve the problems themselves. And I believe that as long as I hold onto this process, I will get an answer more satisfactory than before.\"\n*Notice how he didn't talk AT all about about what he was going to do at the college itself (like the prompt asks) but went off on a tangent about wanting to solve abstract problems and obtain a peace of mind (he just read Zen and the Art of Motorcycle Maintence by Pirsig) doing it. *\n\n"}], [{"title": "INTP vs. INTJ: A Helpful Guide Of Function Analysis For Confused Types (self.INTP)", "likes": "88", "comments": "59", "content": "Although I've been well-versed in Jungian Theory for about half a year now, I've only been active in this sub for the past month. Even still though, I've noticed a huge trend of confusion that I think needs thoroughly addressed here and that is the difference between INTPs and INTJs. \nIf we were talking about say INTPs vs ISTPs, or INTPs vs INFPs, I would probably shy away from the discussion of those topics as I'm not confident in my familiarity with those other types. However, I know INTJs like the back of my hand as my father is an ideal portrait of a healthy INTJ. Having known an INTJ my whole life, I can say that there is an enormous difference in the way we process the world. It's ironic that INTPs and INTJs can have not a single cognitive function in common, yet appear so similar from afar. Hopefully, this in-depth analysis will help shed some light on the matter though, and can give you a distinction between the two types better than the watered down versions many find on the various MBTI sites. Let's get started.\nFirst order of business here is to break down these two personality types into their primary cognitive functions.\nINTP\nDominant - Ti\nAuxiliary - Ne\nTertiary - Si\nInferior - Fe\nINTJ\nDominant - Ni\nAuxiliary - Te\nTertiary - Fi\nInferior - Se\nThis list will be here for reference as we contrast the two types' cognitive functions, one by one. Use it to help piece together the overall personalities once you've read over the more meticulous differences between the two. We will begin with the intuitive functions.\nNi vs Ne\nTo give you an idea of the differences between these two functions, I'll give examples of how my intuition works in my life (Ne) and how my father's works in his (Ni).\nNe for myself works as so: An INTP generally goes through life forming all kinds of different theories on a multitude of topics. For myself, I generally think very hard with my Ti to bring about an understanding of all kinds of complex systems. However, there are times when my Ti is at work piecing the puzzles together when all of the sudden, it's like my mind was just struck with lightning. Without any sort of effort, my head just snaps all of those pieces into place and I instantly have a complete understanding of that complex system I was trying to grasp. It's what many call an epiphany. These aren't exclusive to types with Ne high on their list, but it definitely happens much more often to those types. \nAnother trait that goes along with Ne's is that they are huge idea generators. I'm talking creative powerhouses. Ne's are always jumping from one idea to the next. The way this manifests itself in my life is that I am always coming up with new things to do with myself. This happens so much that my follow through with my ideas can sometimes be very lacking. By the time I have gotten into one of my ideas, I have already gotten bored with it and am focusing on something else. For example, I decided it would be good for me to read romance novels to help improve my weak feeling functions. I went to the bookstore, got 2 books of that genre, and after a few pages into one of them, I haven't touched either of them in weeks. This is because I decided I should be spending my free time working on my golf game instead. This will probably also be something I'll end up bored with, as well. But the point is that we are really good at coming up with new ideas. This jumping between ideas is what gives INTPs their objectivity in thought too, because they can see things from so many different perspectives. There are many other traits to this function, but these are some big ones.\nMy father's Ni: Although I'm not sure what the experience of perceiving through Ni is like, I can give a very good example of how Ni looks from third person. My dad, just like me, can come up with ideas well, too. The difference is that his ideas are more quality over quantity. They aren't something he jumps ship on quickly, either. He literally obsesses over the visions he has for himself and the world around him. For example, he is the CEO of a mortgage company worth somewhere around $50 million right now. He has very specific ideas for how to run his business and rides his employees to do it exactly how he wants. Not only that, but he works way outside the 9 to 5 shift. He is restless with his visions for his company. If something important is going on in his business that can probably wait until the next business day to continue, he will stay in his office and work till 10 or 11 at night and won't look away from what he's doing. Hunger and sleep are his lowest priorities in this mode. It is focus beyond what I can describe, all fueled by his desire to live out his strong visions.\nSo the major difference? Ne's tend to jump between different ideas a lot, while Ni's narrow down on one idea until completion. Next, thinking functions.\nTi vs Te\nTi's are HUGE thinkers. We don't stop. And since introverted thinking is an INTPs main function, this tends to manifest itself in our very sedentary lifestyle. Basically, if you find yourself constantly sitting on your bed just mulling ideas over in your head, there's a good chance that you are an INTP. We enjoy very lofty thinking that doesn't even necessarily help us in real life. For example, I can spend hours trying to really understand how abstraction can exist in our minds. Or even thoughts in general. I have trouble understanding how simple matter and energy can create such an experience, and thinking about it for a long time won't get me any closer to the real answer. But for some reason, it's incredibly stimulating to my mind. I can come up with my own personal theories about these topics and keep looking through different lenses (with my Ne) to see what fits best. Ti's also tend to overthink a lot of the basic parts of life because they are used to such heavy lifting with their rational-faculties. Things like simple social interaction can be difficult for them as they will second guess everything they say.\nTe's are much different. They are very progressive in their thoughts. They don't analyze a topic until they are blue in the face. They will look at that topic, see the major points, come to a conclusion, and move on. Simple as that. The only problem with this is that they can sometimes overlook vital information, and since they are so quick to reach an answer, they can often make wrong conclusions and have trouble understanding why they were wrong.\nI will give an example of Ti vs Te. My dad and I once got in a debate over religion. I am an atheist while he is an agnostic, but was defending religion in society. For every argument he posed, I began breaking it down and explaining why that argument isn't a very valid one. Before I can finish the one I'm on, he interrupts me and brings up another big point, as if it's a rebuttal to what I'm saying. I break that down for him as to why that's wrong. He interrupts again. Before I know it, he's been able to simply explain all his overgeneralized points while never letting me take the time analyze them for him and fully explain them. This is very progressive, yet very glossy. It just sounds like good points with very little analysis behind them. \nI got very frustrated the whole time because he was oversimplifying everything and this is the big difference between Ti's and Te's. Te's focus on the main points but don't like to dig deep into them, while Ti's like to take their time and look at each one, making sure they are as they appear. Ti's are also much better at handling subjects that involve deeper thought like calculus or physics. Not that Te's can't do those things, too, but they are much better at simple thinking tasks, especially since they are quicker at thinking than Ti's.\nThese next two function types will be on the weaker side for both types so they will tend to be obscure facets to their personality that can sometimes become negatively used.\nSi vs Se\nSi is associated with having keen senses for the outside world. They pick details very well with all of their 5 senses. My brother is Si dominant and his hearing is incredible. Since Ne can suppress INTP's Si a lot though, our senses aren't fantastic. We tend to be in our own world. But when we can focus on the world around us, we have decent sensing skills. \nAnother aspect of Si is that it is directed a lot toward the past. Strong Si's have impeccable memory. My brother loves watching jeopardy because it's all about remembering random facts. He can get at least 60 percent of the answers right. It's honestly crazy to watch. For an INTP, memory tends to only be strong with their serious interests. This differs from strong Si's as they can remember things outside of their own interest with ease. This memory also helps with learning from the past. INTPs who can effectively use their Si can look to the past at times to help make decisions they are currently facing.\nFinally, Si's focus their senses more on themselves. They like relieving whatever physical discomforts they have. Things like hunger and sleep are immediate priorities for strong Si's (the opposite of the Ni I described for my dad earlier). So INTPs may have moments where they are particularly concerned with being comfortable. It's not always important to them though as Si isn't a strong function for them.\nAs for Se's, they are very similar except that their sensing doesn't focus much towards the past. They also aren't worried about physical comfort as much. Rather, they enjoy experiencing the outside world a lot and would enjoy things like sports and general exercise. For INTJs, this isn't a prominent feature (as it’s their 4th function), but they may have a slight edge in athletic ability. My dad was apparently awesome at basketball when he was younger. He is 50 now and can still take me in a 1v1 (I'm an in shape 19 year old lol). \nAnyway, these are the slight differences in sensing functions between the two. Now for feeling.\nFi vs Fe\nBoth INTPs and INTJs aren't fantastic with emotions. However, their faults are quite different.\nFe is INTPs 4th function and therefore malfunctions quite a bit. Fe is involved in feeling and understanding the emotions of those around you. It is also involved in how well you can express your feelings. For INTPs, they tend to be very oblivious to others emotions, often making jokes or being sarcastic in ways that can hurt those around them. It normally isn’t until after they say something that they realize where they’ve gone wrong. It tends to be the misconception that INTPs don’t care about others emotions, but they honestly do. It is more that they are so awful at expressing that concern for others emotions that they tend to avoid it all together, making them seen disinterested in them (especially when they let things slip out that they didn’t realize would hurt others). \nAs for their own emotions, their rational brain tends to suppress the processing of any emotions they are having on the inside (which is Fi, their 8th function) and this makes the expression of those emotions practically non-existent. However, in the rare occasion where INTPs emotions have been so highly stimulated that it is brought into conscious awareness (which is incredibly rare because 8th functions almost never make appearences), they tend to feel very helpless as they aren’t used to having to deal with emotions. A healthy INTP would know that they need to let these feelings escape, and turn to someone for help. Unfortunately though, many try to push their emotions away, which is like fighting gravity. Their emotions persist to grow as they are being ignored until they become so big that they drive an INTP to partake in reckless behavior, which is very outside their normal character. These are under extreme circumstances, however.\nA well-developed INTP would be someone who can empathize and relate their emotional experiences with others. They also wouldn’t fear the expression of their emotions even though it might not come out so pretty.\nAs for INTJs, their emotional world is much different. INTJs are much more in-tune with their emotions than INTPs. They can see their changes in moods coming from a mile away, while INTPs cannot. If they are in a bout of emotional turmoil, they are much better at handling those emotions internally rather than expressing them to others. Because Fi is the function for processing one’s emotions on a deep level, this tends to help drive their Ni and turn their dreams into reality.\nWith Fi’s, they can have moments of selfishness or excessive, belligerent behavior to defend their emotions. During some dark times in my family, my dad used to have a huge drinking problem and would become somewhat violent when he was drunk. This is an example of higher Fi, as Fe is deep in their unconscious. They can be very un-empathetic because they are more concerned with their own emotions. If caring for your emotions greatly impedes on their own emotional state, they will not try to do so.\nHowever, if they are not within the emotional context of a situation, INTJs can be great people to turn to. Because Fi is much stronger than Fe, as long you are important to them and you are in a serious life crisis, they can have an empathy towards your situation that can go intensely deeper than an INTPs. They may have trouble expressing it to you, but you can see it in their eyes and general demeanor that your situation is impacting them, too. I turn to my dad whenever I am in a scary place in my life, and he is a great person to talk to in order to work things out.\nSo the difference between the two types, INTPs are horrible with understanding their emotions and even when they do, they have trouble expressing them. They have trouble picking up on others emotions, too, but when they do, they can become connected with those people easily. INTJs DO understand their emotions, but don’t feel the need to express them, nor do they worry too much about others. Only in certain circumstances do they feel the need to sooth others emotions.\nI read someone say this somewhere in this sub that described it well. “INTJs are the coldest human-beings; INTPs are the warmest machines.”\nAnyway, that’s it for the functions. Sometimes looking at people’s face personalities can make them confusing, but if you break them down into parts it’s easier to see what you are. If you need anymore assistance distinguishing between the two, just comment and I’ll try to clear things up more.\nIf you still aren’t sure what you are, here’s a good way to tell: If you tested INTP, but then found ways to relate to other personalities and are constantly re-evaluating whether you’re really an INTP, then you probably are one. If you accepted that you’re an INTP or INTJ right away without trying to analyze it too much, then chances are that you’re an INTJ. Kind of ironic.\nBut thanks for reading, peace.\n\n"}]]}