{"data": [[{"title": " Critical Examination and General Discussion of Jordan Peterson: Week of May 04, 2020 (self.JordanPeterson)", "likes": "2", "comments": "5", "content": "Please use this thread to critically examine the work of Jordan Peterson. Dissect his ideas and point out inconsistencies. Post your concerns, questions, or disagreements. Also, defend his arguments against criticism. Share how his ideas have affected your life.\n\nWeekly Discussion will go from Monday to Sunday. \nThe Critical Examination thread was created as a result of this discussion\nView previous critical examination threads.\n\nWeekly Events:\n\nDigital Meetup\nBook Club @ JBP Discord\n\n\n"}, {"title": " Jordan Peterson: Call for Illustrations for New Book (self.JordanPeterson)", "likes": "155", "comments": "82", "content": "From Jordan Peterson's Blog Post: https://www.jordanbpeterson.com/blog-posts/call-for-illustrations-for-new-book/\n​\nI am currently in the process of writing my next book, and am searching for an illustrator to produce 12 images. Each chapter of my previous book, 12 Rules for Life: The Antidote to Chaos, was preceded by one line drawing, which was placed on its own page, in the following fashion:\nhttps://preview.redd.it/l4la0h5oojq41.jpg?width=1280&format=pjpg&auto=webp&s=109acae27ba6807441f9cfb6b6345095e809a052\nI am planning something similar with the book I am working on now. The new illustrations must be line drawings, in black and white (because the book will not be printed in color). They will occupy a page at the beginning of each chapter—just as indicated, above. They also do not have to precisely duplicate the style of the previous illustrations, although they should bear some relationship to them, as the two books are companion volumes. In keeping with this, they will not be required to feature children. All twelve are included at the end of this document. \nIn consequence, I am searching for an illustrator. I would like those interested in applying to produce and submit a variant of the Tarot card image of the fool, with a theme similar to that portrayed immediately to the right: \nThis is a Rider-Waite Tarot card image, and it is still under copyright protection in the UK and, perhaps, elsewhere (although not the US). Thus, I require a drawing that maintains all the main themes of the card, is still self-evidently tarot-card like, but is sufficiently different to avoid copyright violation. I make the following reference to The Fool in the chapter that the image heads: “The Fool is a young, handsome man, eyes lifted upward, on a journey in the mountains, on a sunny day—about to carelessly step over a cliff (or is he?).” This commentary has to continue to make sense when referring to the newly produced image. The chapter is entitled Do Not Carelessly Denigrate Social Institutions or Creative Achievement.\nThe second image in the carousel is another version of the fool, from an older deck, which might also be considered for additional inspiration.\nhttps://preview.redd.it/oi39zjhqojq41.jpg?width=543&format=pjpg&auto=webp&s=fe5eecb5b20560f9025b81c2b179e326c4becbb6\nhttps://preview.redd.it/5orl16fsojq41.jpg?width=600&format=pjpg&auto=webp&s=703931754345a36af9d7aef989ce4b30f2626b88\n​\nInstructions for submission:\n\nThe drawing should be a black and white line drawing rendition of “The Fool”\nEmail should include your expected compensation per drawing if you are selected.\nSent to [careers@jordanbpeterson.com](mailto:careers@jordanbpeterson.com)\nSubject line “12 Rules Illustrator“\n\nThe submissions will be reviewed started April 9th, and will be accepted until an illustrator is chosen. Thank you for your interest.\n​\nJordan details the 12 New Rules in  S2E40 of the podcast:\nhttps://www.jordanbpeterson.com/podcast/s2-e40-beyond-order-another-12-rules-for-life/\n(Thanks to u/Fictionalhead for bringing this up in the last thread)\n*****Edit April 5 *****\n12 New Rules:\n\nDo not careless denigrate social institutions or creative achievements.\nImagine who you could be and aim single-mindedly at that.\nWork as hard as you possibly can on at least one thing and see what happens.\nDo not hide unwanted things in the fog.\nAbandon Ideology\nNotice that opportunity lurks where responsibility has been abdicated.\nDon't do things that you hate.\nTry to make one room in your house as beautiful as possible.\nIf old memories still make you cry write them down carefully and completely.\nPlan and work diligently to maintain the romance in your relationship.\nBe grateful in in-spite of your suffering.\nDon't allow yourself to become resentful, deceitful, or arrogant.\n\n(Thanks to u/Harcerz1 and u/zikeo1012)\n​\n\n"}, {"title": " [myth] Jordan Peterson's view on transgenders is the same as Ben Shapiro's ... [fact] Peterson has a much more mild, open view that is open for gaining clarity (self.JordanPeterson)", "likes": 0, "comments": "1", "content": "Jordan Peterson's view on transgenders (short youtube video):\n(1) Peterson would, when perceiving a transgender person who he believes is not trying to make a power play, refer to them by whatever pronoun they prefer\n(2) Peterson says it is important not to allow laws and bills to be made that require citizens to label genders accurately according to a person's perceived gender; because it leads to endless complications as new types of gender identities are discovered/surfaced, because it prevents freedom of speech, and because it allows even non-transgender people to abuse the system and get attention even when they aren't actually transgender\n(3) Peterson openly speaks about not understanding what it means to be transgender; he doesn't claim to know the implications and what is going on in the lives of transgenders\n​\nBen Shapiro's view on transgenders (best/shortest youtube video I could find):\n(1) Shapiro says [in the video in the link] that he would refer to someone who is transgender as being their perceived gender *when* there were a functional reason, such as if he were going to dinner (in theory) with Blair White (a transgender woman), he might say \"my table is with that woman\", referring to Blair White as the gender that she outwardly appears to be (and the gender that she prefers to be called) ...\n(2) ... in virtually all other videos and content, however, Shapiro says that he only will use pronouns that match biological gender at birth, and that he avoids using pronouns at all when possible to avoid that conflict/confusion; he prefers simply referring to people by name, not using pronouns at all, he says in the video link\n(3) Shapiro says [in a different video] that transgenders are \"mentally ill people\" and they need help, while he doesn't seem open to learn about the science behind what transgender people experience and how being gendered according to their perceived gender brings so much emotional relief (with brain scans for evidence)\n​\n... Jordan Peterson has been a positive influence in my life. And I have consumed many hours of his content. ... I recently had a very large break through in self-awareness, and I had to review Peterson's perspective on transwomen to see how they reflected on my on beliefs. ... I recently discovered that my deeply suppressed emotions and my personal strange jealousy and idolization of women likely comes from the fact that, like many transgender women, my brain seems to have developed as female before birth, though the rest of my body seemed to have already formed as a male unborn baby at that time (explained the science video in the above paragraph).\n​\nIt was a pleasant surprise to find that, Peterson's ideas did not contrast my own emotional needs to start finding ways to express myself in a more sophisticated, feminine way, so as to appease my female brain and emotions that I've been burying and hiding from myself and others for so long. ... As I find ways to express myself in more and more sophisticated and feminine ways, my long-lost sense of sense of emotional identity, sense of emotional stability, sense of confidence in being myself -- these are finally returning to my life, allowing me to start living and expressing, instead of burying and distracting myself like I used to, before I discovered myself. ... Peace.\n\n"}, {"title": " Hope!!! (self.JordanPeterson)", "likes": 0, "comments": "1", "content": "Jordon, I just want to express my most profound thanks for your willingness to endure the pressure and abuse that so many have tried to heap upon you because of your willingness to challenge the insanity of so much of the dialog that infects our world these days. Peoples’ fear of anything that would lead them to discover their emptiness and lack of purpose is most intense, and their anger at being “robbed” of their defenses leaves you in their minds as an evil threat. Stay strong brother. Regards, John\n\n"}, {"title": " Dream Realization (self.JordanPeterson)", "likes": "4", "comments": "1", "content": "I recently had a dream that I realized I was dreaming downtown of a busy city. I remember looking at the people walking around and yelling at them \"I'M IN CONTROL, YOU ARE NOT IN CONTROL.\" I felt sheer power over them and I knew what they were.\n\n"}, {"title": " [ ] Thanks Jordan (self.JordanPeterson)", "likes": "3", "comments": "1", "content": "Thanks Jordan\nI am having been dealing with depression since I was 15 years old, I'm 24 now.\nI went to psychologist when I everything became too much to handle when I was 20 and the psychology treated me really badly and turned everything to be my fault. This was first time I open up about myself, doubt and hate for myself. I listen to everything she said and took it in that I am worthless person.\nThen started to self-harm because I wanted to feel anything. I told my psychologist I was doing worst but she did not listen to me. I started to beat myself down every day and told myself I am worthless, and everyone will feel better with me gone. So, 28 November at 03:58 2017 I wrote my letter. That date and time is so burned in because I wrote my suicide latter on the computer and my roommate was coming home at 05:00 so I had to hurry up I said to myself. I did not succeed with it and I told myself I am joke I cannot even take control over my life and end it. I felt like failure with everything in myself. \nI don't have any close friend that I could talk with about my feeling so best thing I could done that I slipped up at work and mentioned the letter and one person that person took it serious and took me to the hospital but i didn't want to go because I was treated so badly when I reached out for help first time. But she went with me to the hospital and it was best thing ever happen in my life. But because our hospital system is overworked. I could not talk that long with psychology, but it was better than nothing. It helps me to crawl out when I was in the darkest part in my life.\nSo I don't have psychology right now and I'm on venlafaxine it helps but I don't like to take them because I feel numb and empty so no feelings at all I just become robot, but if I don't take them I sit and do nothing expect think back to my life and started to harm myself again with knife. \nEverything is so hard right now in life, I do not have any friends because I shut myself in for so many years and did not want to talk to anyone. My family act like nothing happen doing those years and I feel like I am wearing a mask. I think about a lot who am i, why do I keep going up everyday?\nDoing this corona and quarantine I just sit home alone with my thoughts and I think I am starting to go mad because no contact me I don't contact anyone because I don't have anyone close to talk to.\nWatching your video about depression helps me to really think about my depression and I think I'm starting to feel better about myself.\nI hope you see this letter Jordan, I just want to say thank you I'm taking my anti-depression medicine again and trying to walk forward.\n//Anders\n\n"}, {"title": " [ ] (self.JordanPeterson)", "likes": "3", "comments": "1", "content": "Greetings Dr. Peterson. I'm a doctoral student working on my dissertation. I was wondering have you had much experience with treating individuals who present with psychopathic symptomology?\n\n"}, {"title": " Self authoring program difficulty (self.JordanPeterson)", "likes": "3", "comments": "2", "content": "I’ve been doing the past authoring on and of few a couple of weeks and I find it difficult to find significant experiences in my life and how they have shaped who I am. A lot of the experiences I’ve chosen don’t seem very significant. \nAnyone got any advice on doing past authoring? And not just do it badly.\n\n"}, {"title": " Path of the Fool (self.JordanPeterson)", "likes": "2", "comments": 0, "content": "https://preview.redd.it/7n2blvvpwrw41.jpg?width=820&format=pjpg&auto=webp&s=e609fbaf8e736917307e742a0d8f910cd78aff59\nCan we be open-minded, but still hold on to what we believe?\nCan we give it our all, without operating under the illusion of perfection or control?\nCan we be compassionate, while still maintaining healthy boundaries?\nCan we live a responsible live, towards our personal greatest star, while still maintaining openness to being continuously confronted with our limitations and powerlessness?\n​\nYes we can!\n​\nHow? That's what we're here to figure out. falling and stumbling, but wholeheartedly and honestly.\n​\nRemember: The Path of the Fool is the precursor to the Path of the Hero!\nSo stumble forward with a straight back, you phoenix-lobsterboys. you pathetic bunch of wurms, each with a spark of god-consciousness\n\n"}, {"title": " Zizek fans dislike Jordan so much, why ? (self.JordanPeterson)", "likes": "1", "comments": "5", "content": "When sam harris and Peterson talked both sides had respect for each other but when Zizek and Peterson talked Zizek fans seemed to really dislike him. Like they think Jordan is completely discreditable\n\n"}, {"title": " How can I get past my resentment after an experience where \"manipulating the bureaucracies\" no longer worked (self.JordanPeterson)", "likes": "2", "comments": 0, "content": "Long story short.  When I was in early elementary school, I hated being in school, and had some behavioral problems, and was quite bitter and angry about being in school.  Mostly because I hated being forced to go to some institution that expected conformity, and punished kids for being kids.  Eventually I had the realization that complaining about the systems, and acting out was not going to make things any better.  So I realized that I can manipulate the systems to work for my interests.  By this, I dont necessarily mean in a bad way.  For example, I had enough experience to know how to appeal to the teachers better natures, which made the experience of school significantly less authoritarian.  In fact, this worked throughout my last years of elementary school, middle and high school.  I will admit that I sometimes did unethical things to manipulate the system, such as taunting bullies insecurities to get them off my back.\nHowever, once I got into a tech school after graduation, things went downhill, and manipulating the system no longer worked when I did not do so well on a test.  This teacher called me out as not showing much loyalty to the school, and told me to stop doing things my way.  After that, I ended up struggling with school, and only getting C's, despite my efforts.  I know that the teachers at the school all talked, as I overheard the teachers sharing gossip they had on other students.  \nThen I got myself on a quest to find a structure that had no judgmental or tyrannical elements(looking back, I would have told myself \"good luck with that\").  Then I started to develop these myopic ideas about primary school having no judgmental or tyrannical elements.  My first dabbling was to seek out religion, only to find that much of religion, particularly in the Evangelical Christian traditions had a strongly tyrannical and judgmental fundamentalist aspect where they placed literal interpretations of the bible above personal searching.  And on top of that, promised eternal damnation on anyone who deviated from their way of seeing things.  Then I got into a fundamentalist form of Catholicism, which I thought would be safer, due to having other authorities besides a literally read bible.  And the Catholic church is open to the Salvation of others outside Christianity.  But I found that Fundamentalist catholicism could be pretty demanding of their own, and promised damnation to apostates.  I got into a period of anxiety over this fear of hell, and then became released from anxiety when I saw how stupid such a mindless devotion was.  \nThen I developed this idea that right wing structures were the oppressive structures, while the left wanted to create structures to empower the individual and protect them from tyrannies like organized religion, corporations(which I feared were workplaces like the tech school) or other bigots and control freaks.  However I learned how the left could be just as judgmental and tyrannical when they decide who is competent enough to make their own decisions, and then thinks they can \"care\" for those they deem incompetent.  Then I came to realize that there are no structures of any sort that dont have tyrannical elements.  \nBut in the past, using the system to your advantage always worked.  Now it seems like this does not work so well.  I keep asking myself why \"Manipulating the systems\" no longer worked.  And the more I look, I have reason to believe this is so.  I have had some jobs after the tech school in the food service, which was just as authoritarian, and I had to deal with street smart bossy co-workers who did not like me just being on the job till I found something better.   And I have seen with the internet, there are plenty of religious bigots who cyber-harass anyone who they think are heretics.  And I have seen plenty of college graduates who seem so brainwashed by far left propaganda, and act like anyone who does not agree with them as a bigot, fascist, racist or oppressor if you dont see things their way.    \n\n"}], [{"title": " I'm looking for a clip of JP (self.JordanPeterson)", "likes": "0", "comments": "1", "content": "Hi, I'm looking for a clip where JP talks about the understanding of certain statistics. He starts off by talking about rate of aggression being 60% male en 40% female. After that he talks about picking a random person out the 100 most aggressive people, always being a male. \nCan anyone help me?\n\n"}, {"title": " Self Authoring Age Limit/Recommendation? (self.JordanPeterson)", "likes": "4", "comments": "4", "content": "Does Dr. Peterson recommend you to be a certain age if you’re taking the Self Authoring program? I’m 18 and I’m about to finish my first year of university and I was unsure if I should be taking the program. I already bought it but I’m not sure if I should take the time to do it yet. Thanks\n\n"}, {"title": " If someone has a free self authoring code they would be willing to give me, I'd be most grateful. (self.JordanPeterson)", "likes": "1", "comments": "1", "content": "If so please pm, thank you. Will remove/update when needed.\n\n"}, {"title": " Who are the Post-Modern Neo Marxists? (self.JordanPeterson)", "likes": "8", "comments": "13", "content": "I've been brushing up on my 'Jordan Peterson', and trying to understand his world view. And a big part of that is the idea of the 'Post-Modern Neo Marxists'. But who ARE they?\nFrom what I've seen, Peterson gives a cogent explanation of how PMNM started, and that is (to briefly summarise as best I can)... \nIn the West in the 1960's, Marxist Philosophers such as Foucault, Derrida and Lacan, realised they could no longer openly advocate for Marxism (in light of the atrocities of Stalin and Mao). And so they shifted the focus of discussion away from 'flat out Marxist support' to 'Identity Politics'. But 'Identity Politics' is merely a Trojan Horse to spread the same hard totalitarian Marxist ideals which led to the likes of Stalin and Mao.\nSo fine... Peterson gives an explanation of how it started. But as of right now, in the present, WHO are these people? Often times, when Peterson is critiquing PMNM's, he just alludes to ''these social justice types'' which isn't very helpful. Right now, I'm having a hard time nailing the specifics of what kinds of people are PMNM's... Asides from a vague notion that it's possible anybody who is further left than 'centre left'?\n\n"}, {"title": " [A   from a Confused Young Man] (self.JordanPeterson)", "likes": "4", "comments": "7", "content": "Dear Dr.Peterson,\nI'm a lucky and fortunate enough, to have just graduated with a degree in Mechanical Engineering. It's taken alot of sacrifices, long nights, stress, anxiety, hardwork, dedication, and support from friends and family to get to this point. Yet I know this is a minor stepping stone in my personal, social and professional life. As any 21 year old I have dreams and ambitions, unfortunately they aren't of monetary or familial fabric. I have dreams and goals that I would dare put out there in public or say out loud, cause I will be mocked and belittled. It is time for me to start slowly but steadly craving my path in that mountain of a goal that I have set myself.\nAlthough I have an end goal, I currently feel stuck and stagnated; I find it very challenging to push myself during this pandemic and more often than not I find myself confused and staring at this huge dark unknown, that is the future. I have applied to multiple colleges for a PhD program, and I trust my gut feeling that I will not get in, yet it does not worry me. What worries me is failing a second time, since I feel like failing a second time is unforgivable. Through out college I have survived off the fear of failure, yet I want to learn and transition my life into fear of not achieving success.\nI understand that this letter would probably never get to you due to the shear volume of people who write to you but in the off chance that it does. I would highly appreciate some advice on me setting myself those \"unrealistic\" goals (whether it is a right thing to do) and how can I transition my fear of failure to a fear of unsuccessfullness (and if that is even a healthy thing to do).\nHope you are safe out there and that you are taking good care of yourself.\nYosef\n\n"}, {"title": " Blame vs. Responsibility (self.JordanPeterson)", "likes": "4", "comments": "5", "content": "If I am distracted and pained by the words and actions of others, I have forgotten what I can and cannot control.\n\n"}, {"title": " Helios rising: The fading away of Venus's Temptation! (self.JordanPeterson)", "likes": "2", "comments": "1", "content": "The English word family comes from the root word famulus(latin) – which means servant/slave. The groupings of these families(servants) is called a society. The English word society comes from the Latin word socius which means companion. \nIf human society really means fellowship amongst the families, why are they divided into groups and why is there conflict? \nWe think ourselves to be better than the creatures of this earth. But, we are of fragmentation, conflicting each other in all dimensions of our existence. The conscious and the subconscious, the heart and the mind, the man and the woman etc., If we are of superior quality then our world arises with, a feeling of no otherness & no idea of separation. \nOne needs to be at a vantage point to see clearly– that the whole of human world is based upon conflicting paradigms! \nWhat is the relationship between a master and a slave?\nThe whole system is based on sadomasochistic relationship. The evidence can be found in our daily lives. The elements remain that of authority and conformity. A mere tug of war within oneself and with the natural world. \nWe can romanticise, justify Or complain and rebel against but it’s still the progeny of sadomasochism! The echelons are wired together upon this tether!\nThe investigation could only progress by maintaining a constant indifference. If there is an indulgence or refrainment to what is perceived, then that vantage point perception is taken away instantly and one is forced into positions within the system. One must be aware of the system, the fractions within the order, this deep entrenched need to belong, to crystallise, mark, label, into a certain order within the system and the turbulence that surrounds the orders(forcing one to enter the immediate available position). \nFrom the masters of the highest order to the slaves of the lowest order do not possess “this seeing”. Why? Because they have chosen their coordinates within the system and have lost the ability to see beyond. \nThis is clearly seen during this coronovirus pandemic! All of human endeavour grounded upon the psychosomatic syndrome - neurotic impulses and harmonal instincts. \nWho is the ruler of the system? \nOne has to be deeply alert similar, to when standing at a precipice! This alertness is that reflective light. Like that of morning star “Venus”. \nThis alertness is the ruler of the system! It is very clear that the alertness or the light of Venus is secondary or subordinate to the Sun(which is pure light of its own)! This reflective light is not the same as Helios/Sun. It is not a bearer of another’s light, it is of its “Own”.\nVenus is the epitome of arrogance & pride. (Being filled with the Sun's radiance desired to be equal to the Sun). But once THE SUN rises above the horizon the truth is revealed and Venus's emulation end.Thus Venus falls down from its grace(luminance). \nBeing hurt by the actuality of its dullness, jealous and enraged with hatred for the Sun’s radiance , goes ahead to cause an effect, a principle movement to which the system is dedicated. By decieving humans into the system. Tempting the masters with immortality and charging accusations against one another.\nOne must not fall asleep, be enchanted by(Venus)!!! The Dawn is here. \nThe investigative penetration must progress by maintaining an “extraordinary indifference”. The temptation is of immense attraction. If there is a temptation to indulge or refrain from this perception, then the vantage point perception is taken away instantly and one is forced to partake in Venus’s desideratum!\nThe system can only work in descent and never move in continuous ascension. The masters and the slaves void of ascension beyond their own limitations fall endlessly to this temptation and give ears to the accusations!\nThe entire sadomasochistic system exits on the ground of deception(tempt, allow the fall and accuse). \nThe human habituated on this way of existence lack true light! The hearts and minds part of this system are devoid of a relationship with the Sun! Hence still within the boundary of time, always living in the past and looking towards the future! This human never free from the burden of mortality and impermanence! The human has lost his being, to be present in the moment. \nThe system: all activity that has the shadow of the past! Any expression and action born out time, inevitably has the signature of “Venus”.\nIt looks like the system is in progression and it is changing, only at the peripheral! The ruler never changes and thus the system with its legion of masters at the top to the slaves at the bottom of it, never change!\nThe system is illusory just like the light of Venus!!!\n\n"}, {"title": "   to the people who are already in the right path (self.JordanPeterson)", "likes": "5", "comments": "5", "content": "Where did you find your purpuse to aim at, that made you ignore the inevitable suffering of life? What do you fight for?\nA higher salary is not a purpose\n\n"}, {"title": " Open inquiry to Dr. Peterson about teaching in future my unborn son what it means to be a man, and how to funnel his energy and aggression into productive and worthy causes. (self.JordanPeterson)", "likes": "6", "comments": "3", "content": "Hello Dr. Peterson, as well as anyone else reading this text. I am, at the time of this writing, a 23 year old Army infantryman from the united states. My wife is at 17 weeks of pregnancy, and we have been told we're expecting a boy. I am absolutely excited in every way, as well as worried, and hoping for some guidance on how to set good, healthy, and effective examples on healthy masculinity. My wife, as well as myself, have grown up with less than optimal men in our formative years (Abusive fathers). \nThe further into her pregnancy we go, the more determined I become to break the cycle of unhealthy masculinity in both of our families. I consider myself a good man, but as a child, I was stubborn, headstrong, and combative with my parents. I hold much resentment towards my father for the way he treated my mother and I, and to a lesser degree my mother for taking her frustration out on me. \nI am determined to break the cycle, and I assume that our son will likely be just as headstrong as my wife and I (although we have a very strong relationship, our stubborness compliments each other and actually strengthens our relationship.)\nIn regards to this. Do you have any advice or insight on how to set a strong, but controlled example of how to be a man for my son, as well as how to teach him how to funnel his aggression and energy into productive pursuits?\nThanks, And hope you're doing well.\n\n"}, {"title": " [ ] (self.JordanPeterson)", "likes": "1", "comments": "1", "content": "hello Jordan Peterson\nI would simply describe myself as someone whom looks up to you, as i have found a lot of your online\n videos to be a helpful approach to life as a 19 year old. currently i am in Seattle attending the UW and trying to expand my youtube channel during this time. I have a few short ended questions regarding social media and relationships. I have developed some of these questions after watching your lecture videos. Are you avaliable for a 15 minute zoom interview revolving around my 2 topics relating to social media and young relationships?  \n(after the recorded zoom interview i would upload it to my youtube channel where my subscribers can view it)\npeace,\nMonte Amr\n\n"}, {"title": " How wrong is Jordan Peterson? (self.JordanPeterson)", "likes": "5", "comments": "25", "content": "I was suicidal about 2 years ago and found JP on YouTube like many other of you on this sub. He saved my life when I was in the dark. Now that I’m passed that, in reflection of that time and JP’s work, I wonder how much of his work is wrong? Does anyone else have this feeling? I’m always weary of idealizing anyone because no one is perfect.\nEdit 1 : I apologize that I wasn’t more precise in my speech. I know there is already like a weekly discussion analyzing JBP’s work on this sub. I didn’t have anything particular in mind when I asked my question. Just getting a feel of people’s current thoughts on his work. I know he has decades of work so I apologize I didn’t narrow it down.\n\n"}], [{"title": " Documentary (self.JordanPeterson)", "likes": "5", "comments": 0, "content": "Has anyone seen the Amazon documentary TFW NO GF? It's good. I think it does a great job highlighting the same issues faced by young men that Peterson brought up in his podcasts \"Toxic Masculinity\" and \"The Crisis of Masculinity\".\n\n"}, {"title": " Relationship advice for male who's personality is very different from the typical male: abnormally high on traits Agreeableness (96th percentile) and Neuroticism (97th percentile) (self.JordanPeterson)", "likes": "2", "comments": "5", "content": "I would be grateful if I could get some advice from you guys, and from Professor Peterson if he happens to be reading this.\nI'm Male, 26 and my personality is a complete outlier to the typical male - I'm abnormally high on traits Agreeableness (96th percentile) and Neuroticism (97th percentile). What kind of a woman (in terms of her trait percentile scores) would be an ideal partner for me?  \nI know that it's absolutely necessary that I do assertiveness training so that I can stand up for myself more and be able to say no when I need to say no, but realistically speaking, I don't think I'll ever be able to make myself low on trait agreeableness.  \nI'm also very high on Openness to Experience (95th percentile), Conscientiousness (94th percentile) and Extroversion (75th percentile) if that helps.\n\n"}, {"title": " I couldn't have done this without you. (self.JordanPeterson)", "likes": "6", "comments": 0, "content": "Before I begin, first let me say that this is not an attempt at shameless marketing on reddit. That being said, I hope that these words somehow reach the eyes of Dr. Peterson himself, though I am not expectant. \nI have struggled with depression and suicidality my entire life. When I discovered the biblical lectures on YouTube, my life was changed, and it set me on a path of conscientious drive and determination that ultimately saved me from the noose. I have been tossing around ideas for a fictional universe since I was fifteen, but I never had the drive to actually pursue them until I heard the lessons that Dr. Peterson offered in his lectures. With them bolstering me, I was able to put my nose to the grindstone, and hammer out this 522 page, 130k word novel, compose symphonic music for the project, create art, design the website, and do many other things to get to where I am now. More information on the project, which is only beginning, and will see an additional 5 books in the future, can be found at siizeru.com, on instagram @siizeru, or on Facebook. \nI would like to offer Dr. Peterson himself a free copy, as a measure of gratitude for helping me get here, though he has never heard of me. He can reach me using the contact information on the website if he so chooses. \nIf any of you would also like to check out the project, feel free. It kept me from committing suicide many times, and now it is my primary focus in life. \nThank you for your time and energy. I wish blessings on you all.\n\n"}, {"title": " The New Archipelago (self.JordanPeterson)", "likes": "3", "comments": "1", "content": "Who has read the abridged version? Would it be best to read the three versions instead?\n\n"}, {"title": " [ ] (self.JordanPeterson)", "likes": "6", "comments": "3", "content": "Brasilia, may 3rd of 2020,\nDear Jordan B Peterson,\nWhen I was 16 a colleague asked me what was it like to \"be like me.\" That was a weird question, I think she meant was did it feel like to be a smart kid, or to be a fast thinker (maybe that would be more accurate) but anyways I ended up writing a poem about it and a few minutes ago I realized that it has much to do with some of yours thoughts on individuality x group identity. So, without further due I'll try to translate it to you (I do not think it is good poetry, but it might contain good ideas, or at least I hope it does)\n​\nSingular\n​\nI don't wanna hold the world in my hands \nBut I confess I'd appreciate if it were more like me\nJust a tiny bit\n​\nIt's just that sometimes it is a little overwhelming\nTo be a little singular \nIn a world that's always plural\n​\nBecause these eyes when they look at the world\nUsually they go deep\nAnd maybe deep is just too much\n​\nBecause in the insane attempt to do everything differently\nEverything inconsistently\nMade itself more of the same\nI know it is hard to assimilate\nBut this is haw it became unacceptable\nTo be a little bit singular \n​\nHope you like it somehow, sorry if my english was not that good!\n​\nWarm greetings from Brazil,\nMaria Eduarda Barbosa.\n​\nP.S.: It was not that long ago, I'm turning 19 tomorrow. I am also heavily considering to go study psychology by the way.\n\n"}, {"title": " Gender differences in competitiveness: Nature or Nurture? (self.JordanPeterson)", "likes": "2", "comments": "3", "content": "Has he ever spoken similarly about competitive behaviour differences in the gender context? A research article I recently read a research article by UCSD Economist that talks about how competitiveness seems to be very strongly affected by 'nurture' rather than 'nature'.\nI have heard Prof. Peterson make an argument about the inherent difference (on average) in 'agreeableness' between the two genders and how that could be a contributing factor to the wage gap. He has also talked at various points about a) men, in general, being more interested in things than woman, and b) a tiny minority of men willing to work insane hours and succeed at any cost, that could be seen as indicating competitiveness.\n------\nSource: Gneezy, U., Leonard, K. L., & List, J. A. (2009). Gender differences in competition: Evidence from a matrilineal and a patriarchal society. Econometrica, 77(5), 1637-1664. \nLink: https://onlinelibrary.wiley.com/doi/abs/10.3982/ECTA6690?casa_token=-ytWTPgsTAQAAAAA:RQMh8OqS6fi64Xdcpo7wc--P9xLFUp97aToAtBNl-B8u2HtJDY3Lv4M0AbstJJWhb6aHncrL7IPz8ac \nP.S. I have not read his books but only seen his talks so I am in no way claiming familiarity with his complete thesis.\n\n"}, {"title": " Need a source for a uni paper on Peterson's claim about postmodernism (self.JordanPeterson)", "likes": "3", "comments": "15", "content": "I need a source, preferably from someone such as Derrida on Peterson's claim that 'Postmodernism is essentially the claim that (1) since there are an innumerable number of ways in which the world can be interpreted and perceived (and those are tightly associated) then (2) no canonical manner of interpretation can be reliably derived.'\nAnother question, is this claim basically what deconstructionism is? Thanks.\n\n"}, {"title": " Neuroticism? (self.JordanPeterson)", "likes": "5", "comments": "8", "content": "Hi guys. My neuroticism is 96 percent. Should I worry. How can it be fixed. Im new here. Just started reading 12 rules.\n\n"}, {"title": " Does anyone have a list of interesting books that Jordan Peterson has recommended in his lectures? (self.JordanPeterson)", "likes": "2", "comments": "1", "content": "I trust this mans opinion so much that I’ll read anything he says is worth reading lol. Any books you’ve read thanks to him will be welcome!\n\n"}, {"title": " We Need to Talk About Kevin: The Triumph of Seduction in the Movie Moonlight (self.JordanPeterson)", "likes": "3", "comments": "1", "content": "I'm not sure where this essay belongs, but I've been obsessing over it for a very long time, and I'd like to share it...\n​\n​\nWe Need to Talk About Kevin: The Triumph of Seduction in the Movie Moonlight\n​\nThe first time I saw Moonlight I was swept up by its beauty. I wasn't sure what to make of the movie intellectually, but I was moved by it. Then I watched it again, and I became much more critical of Kevin's character. I couldn't forgive him for betraying and hitting Chiron, and I started to see the film not as a romantic triumph but as a staggering work of tragedy. \nConsider the two primary influences on Chiron in this movie. One of these influences is Juan. He's an imperfect man occupying an imperfect existence. He preaches swimming and self-empowerment. The other influence is Kevin. He's an enigmatic creature of the night, and he preaches floating. One of these influences strengthens Chiron. The other one weakens him. \nWhat's mystifying (and a little disturbing) is that Kevin has been widely accepted as a positive influence and a worthy romantic interest, but Kevin is, at best, a coward, and, at worst, a sort of nihilistic succubus. And I think it's relevant that this went unnoticed by the moviegoing public.\n​\n​\nChiron's story begins and ends in a dark room. I'll get to the end later, but I want to start at the beginning when little Chiron is chased into an abandoned apartment by some boys with sticks. Juan is a pillar of strength and masculinity, and he first demonstrates this by literally ripping Chiron’s wall down and stepping into his dark, private place. Juan then opens the door for Chiron and offers to lead him out into daylight. He tells the boy it can’t be worse out there than it is in here, alone in the dark. Juan immediately becomes a father-figure and a role-model for Chiron, but he also challenges Chiron and encourages him to define himself by himself. \nWe first meet Kevin after a lovely game of smear-the-queer in which a cluster of fun-loving boys take turns grabbing a ball and getting pummeled by one another. It’s innocent, harmless fun, and it’s portrayed as such with sunshine, a sweeping camera, smiling faces and a lovely, orchestral score. This is a group of boys who trust each other enough to dance on the edge between play and violence. That’s the fun of smear-the-queer. It’s absurdity bordering on chaos, and anyone who dares pick up the ball faces both the wrath and the mercy of the unbeatable masses. You have to trust the group not to hurt you. And even when the boys roll the ball pointedly towards young Chiron--daring him to become the queer that they may subsequently smear--the boys do so lovingly and supportively with giddy anticipation. They’re not bullying him but merely pressuring him. They're inviting him into the game and into the group. They're inviting him to share this beautiful day with them. They're attempting to baptize Chiron with play.\nIt’s interesting that Kevin is the one who steals the ball and runs with it before the group has a chance to convince Chiron to play with them. I suppose we could interpret this as Kevin saving Chiron from the tyranny of peer pressure, but we could also interpret it as Kevin sabotaging the group’s concerted effort to get Chiron to drop his guard and allow himself to have a little fun. Now it's possible that Chiron just isn’t an athlete, or he simply doesn’t want to be tackled, but then why is he out there on the field? Doesn’t he want to play with the other boys? Doesn’t he want to be included?\nWhen Chiron leaves the game of smear-the-queer, he's quickly joined by Kevin. Kevin has a knack for finding Chiron when he is alone and lacking a sense of connection, and here, in their very first private meeting, Kevin supports Chiron and takes his side. What’s interesting though is that the smear-the-queer game never felt all that threatening. There was social tension and a divide between Chiron and his peers, but it was a harmless situation. Kevin, however, chooses to treat Chiron like a victim. \nIt’s also interesting that Kevin shoves Chiron to get his point across. He tells him he's acting soft, and that he needs to get stronger. Chiron’s response is interesting. He defiantly states, \"But I ain't soft.\" And as far as we can tell, he's right. The kid takes care of himself. He’s observant. He’s got an inner strength about him. Yes, he’s ducked a few physical challenges thus far in the story, but he’s very young. He’s learning. He’s not weak. He’s just not ready to unleash himself into the world at large.\nAnd so Kevin offers a private bout, and the boys tussle in the grass. This is a bonding moment for Chiron. He’s seemingly found a sparring mate who will support his growth in private. Kevin’s friendship is special to Chiron. Kevin’s attention and sympathy are special. It’s a new form of protection from the tyranny of the world. Or so it seems, because Kevin’s motives are less than clear, and they are increasingly less clear in subsequent sequences. What is clear is the contrast between violence and sexuality that this little roll in the grass is setting up. Is Kevin teaching Chiron how to fight and to play and how to exist in the world (out in public and in daylight) or is he pulling him away from others? Is Kevin seducing Chiron? Is he dragging him into the dark?\nThe next time we bump into Kevin it’s accidental. This is interesting, because it’s always Kevin who seems to find Chiron. But in this instance, Chiron has caught Kevin sneaking around with some boys behind closed doors. And rather than push Chiron back out into public (and into daylight), Kevin sucks him in and locks the door. And how you view what comes next is likely going to define how you view the rest of the movie, because these boys are standing around and showing each other their penises. I’ll note that there is nothing particularly engaging about how this sequence is portrayed. The boys are not laughing. The mood is stale and uncomfortable. It's a drastic contrast to the smear-the-queer sequence--and a drastic contrast to the dance class Chiron was enjoying before this encounter. There is no music, so you’re basically left to decide for yourself whether or not this is a good or a bad situation. So what do you see? Is this just boys being boys? And what about those boys with the sticks? Were they just being boys? Who's bullying who? I suppose this is all relative.\nBut imagine for a moment that Chiron is a little girl being trapped in this room with these sneaky older boys. How obviously alarming would that be? We’d be calling for little Chiron to run and hide from these perverts the same way he runs and hides from the bullies at the beginning of the film. We’d want these perverts exposed and punished. Instead, maybe we’re tempted to give homosexual perversity a pass where we most definitely would not give heterosexual perversity a pass.\nWatch what happens in this movie. When Chiron becomes a teenager he finds that one of his peers wants to fight him. That’s the bully we recognize. The bully we fail to see again and again is the one who wants to fuck him--the one who wants to privatize and subdue him.\n​\n​\nTerrel is the dreadlocked bully in the second act. He has it out for teenage Chiron for seemingly no apparent reason other than the fact that Chiron is an easy source of power for Terrel. We’ve seen this sort of bully many, many times in many different movies, and he plays by the unwritten rules of bullying. He rides Chiron hard. He calls him names. He bumps him. He threatens to hit him. But the idea here is that Terrel can do whatever he wants to Chiron as long as Terrel himself doesn’t start the fight. He’s baiting Chiron to throw the first punch, and Chiron doesn't take the bait. But Terrell isn't interested in proving his physical advantage. He's simply interested in exploiting it and seeing what he can get away with because of it. \nI’ll come back to Terrel in a bit, because this is a good time to take a closer look at teenage Kevin. Firstly, there’s the scene where Kevin brags incessantly about his sexual exploits. And then there’s Chiron’s strange dream where Kevin sexually pummels a young woman in the moonlight and then turns to Chiron sinisterly and invitingly (much like Tyler Durden with his yellow kitchen gloves). This is the first of two dark, sexual dreams about Kevin. \nAnd then there’s the hand job. And what a hand job scene it is. The moonlit lighting. The intimate close ups. The waves crashing on the beach. The tension and the vulnerability. The crushing, existential gravity. But what's going on here? Is this love? Is this connection? Is this sustainable? Or is this something more temporary? Is it fleeting? Interestingly, there's a close up of Chiron’s hand grasping the sand. It's as if he’s grabbing something he can’t hold onto.\nIt’s notable that Kevin just sort of appears in this sequence. He emerges from the shadows and steps out into the moonlight at the exact moment Chiron is at his most vulnerable and in desperate need of connection. This happens a lot with Kevin. He's sort of conjured up every now and then, but he doesn't seem to exist in Chiron's life full-time, and we never get the sense that there's much of a history between them. In fact, Kevin often feels more like a presence than a person.\nSo here Kevin comes when Chiron needs a friend, but Kevin doesn't offer true connection. He merely offers temporary transcendence and an escape from the void. This is the sort of faulty exchange Chiron’s drug-addicted mother would make. So it's relevant that Kevin initiates this seduction with a joint. This is how Kevin gets Chiron to drop his guard and share experience with him. But it's not just the joint that comforts Chiron. Kevin's cozy ideas also play a part in this seduction. He talks poetically about the sea breeze and about the temporary relief it brings. But that's all Kevin ever is in Chiron's life. He's something temporary that carries no weight. \nWe are introduced to the idea of weightlessness earlier in the film when Juan teaches little Chiron to swim. At first, Juan holds the boy in his arms and shows him how to float, but then Juan pushes Chiron away and challenges him to swim on his own. That’s the triumph of the scene. Not the floating. Not the suspension. But the swimming. The self-governed action. It's an absolutely magnificent moment in the film, and it's worth remembering going forward. \nBut back to that hand job Kevin gives Chiron. There’s a similar scene in the opening episode of the HBO series The Night Of. The main character is swept up by a beautiful creature of the night, and he takes drugs with her and then enjoys a wondrously romantic moment on a glimmering shore. But that scene is purposefully manipulative. It butters us up for the horror to come (the girl is ambiguously murdered), and so there’s a foreboding element intensified by their drug use. There’s a sense that something isn’t right. Something feels too good to be true. And composer Nicholas Britell's haunting score at the end of the meeting with Kevin seems to suggest something darker as well. \nTeenage Chiron seems unable to distinguish the difference between sexual stimulation and interpersonal connection, and so he sort of falls for Kevin in this sequence, because Kevin makes him feel good, and he makes him feel cared for. And this is, ultimately, Chiron’s fatal flaw--which is why Kevin, as a sort of succubus, has so much power over Chiron. Far more power, even, than Terrel the bully, because Chiron trusts Kevin. But Kevin is a toxic influence on Chiron.  \nI realize Kevin represents the unknown and the unexplored, and so, sure, he can’t be presented as something straightforwardly safe, but what exactly about the guy is trustworthy? Is there anything not suspect about him? He is constantly tempting Chiron with cliche temptations such as drugs, lustful sex, and alcohol. Maybe these things have become so familiar that we struggle to identify them as symbolically bad behaviors, but the reason lustful sex, drugs, and alcohol are such tired clichés of bad behavior is because they so accurately portray empty behavior. These things offer convenient and temporary senses of relief and connection while suspending growth and the call to greater action.\nThis, to me, is the most annoying thing about Kevin. He doesn’t offer anything truly novel or truly creative. He doesn’t offer growth or stability or community. He doesn’t offer any sort of push towards passion or purpose or responsibility (the way Juan and Teresa do). He just offers the same old tired temptations.\nOf course, the worst and most telling moment in the film is when Kevin betrays and hits Chiron. This is when Kevin fully exposes himself as a fraud. Kevin cannot stand up for himself or for Chiron, because Kevin is a coward who lives by night and not in the daylight. And so here in the daylight and in public Kevin is weak and easily coopted to do to Chiron the very thing he pretended to offer him shelter from. Violence. Bullying. The physical dangers of the outside world. \nMaybe we could justify Kevin’s action as simply carrying out a beating that Chiron is going to get either way. We can dismiss all this as if Kevin is simply sparing himself, and as if Chiron is simply agreeing to spare Kevin—but that’s nonsense. First of all, Terrell isn't holding a gun to anyone's head. Obviously the threat of getting hit and kicked is intimidating, but is it so intimidating that it's worth betraying a loved one? Consider if Juan or Teresa were put in this situation. No way they hit Chiron, because those characters have backbone. Kevin is a coward, and his cowardice only adds to the swirling chaos in Chiron's life. \nChiron then makes a critical error himself in the aftermath of this violence. He fails to govern himself. He fails to even hear the voice of reason from the lady across the desk who’s voice literally fades out as she implores Chiron to press charges and to save himself from exile. Instead, Chiron lets his emotions dictate his actions, and he attacks Terrel not to his face but from behind. Cowardice all around. Chaos rules the day.\n​\n​\nInterestingly, Juan, the most powerful presence in Chiron’s life, disappears in the second and third act. We only get to see the loving side of Juan, and we never get to see the more judicious/dominant side of Juan who might lovingly challenge Chiron as he progresses towards manhood. But then we’re more or less expected to believe that Juan’s message was heard loud and clear, because Chiron grows up to be a man in Juan’s image. Maybe Juan would be disappointed that Chiron followed him into the drug trade, but at least Chiron appears well on his way to reflecting the only positive male role model he’s ever met, and maybe he’s even on his way to transcending Juan’s example.\nIt’s hard not to fall in love with this grown up version of Chiron. He's a handsome, physical specimen who commands attention and respect almost inherently. He has taste in cars and clothes and music. He’s superior, and he’s mostly kind. He is the image of Juan (hell, he’s Stringer Bell). And like Juan, this version of Chiron is living his life, very literally, in the sun. This is his kingdom. This is what he knows. This is where he rules. \nYes, Chiron is living a dangerous and potentially destructive life that he's not entirely comfortable with, and it's possible he's headed towards a similar demise as his role model if he continues on this path, but at least he's demonstrating a comfort with responsibility, and at least he's capable of raising and fearlessly protecting his young employee. And, like Juan, he presses his younger employee. He intimidates the kid with his presence and power, and, like Juan, he also checks himself when he pushes too hard. This indicates that Chiron is capable of governing himself as he continues to grow.\nAdult Chiron is not occupying some dark, sinister existence. It is an imperfect existence populated by people Chiron cares about. These are people who make him laugh and people who make him cry. Chiron is even coming to terms with his mother who is now in rehab and no longer acting like a vampire (it's notable that this scene takes place outside during the day). Both Chiron and his mother are learning to put that nightmare behind them, and they’ve both got time to do that. And his mother is now strong enough to assist Chiron in his furthered development as a man. She even challenges the life he's leading, and he reacts aggressively (not quite ready to be challenged by her), but she reminds him that she loves him, and Chiron believes her. It’s the start of a renewed trust between them. There's a genuine connection there. But we never get to see where this relationship might be headed, and how it might shape Chiron going forward, because Chiron got a phone call from fucking Kevin the night before. \n​\n​\nIt's as if Kevin is some evil spirit conjured up by Chiron's sleepless anxiety. Kevin even appears as a darkened silhouette on the other end of the line. And Chiron is immediately weakened by Kevin's presence. He’s suddenly nothing like the strong and responsible man we saw minutes before. Now Chiron is doe-eyed and pathetic. And some might confuse this as romantic, but it’s really just a guy submitting to the clutches of an old temptation that broke his heart and nearly ruined his life, and rather than resist the call and resist Kevin, Chiron attempts to go back in time. Back to adolescence. He wants to go back to that glorious, weightless hand job, because what Chiron’s really trying to return to is his innocence. He wants to return to the weightless drift of a time when he didn’t have to be responsible. He wants to return to a time in his life when he felt cared for.\nThe final act of Moonlight is absolutely gooey with warmth and charm, but isn’t Kevin being overtly portrayed as a siren and a succubus? Think about it. Kevin called in the middle of the night as his shadowy silhouette beckoned on the other end of the line. Then there’s Chiron’s dark, lustful dream of Kevin blowing smoke into the air. And the slimy stain of semen on Chiron’s underwear after he wakes from the wet dream. Kevin even offers to play Chiron a song when he gets into town, and he does play that song when the charm is being laid on so thick there’s hardly room to breathe. It's also worth noting that sirens are known to live on the shore so that they might coax naive mariners into crashing their ships on the rocks. Kevin first seduced Chiron on a beach, and, at the end of the film, he takes Chiron back to his oceanside apartment.\nSo adult Chiron drives down to Florida and steps into Kevin's diner as a total weakling, and Kevin sinks his hooks into him and treats him like a cancer patient. He cooks for Chiron with grace and compassion. He cares for Chiron as if he were some deeply wounded warrior. And Chiron is made into a boy again--as if he’s revisiting the warmth of Juan and Teresa’s dinner table. This is where Kevin implores Chiron to drink the wine, and Chiron hesitates, because he doesn't drink, but he also doesn’t want to break the spell. He wants to live inside the dream world, so he drinks the wine quickly and heavily and only then does he loosen up and laugh. This is an echo of that fateful meeting on the beach when Chiron had to share a joint with Kevin in order to feel more comfortable. \nThen they drive to Kevin’s apartment, and Chiron is drunk and his head aches as he attempts to cram himself into this unfamiliar life. And, yes, Kevin appears warm. He appears comforting. He even appears to have wised up in the last decade. And maybe the point here is to back off of Kevin and the life he has found for himself. He's had his own journey, and he has acquired his own responsibilities. He's made a home for himself on the shore where he can listen to the soothing sounds of the sea (a passion of his since he was a boy). And maybe that's just fine for Kevin. Maybe this is where he belongs--near to but at a distance from the ocean. But Chiron is a swimmer. He belongs out in the water. There's even a moment just before Chiron enters Kevin's apartment where Chiron stops and gazes out at the waves crashing on the beach. Is this romantic? Has Chiron finally found his Eden? Or is it more foreboding? Is Chiron turning away from Juan's teachings?\nIt’s not that Kevin is evil. It’s that his pull on Chiron is toxic. The relationship itself is corrupted--or at least dated. Kevin might feel strengthened by Chiron, but Chiron is clearly weakened by Kevin, and Kevin is not letting him go or pushing him away. Chiron is suffering a crisis of identity. He’s pretending this dream is real and that Kevin and Kevin's life are more than just a temporary diversion. Chiron is also pretending that he can still be innocent. He’s pretending he doesn’t have an example to live up to and that he doesn't have a rehabbing mother and a young apprentice to care for. He’s trying to throw in the towel and admit he's incapable of self-governance. He’s trying to float rather than swim.\nAdult Chiron is absolutely bewildered in the presence of Kevin. His sense of purpose is being compromised, and just like when he was a teenager confusing sex with connection, now, as a diverted adult, he’s throwing meaning into the mix as well. He's putting everything into this reunion, and if we’re floating along with Chiron in this dream, then we’re being seduced right along with him.\nThe point isn’t whether or not Kevin is truly sorry about the past. It’s not whether or not Kevin wants to redeem himself and take proper care of Chiron. It’s that Kevin is incapable of helping Chiron in any meaningful way outside of teaching him another brutal lesson about the nature of gravity. But so much is swept under the rug. What about the last time Chiron trusted Kevin? What about Chiron’s dormant and uncontrollable aggression? What kind of chaos is this behavior paving the way for? \n​\n​\nIn the final sequence of the film Kevin invites Chiron into his apartment, and Chiron is completely stripped of all his armor. He’s forcing himself towards the empty care of Kevin, and Kevin continues to pick Chiron apart. What’s with the gold teeth? What’s with the car? What’s with all this strength? He's basically telling Chiron to stop modeling himself after Juan. And he's not wrong. Chiron can't be exactly like Juan--and Juan would have agreed. Juan instructed Chiron to define himself by himself, and he was also openly ashamed about dealing drugs for a living. But this doesn't mean Juan's example is entirely faulty. It doesn't mean Juan wasn't a compassionate and reliable man. It doesn't mean masculine strength and ambition and dominance are inherently negative characteristics. It just means Juan wasn't perfect, and, hopefully, Chiron can do better.\nBut Kevin basically exists as an antithesis to Juan's example, and, rather than encouraging Chiron to be something, Kevin is primarily interested in telling Chiron what he shouldn't be. Kevin liberally offers critique and disappointment, but he doesn't have solutions. \nKevin also constantly bullies Chiron’s choices throughout the story: wrestle with me and not the other boys, look at my penis, show me yours, smoke the joint, drink the wine, drink more wine, let me touch you, let me hit you, let me call you “Black\" (against Chiron's will). And here in the final act Kevin tells Chiron “you’re not what I expected.” And the berating continues. He asks, “Who is you, Chiron?” And Chiron’s unapologetic answer is “I’m me.” This hearkens back to the first time little Kevin challenges little Chiron as \"soft.\" And little Chiron responds “but I ain't soft.” \nYet Kevin demands something else of Chiron throughout the film, and he continues to demand something as an adult. Kevin seemingly wants Chiron to let go of something, and we’re okay with Kevin challenging Chiron in this way, but why? What exactly do we like about Kevin? What do we trust about him? He's already betrayed our hero once, and he hardly seems to respect Chiron. But, much more importantly, what do we like about Chiron when he's around Kevin? He's always so stiff and submissive.\n​\n​\nBefore I conclude, I want to address the earliest threat to little Chiron’s safety--not the boys with the sticks but Chiron’s vampire mother. Chiron’s mother is, at first, a woman lost in the darkness of addiction and isolation and irresponsibility. She is a woman deprived of meaning, and a woman who is literally unable to exist in daylight. There’s even a frantic scene where she nearly has a breakdown trying to snatch her son from the sunlight, and her disjointed speech in that moment is mirrored later in the film when adult Chiron first gazes into adult Kevin’s eyes at the diner. In both sequences it's as if something’s wrong or as if there’s a disconnect or a distrust--as if a darker influence is present.\nEarly on, we’re shown a frightful image of the vampire mother screaming at little Chiron. She stands at the end of the hallway, glowing in neon pink light (a notable contrast to the blue used to highlight Chiron throughout the film). Chiron’s mother is a literal monster in the hallway looming large and in slow motion. We can’t hear her words the first time we see her, but we do the second time. “Don't look at me!” she screams. But the boy doesn't retreat. He keeps watching, and he becomes a sort of mirror for his mother to see her reflection in. Then, rendered powerless, the monster recedes back into her layer. \nIt's interesting that this is also how teenage Chiron chooses to respond to Kevin's betrayal. He just stares at Kevin and lets him punch him over and over, and this is the only time in the film that Kevin is emotionally shaken. It's also the only time Kevin is confronted. \nBut Chiron fails to keep his eyes open at the end of the film. He never asks, “Who is you, Kevin?” because Chiron is succumbing to the siren's call, and he so desperately wants to believe in magic, and the audience is right there with him--craving reprieve and romance and failing to see the seduction taking place. Kevin appears not as the enigmatic, empty coward he has proven to be but as something strong and confident and trustworthy and wise. And Chiron wants to feel cared for so badly that he submits to Kevin's authority and confesses his deepest vulnerability--that he’s never been touched by anyone else. He's throwing open his borders and proclaiming his disconnection and his loneliness, and he's basically begging for pity and for help. Kevin contemplates for a moment. Perhaps he’ll do the honorable thing and push Chiron back out to sea where he belongs. But, instead, Kevin smiles. He finally got Chiron to admit that there is something wrong with Chiron. And Kevin doesn’t even answer with words but with the sound of the sea breeze--the same fleeting, weightless sound they bonded over as teenagers. It's the sound of being high and living without gravity. Hakuna Matata. It's the sound of nihilism washing over Chiron once and for all.  \nIn the next image we see Chiron (a mountainous image of masculine strength) tucked like a child against Kevin in the darkness. There's a similar shot earlier in the film when little Chiron’s mother is forcing her love onto her son. But at least, as a boy, Chiron had the presence of mind to get up and remove himself from the corrupted caregiver. Here, though, under Kevin’s spell, Chiron is vanquished and lost in the dark--still seeking the warmth he never got from his mother as a boy (composer Nicholas Britell's score here is notable. It's the same eerie music that plays after Kevin seduced Chiron on the beach.). And so, tragically, Chiron is right back where he started (trapped inside a dark room), and we never get to see him apply himself and excel. We never get to see him swim.\nThe popular response to Moonlight has me wondering about the stories people tell themselves when they watch this film. Do they see a capable and unique individual striving to carve out a proper place in the world? Or do they see a poor, gay, black boy in need of sanctuary? Do they want to see Chiron come of age? Or do they just want to see him weep? \nIn the final shot of the film little Chiron is standing on the shore and gazing out at the water. Then the boy turns to us. But why? Is he making sure we’ve got his back as he moves out into the ocean? Or is he staring down a monster?\n\n"}, {"title": " Great books to read, think and write about? (self.JordanPeterson)", "likes": "3", "comments": "6", "content": "Jordan Peterson has recommended to read great books/material, think about it, and write down what you think. It can be just reading a paragraph, pausing to think and then summarize what you've just read.\nIt is this message which grips me, because although I have graduated 2.5 years ago, I feel I'm not articulate. So I'm trying to go to process I should have been through during my years in the education system...\nHas anybody tried this approach? On which particular books have you tried this? I'm just curious. Which books are great for this? Obviously, there are two booklists by Jordan Peterson. However, the suggestions you have don't need to intersect with those on his lists.\nI've been looking at the JBP discord server for the book club, but I couldn't find it, btw.\n\n"}, {"title": " 12 Rules for Life Book Review and Discussion│Rule 1 Stand Up Straight With Your Shoulders Back (self.JordanPeterson)", "likes": "0", "comments": 0, "content": "https://youtu.be/haUrzVoLmHU\n\n"}, {"title": " Book Recommendation: I Chose Freedom by Viktor Kravchenko (self.JordanPeterson)", "likes": "4", "comments": 0, "content": "This bestselling book depicts the author’s rise from the Bolshevik revolution up through the Soviet politburo and defection to the United States during WWII.\nWritten after Aleksandr Solzhenitsyn wrote The Gulag Archipelago and before he published it, Kravchenko covered the same horrific events during the pre-war soviet Communist era. \nFrom the oppressor’s vantage, we see the kangaroo trials, purges and mass starvations that killed millions of people in pursuit of equality of outcome. As Nietzsche warned, it’s a race straight to the dregs of humanity rife with needless suffering.\nKravchenko’s sacrificed everything to give the West an early glimpse behind the Iron Curtain. Rather than be silent, he emerged from the shadows to take a stand so the world may know the truth.\nToday his American son carries on the author’s legacy through his archives despite the young man never knowing his father.\n\n"}, {"title": " Common criticism levelled at dr. Jordan Peterson? (self.JordanPeterson)", "likes": "6", "comments": "32", "content": "Hello y'all,\nFor one of my university courses I have to give a TED-Talk about something I am passionate about. I have chosen to defend dr. Jordan Peterson in mine, because I see a lot of (willful) misconceptions and unfounded alligations regarding him. He has helped me tremendously in my life and it really saddens me to see how some people misrepresent him and his ideas. I want to persuade the listeners of that he is a force of good and not the monster he is sometimes made out to be.\nMy question to you guys is; What, in your opinion, are some of the most common criticisms levelled against him? This way I can make a list of the most important and fundamental ones as I have only a limited amount of time for my speech and I want to touch on the biggest issues.\nI hope you can help me out. Thanks in advance.\n\n"}], [{"title": " Can someone be socially anxious and unassertive but disagreeable? Anyone like this? (self.JordanPeterson)", "likes": "7", "comments": "2", "content": "This is something I wondered. I knew a guy who was working in this club project with. He led the team etc.\nHe would sweat drops when talking to people he respected and was visibly nervous etc. so obviously he really cared about what people think about him.\nWe performed on stage as a group and I could tell he was very self conscious because he would get bad stage fright. You could argue it is anxiety of perfecting a performance, but I think it is really thr same an anxiety of being ridiculed, hence you do care about what other people are thinking.\nHe had anxiety and even took meds for it, but i found him to be very stubborn and disagreeble. He seemed low in openess and was very particular. He often disagreed or openly critisized our group's performance afterwards. He pushed to have his way quite a bit. \nI would say he is moderately assertive.\nThen I know a gal I dated once. She seemed to be disagreeable but I found she sometimes had issues saying no... usually to people she cared about. In fact she was in a very toxic friendship for awhile. Basically her friend kept competing with her and would make a lot of passive agggressjve remarks etc.\nShe at first just ignored it passively, but eventually she started ti assert herself and eventually just ended the friendship with this poisonous girl.\nAnyways... just me rambling but here are the questions i would like to ask:\n\ncan social anxiety be seen as being too agreeable?\nis the disagreeable/agreeable trait related with social anxiety ?\nare you disagreeable but have social anxiety?\ncan you have low assertiveness but high disagreeableness?\nis confidence seperate from disagreeableness?\nI have read that the facet if assertiveness is associated with extroversion.... so why does Peterson put it along with disagreeableness\n\n\n"}, {"title": " Anyone else disgusted by the increasing number of Political/Conservative/Ring Wing posts? (self.JordanPeterson)", "likes": "4", "comments": "14", "content": "What's happened to this sub? First of all JBP is a Psychologist, who's main message goes along the lines of -1)Taking responsibility 2) Jung's ideas 3) Biblical ideas / Mythological ideas 4) Self-help etc. Sure he's commented quite often on political stuff but that's hardly what he stands for. Every other post here which gets like 700 upvotes relates to 'YAY CAPITALISM!' or some random crossover post from the conservative subreddit. If any of you remember in the Zizek/JBP debate, sure he often argues in favor of capitalism, but Peterson himself states that capitalism doesn't solve all of our problems and is fully aware of its problems.\nA few days back I was on r/Jung and saw a topic asking people what do they think of JBP? And I was so glad to see the highest voted comment was \"JBP is a gateway drug to Jung\". But if you look at this sub so many people would just write him off as some conservative bigot, which  just gives him a bad name. He's lifted so many people out of depression/hopelessness and its really sad to see what this sub has devolved into.\n\n"}, {"title": " Looking for collaboration on Self authoring program (self.JordanPeterson)", "likes": "2", "comments": "2", "content": "I am 27 years old with alot of skills but no specific career path. I started out late at 25 than most people my age. I have my reasons but that doesn't spare one of the cost of not acting responsibly.\nThis fact that I am 27 and moderately clueless is hitting me hard and I think the self authoring program will help. \nIs there anyone who would like to collaborate on the cost please?\n\n"}, {"title": " Has Dr. Peterson ever discussed his thoughts on the works of Jiddu Krishnamurti and Rabindranath Tagore? (self.JordanPeterson)", "likes": "2", "comments": "1", "content": "If so, would someone direct me to it? If not, then I would love to hear from him on this. I’m also assuming he has study their works, which I know is terribly presumptuous of me.\n\n"}, {"title": " What actually IS capitalism? (self.JordanPeterson)", "likes": "2", "comments": "36", "content": "As far as I know, it's just a better form of freely exchanging goods for currency instead of bartering. But why is everyone blaming a system of trade on all of humanity's problems? Are these people blaming something else and think it's capitalism, or what?\n​\nWhen someone says \"Capitalism is bad\", are they referring to JUST this system of trade, or are they adding in a bunch of other things? Which things? Are they saying the free market is bad because people aren't rational actors?\n\n"}, {"title": " Frauds in Korea 2020 [Walter R. Mebane] (self.JordanPeterson)", "likes": "1", "comments": "1", "content": "Hello Guys. Nice to meet you. I'm South Korean and Now South Korea is in danger. It's really sorry to HongKong people but South Korea will be Next. In April 15, We have a 21th perliamentary election. but result of election is really strange. Now South Korean people make a question about this result and we know that this election is really frauds. There are so many evidence and problem of statistics. And internationally well-known professor about rigged election published thesis about this election. But, the Leading party, a victoms of this election, is in silence. The News organizations are also in silence. I apply Some Youtube which briefly express about this matter and  link about thesis about this thesis. the Last, We are also processing The White House petition about rigged election. So please help to my country. Thank you very much.  \nThe Youtube Link\nhttps://www.youtube.com/watch?v=qwiS2NFF6XQ&feature=youtu.be \nThe Thesis about Rigged election.\nhttp://www-personal.umich.edu/~wmebane/Korea2020.pdf \nThe White House petition\nhttps://petitions.whitehouse.gov/petition/petition-south-korea-elections-rigged-deliberately-ruling-party-and-moon-jae \nThank you for reading.\n​\nhttps://preview.redd.it/96x9jqjevjw41.jpg?width=850&format=pjpg&auto=webp&s=2b0d70972540e4cf1045695eb67e84ee555ad845\nhttps://preview.redd.it/lnxfwvyevjw41.jpg?width=850&format=pjpg&auto=webp&s=69082dab6556214d384668b5666825de9fc9a8d1\nhttps://preview.redd.it/2981ud9fvjw41.jpg?width=850&format=pjpg&auto=webp&s=d7f455081ec847ca60dc50a9b83b820edf2ab4d8\nhttps://preview.redd.it/iznegco4tjw41.png?width=733&format=png&auto=webp&s=41d94794cf2fe4d700b3ab34a0da7d18f7512321\nhttps://preview.redd.it/vnxaxz25tjw41.png?width=699&format=png&auto=webp&s=c20d653eef7c39d3cff5d47ada3a45cce2c64cd1\nhttps://preview.redd.it/kwvtfdi5tjw41.png?width=666&format=png&auto=webp&s=49ad56b628a62b5ab977f57b08946143bece38a8\nhttps://preview.redd.it/92qkont5tjw41.png?width=705&format=png&auto=webp&s=a65fbeecc28d67629021606ea5d165c309444e01\nhttps://preview.redd.it/jr3zt9d6tjw41.png?width=692&format=png&auto=webp&s=bf5e77e07a6e349aef8eeaf82a75e3a5db3d7852\nhttps://preview.redd.it/i3xpgym6tjw41.png?width=682&format=png&auto=webp&s=62a894ee37a1706f0422cbc2ef6435f25c0aa5b8\nhttps://preview.redd.it/twio1tx6tjw41.png?width=711&format=png&auto=webp&s=5ede017efdb0ff9ff8a292a54482df72435b76cd\nhttps://preview.redd.it/bvuomz47tjw41.png?width=676&format=png&auto=webp&s=edb57c301030ca7b053ec430f4fcfca6bf8bf5fd\nhttps://preview.redd.it/8kvji1h7tjw41.png?width=697&format=png&auto=webp&s=70f3f649a81e27ad659c6bb1cd79c3e47b5c556d\nhttps://preview.redd.it/t9vb7kp7tjw41.png?width=696&format=png&auto=webp&s=8d684e8ae4f36f3e6a53c3274d3ee97e6e8ae039\nhttps://preview.redd.it/aunqm808tjw41.png?width=700&format=png&auto=webp&s=f74ad4b01bd841a25cd3d85983cebdc6aa29ee1b\nhttps://preview.redd.it/b7kg8088tjw41.png?width=697&format=png&auto=webp&s=d9dc24e7dc478f57287c9b3167e31f21c6f4f62a\nhttps://preview.redd.it/adiy7dg8tjw41.png?width=689&format=png&auto=webp&s=c0a4136f4daee7a6a6ba49d74b6510d25f0d459a\nhttps://preview.redd.it/xs8p4kn8tjw41.png?width=718&format=png&auto=webp&s=db5c30c7f011639125d4a0d049cd44a85b158b50\n\n"}, {"title": " \"The real job of every moral teacher is to keep bringing us back, time after time, to the old simple principles which we are all so anxious not to see...\" [CS Lewis, Mere Christianity] (self.JordanPeterson)", "likes": "54", "comments": "1", "content": "Re-reading this quote made my mind jump immediately to Dr. JPB.\n\n"}, {"title": " Conscientiousness Vs Creativity (self.JordanPeterson)", "likes": "2", "comments": 0, "content": "I saw in one of your interviews you mentioned about personality types such as conscientiousness and creativity. How conscientiousness drives people's success  and how creativity is the opposite of it (is it?) and is the driving force behind entrepreneurs. Can a person be both conscientious and creative at the same time? And what are your book recommendations to learn more about this area?\n\n"}, {"title": " Looking for a lecture/quote on the unconscious (self.JordanPeterson)", "likes": "2", "comments": "3", "content": "Dear community, \nI'm currently writing a paper and unfortunately the library is closed so I'm looking at all the resources I have available. I have this quote from JBP in mind, but can't find the exact lecture. Maybe someone here can help me out?\nIt's a short passage on Jungs revolutionary view of the unconscious and that he approached it from a biological (almost darwinist) perspective. I can remember JBP saying \"its older than trees\". \n​\nThanks in advance!\n\n"}, {"title": " Jordan Peterson - GO INTO THE UNKNOWN - Best Life Advice (self.JordanPeterson)", "likes": "1", "comments": "4", "content": "As a big fan of Jordan Peterson, I tend to agree with him 95% of the time, and most  of the time where we disagree it's because he starts talking about Jesus, God and anything biblical to make a point. I am not sure that's something he can prove scientifically as he intends to so so always.\n\n"}, {"title": " Responses to Jordan Peterson Criticism (self.JordanPeterson)", "likes": "0", "comments": "18", "content": "How would you respond to the deconstruction of Jordan Peterson by the left wing - namely Philosophy Tube and ContraPoints on youtube?\n\n"}, {"title": " The Tree - Christ - the fruit: Believing is eating (self.JordanPeterson)", "likes": "1", "comments": "2", "content": "Dear Jordan Peterson,  \npeace - peace - peace\n„THE TREE“ may symbolize the history of our ancestry, our threat by death - looking to the past.\nlooking into the future it may symbolize the tree of life,\nwhich is Christ - the 2nd tree in the middle of paradise -\nChrist is the tree of life, sown into the earth and reaching to heaven connecting earth + heaven\nthe fruit is the identity of the tree with the possibility to multiply.\n- to profit from the fruit, I need to take it and to chew it\n- to profit from Christ is similar: I need take hold of him personally and to „speak“, what he is for me …\nAs Christ is the “archetype of unjust suffering” the sensible way to believe in him,\nis to start with my own suffering and to believe that he is full of empathy for me suffering without any hint of condemnation. First I define the problem. (I define it, not the church or anyone wise ).\nThen I receive His provision for it. Christ's identity is to be a Savior. He finds his fulfillment in saving.\n(believing in empathy, grace and mercy is about taking and receiving – not about matching the facts correctly.)\nBe well and feel deeply loved & highly favored by him, the Savior and king of the hearts…\nChristian\nPS: As a human being Jesus may have appeared with the character of Abel, the shepherd,\nlike a typical second brother: Loving the wild side of life (as carpenter and fishermen's friend),\nin conflict with the establishment, well-spoken, a poet (see Bailey: Poet and Peasant) and\nbeing followed by many women (rich, but independent), „who supplied their needs“.\nTherefore being The Tree \"hanged on a tree\", the crucifixion, may be considered as a special humiliation and in addition the cross as a mocking caricature of a tree - or as a sign how poor men's knowledge is about the one Tree of life, Christ.\n\n"}, {"title": " [ ] (self.JordanPeterson)", "likes": "1", "comments": "1", "content": "Dear Dr. Peterson,\n​\nI'm an online student of yours for quite some time now. As a result of stuying your work and the Self Authoring Suite, a small fairy tale came to my mind and I accidentally wrote it down. I thought, you might like it and I hope you get well soon.\n​\nCheers, Peace & lots of Health!\nTobi\n​\n\"THE FROG PRINCE\nOnce upon a time… there was a little boy who had a dream. In his dream there was a house and in his house was a stairway leading deep down into the dark. He was afraid to see what was down there and he didn‘t want to go, but a magic force compelled him to descend. And at the bottom of the stairs was shrine filled with light and in the shrine was the head of a wise old king wearing a crown. The little boy knew what was there and he knew if looked into the kings eyes, the boy had to die. And he looked and awoke. Born to a narcissistic mother and an alcoholic father, his name was Great Prince T the Frog.  \nHis mother was possessed by three evil zeitgeist-demons. The first was called „postfascist authoritarian upbringing“, the second „consumerist postmodernism nihilistic materialism“ and the third „masculinity hating toxic victimhood feminism“. Later in his life some old wise man would say, that underneath these layers of possession there would have been an inherently good mother, but in fact Prince T had to deal with a damaged caregiver, who‘d rather not be neither able or willing to love, to nurture and instead to beat her own children into submission, to make education as effortless for her as possible and using her Prince T for the fulfillment of her own emotional needs or as a target for her male-bashing fantasies, she was unable to express towards grown-up men, because there were none left.\nThe trouble was, Prince T pretty much felt, that there was shit going on, but he also knew, that as a child he was dependend on this woman and not strong enough yet to escape from her and take care of his own life. Frightened to death, in fear of beeing abandoned, in lack of other choices Prince T decided to split off a part of his-Self, pretending to obey Mommy‘s tyranny, by becoming servile, pleasing and caregiving to his mother. What Prince T couldn‘t know at that time was that this little magic trick came with quite some price he had to pay later. He became so used to playing a role that he started to forget to take off his costume even when Mommy wasn‘t around, even going to bed at night and waking up in the morning wearing his costume. So over time, he started to forget who he really was and the costume began to grow to his skin.  \nThe Kingdom seemed to be in peace, but as years went by Prince T started to realize, that outside of his window the landscape had changed. A strange hill was piling up on the horizon starting to get bigger and bigger and next to the hill an abyss was carved deeper and deeper into the earth. After all Prince T was a curious boy, so he went out to investigate these strange phenomena. He climbed the mountain and investgated the abyss. Sitting up on the hill-top, where he felt so good about himself being such a good boy, he couldn‘t understand the mystery of the pit, where seemingly more and more voices of frightening pain and agony seemed to grow. So Prince T decided to find a way to silence those screams.\nHe went to look for his father, who was hard to be found. Because he either was eagerly working in his workshop to craft some kind of golden ladder to apease his ever so demanding wife or he was somewhere down at the waters trying to collect a treasure of spiritual knowledge at the bottom of the lake. Although he claims that sometimes he saw something shining down there, he used to drown and never really found anything, so he returned to his workshop soaking wet to work on the golden ladder he never got finished, because the lake was calling too strong. It was a strange endeavor, though spending time with his father was consoling. He was a peaceful man, honest in his intentions and kind towards nature. Maybe too kind and a little too weak to protect his family and his kingdom from the ravishing of his wife, since he himself was the son of a father who lost his belief in God in a shattering war. Pretty soon Prince T started to realize that he was stronger than his Dad as a child already and he used to assist or rescue him, when he fell into the lake. This made Prince T very proud and he climbed back on top of the mountain and the screams and voices from the abyss became louder and louder.\nBut Prince T was smart, smart he was and full of creatvity and intelligence and ambitious to solve the problem. He was a great chess player too, studiying strategies and tactics by playing against himself match after match on the colorful, big fluffy carpet next to the dining table of his parents on a hard black and white board. And he perfectened his skills by an age of six to a point where he could pretend not to know the plans and upcoming moves of either one side or the other would do. So actually white played against black in his own single mind, trying to win. And he never lost , but he always forgot.\nAnd he loved to be in nature. He was a blessed child, so he could listen and speak to the creatures and spirits of nature. So one day a toad came up to him and told him to observe and to learn: „You see, it said, I can jump so fast from one branch to another that I‘m faster than the screams. All you have to do, is keep jumping and the screams will never reach you!“. Next came a bright little fairy, with a beautiful tight dress and a lovely smile on her face and she said she lost her magic wand. She gave him some dopamine-berries and said: „You‘re such a good boy she said and I‘m sure we could make a deal that would serve both of us: you have a magic wand and I have some berries to mute the screams, since I have no magic wand to hold on to, you could keep yours busy and as long as you keep your magic wand in action, I will give you berries which make you deaf to these horrible screams!“. Finally there came a merchant down the road pulling a cart. And the cart was loaded with trophies. It was no regular cart, since it could carry as many golden trophies that they would reach up to the sky. He spoke: „Don‘t worry boy, I have a solution to your problem! I have so many trophies here, they could easily fill up the pit. All you need to do, is to be better than others. Each time you put yourself ahead of others in whatever way I‘ll give you a trophy so you can simply fill up the Abyss.“.\nSo it came, that Prince T got bored of playing chess, since he mastered the game. Oblivious about his costume, he used to spend time sitting on the top of his mountain or lovingly rescueing his father from the lake, he became an expert jumping from one branch to another in constant flight. And he discoverd so many more magic wands to wield. Remote controls, video game controllers, communication devices and sweet magic berries growing plastic bags, cans and bottles in supermarkets sold by some other televised glittering fairies. Finally he learned way after way to gain trophy over trophy, which he all tossed into the pit. So, the screames and voices became stiller and stiller, silenced for years and in the kingdom was in peace again. Until one day, he grew up and his father sunk and died at the bottom of the lake. „How dared you to try to save your father? This is a crime in my kingdom for which I am the sole ruler now and you are forever banned!“, his mother shouted. Home and caslte had vanished, lost in foreign lands, all that was left from Prince Ts childhood was a mountain next to an Abyss on the horizon.\nSo he wandered along the pathways of life and strange enough he had so many strange encounters he couldn‘t explain to himself. Since his father had died, he was the king now, but people kept treating him like a beggar and he could not explain. Of course he still wore his costume his mother had sewn. But since it had grown to his skin, he no longer knew about it and could not understand what was going on. „Look at me I‘m Prince T, your king to be“ he shouted. But all the people did was throwing sticks and stondes at him and suddenly he started to hear the screams and voices again from the Abyss. Since his father was no longer there to rescue, he reminded himself of all of the magic tricks he mastered as a child. He kept jumping and jumping from branch to branch faster than ever, but he could no longer escape from the voices. He wielded his magic wand and ate berries to oblivion but the wand became sore and the berries turned bitter and poisoness. And the more thophies were earned, the more they were stolen by others whom had also met the merchant with his cart. His magic no longer worked and the voices from the abyss became as loud as ever, so the last thing Prince T could think of was turning into a frog and hiding from the world in and sitting still in an old dirty pond, waiting for a Princess to walk by and lose her golden sphere. He was waiting there patiently working out his covert contracts unil she finally came.  \nWhen she arrived his eyes were already dazed from years of darkness and tears. Through the curtain of desire and confusion and by the bright shine of the golden sphere she appeared to him as a being of pure light: a loving and kind, soft and understanding hot woman. All the aspects of his mother, he so dearly was missing, he couldn‘t see anything else about her. And seemingly she came and he finally found salvation. And maybe she was, but then he couldn‘t see, when no longer willing react to his infantile needs, she harshly smashed him against the wall. Like a marvel shell his costume-skin cracked and he slided deeper and deeper from the wall down into the Abyss. With deafening noise ancient voices of madness yelled at him and tore him apart. Deeper and deeper he fell and he knew that nothing would stop him fall now and something compelled him to go deeper and deeper. And no matter what curse he would shout at his mother or the princess who betrayed him, it would only echo back at him only a thousand times louder. Finally he reached the ground and no light was left, only sarcastic laughter of a merchant, a ferry and quaks of a toad, poisened berries and iron trophies which turned into thornes. And Prince T fell into a deep restless sleep and started to dream.\nIn his dream there was a house and in his house was a stairway leading deep down into the dark. He was afraid to see what was down there and he didn‘t want to go, but a magic force compelled him to descend. And at the bottom of the stairs was a shrine filled with light and in the shrine was the head of a wise old king wearing a crown. The little boy knew what was there and he knew if he looked into the kings eyes, the boy had to die. So he looked into his eyes and the king spoke to him: „Remember who you are, take responsiblity for your life and virtuously earn for yourself what you so desperately yearn. It‘s the women who choose, but the man who‘s done his work, they cannot refuse!“. And I awoke, finding myself in plain fields, naked. No costume, no crown. Some false visions and memories of a mountain and a pit dimly fading on the horizon. Some other visions and of a home and a castle and a beautiful queen waiting for me to finally return. Some voices in the sky whispering hope and courage, some screams of fear and terrors from the underground of an evil queen trying to get me. A self-made starmap I hold in one hand guiding me and in the other a trickster deck of cards tempting me to do some useless stage illusions with trophies and berries  magic wands and toads. There stands a vine. I pick up an two-bladed sword. I cut the vine. Somewhere in the distance I hear two women screaming: one yearning with lust, one dying in love...\"\n\n"}], [{"title": "  : What is the person that takes cheap shots at the leader? (In attempt to replace them.) (self.JordanPeterson)", "likes": "0", "comments": "1", "content": "I recall Peterson talking about this to some extent, that is was not the effective way to garner respect. I don't recall the specific source. \nThe lesson seemed clear, that a true leader would be likable enough.\n\n"}, {"title": " [ ] (self.JordanPeterson)", "likes": "3", "comments": "2", "content": "Hi there Reddit community :\nI am fearful to post this but frightened enough, lonely enough to do so.  I am reaching out in the hopes that someone among \" us\" has had a similar nightmare and will reach back with something I can hang onto.\nThe precis of this , and please believe me : I have been the survivor of a long term criminal harassment dating back to 2001 .  It has been devastating to my life and to this date he has managed to avoid prosecution for many reasons;  the primary reason being the original responding police force chose to believe they were dealing with a \"hysterical new widow \" to paraphrase their response, and that created a bias confirmation that was followed upon until recently.    As I relocated to evade him : jurisdictional issues became a complicating factor.  I have relocated repeatedly because of this and my health is destroyed.\nI don't know if this is the place to post this but I am hopeful that the community surrounding Dr. Peterson will embrace this and that I might find support and comfort. If this is an inappropriate posting : I apologise .\nThis has cost me most of my friendships because people were overwhelmed or afraid ; either because they believed me or because they didn't , the one person who was strong enough to take it was my best friend but she died last summer and I am breaking without her.\nI have never met another individual who has undergone a nightmare like this . I DO now have police acknowledgment but remain unsafe as he remains at large.  He is financially independent and is therefore at his own liberty as he chooses.  He was a neighbor who obsesses over woman with green eyes and brunette hair . I have reported this  to major crimes RCMP and I believe they are investigating him but I remain at risk and alone.\nHe came within inches of dragging me into the trees of my own property, poisoned animals for me to find, I believe was the person that tampered with my car....it goes on and on....\nI do not know what else to do but reach out to strangers.\nSo...I am reaching out......please\n\n"}, {"title": " What does the Bible say about keeping secrets? (self.JordanPeterson)", "likes": "0", "comments": "4", "content": ""}, {"title": " So let's assume I've got a false relationship with reality... (self.JordanPeterson)", "likes": "6", "comments": "30", "content": "Heroes, \nI (23F) ncountered JBP a few years ago. His thinking opened my eyes to a lot of things, and became to foundation for a lot of change in my life. I have quit using drugs, being promiscuous, smoking, drinking, wasting time, etc. Nevertheless, I am still struggling to escape some circumstances and situations I have created around myself. I believe that what remains of my issues have to do with self-delusion, discipline, and faulty perceptions of reality. \nThese residual hindrances seem to be due to the fact that I've unwittingly relied upon lying and half-truth when faced with difficulty, to the point that the truth about my life (in any situation, from general to specific) doesn't seem obvious to me and in fact, never has. \nI am also facing a situation in which someone whom I love like a sister, and more importantly, someone I respect and have come to consider a great authority, believes that my intentions are impure, that my words don't match my thoughts or my actions, that I am a toxic person who hopes to mask her inadequacy by tearing down those more successful and self-sufficient. In the eyes of this very close person, who has helped me through very much, I am essentially a snake. \nMy own perception of course greatly differs from this. Although I know I am culpable in the many situations that she describes, (most of our conflict is hinged upon my refusal to take responsibility and fulfill specific promises) I do not feel that I am evil. I believe my intentions are pure at their core, but my methods are disordered and dysfunctional. I admit I am defensive, and may even manipulate subconsciously, but I cannot with any degree of honesty say that I want to destroy her, because she is very important to me. \nBut the universe continues to give me hints, and my efforts or actions are met with negative feedback. So, the only thing left is that there must be something fundamentally flawed with the way I perceive and approach the world. I really can't bear living a life corralled by my own self-delusion, because that just doesn't seem worth living. \nDoes anyone have any advice on how I can begin to fix my relationship with reality? Because I must be making some fundamental interpretive mistakes. Thomas a Kempis says \"if your heart would be good and pure, you would see everything justly and rightly.\" \n​\nTL; DR Obviously, my perception is skewed. So, how do I go about un-skewing it? \n​\n[If I have applied the wrong flair, or have unwittingly broken forum rules for asking about a personal topic etc. please notify me, and I will comply, seriously! I just want the input of this specific community, rather than any other one.]\n\n"}, {"title": " Is it just me or do you also think that its very strange from dr. Peterson not to say anything for such a long time? (self.JordanPeterson)", "likes": "3", "comments": "24", "content": "I understand that he needs to recover and he’s been through the most intense period of his life(probably). Maybe we miss some encouragement from people like him during this crazy times or maybe he just doesnt have anything to say? I mean there must be smt wrong. Its either he’s not in good shape or he just keeps quiet because he didnt form an opinion yet regarding this hard situation we are in. We’ve heard from his daughter and Rubin but lets all admit, that info was useless. Apologies english is not my first language. Peace.\n\n"}, {"title": " Why aren't companies hiring lobsters for HR? (self.JordanPeterson)", "likes": "0", "comments": "24", "content": "So imagine you are a company and you have two choices, hire lobsters or SJW for your HR department.\nOne believes in telling the truth, rights and personal responsibility, the other believes in censorship, bullying and no responsibility (eg. loans should be cancelled).\nOne lobster Jordan Peterson has made a bucket ton of money. SJW are behind the \"get woke, go broke\" trend.\nWhich would you hire?\nWhy aren't companies anti SJW?\nDo you think the current status quo is changing? Some memes that SJW may dislike:\n\nget woke, go broke\nSJWs aren't your customers\nSJW will never be satisfied by your pandering to them\n\nAt what point will these memes force a change in hiring and marketing practice?\n\n"}, {"title": " Answers to your questions (self.JordanPeterson)", "likes": "0", "comments": 0, "content": "Aslamualikum Dr Peterson,\nMy name is Habib and I have been following you for quite sometime. I being a Muslim agree with a large portion of things things that you say and in following you, if have acquired alot of answers about life which have helped me in my journey and I am writing to in hopes of returning the favor. You have alot of question about islam and what it is and I being a Muslim would like to think I have some of the answers that might be of some use to you. What ever questions you may have, please feel free to ask them and I shall do my best to answer them for you!\n\n"}, {"title": " When did \"rugged individualism\" become working some shit job rather than actually being a rugged individual? (self.JordanPeterson)", "likes": "5", "comments": "11", "content": ""}, {"title": " Humble critique of his method and higher believes. (Serious) (self.JordanPeterson)", "likes": "10", "comments": "6", "content": "I've been an avid follower of his, reading his book (12 rules for life) and such. I must be wary of a persuasive demagogue, since i really almost believed his every word. He convince you of his beliefs of the world very effectively, with all its inaccuracies to reality.\nAs to my critique; he uses and believes metaphors are analogous and sequential to the actual truth, and not just as a metaphor as such. And that these \"metaphorical truths\" give rise to scientific empirical truth. That these archetypal metaphors are the deepest representation of the maximum distilled factuality the world and a blue print for behaviors.\nWhat it seems, is that he thinks that he is boiling it down to the core principles of the matter. But is actually fabricating delusional and oversimplified abstractions, based on disney movies and story structure, like the fichtean curve. Even when in reality there isn't a satisfying and fulfilling moral story structure in the real world.\n/\nAdditionally: The hypocrisy in his beliefs as a christian, in jesus, in god etc. He said that that any ideas of his is thoroughly attacked and refined from every possible angle. But he refuses to clarify, when questioned in interviews about this belief.\nWhen he does refine beliefs, he does this only using the instrument of metaphors as oposed to let's say, scientific method and emperical reasoning. (He eludes himself of this to protect his vision, but this is speculation.)\nBecause of this, to me it i can only see him now, as a philosopher and a storyteller, not a scientist. I say he is not a scientist, because he does not respect scientific first principles, even though, he uses the tools of it in his studies.\nIt seems to me, that he prioritises the glamour of fictitious story structure over the boring complicated facts of nature. And that he desperately want it to be so for life.\nNow a side from his highly abstractive beliefs, i still think his behavioral ethics, clinical pursuits and self-helpism, is good for people who really need simple guidelines.\n/\nFor documentation this started by me deliberately looking into the critique his reasonable critical opposition, to get a better aspects.\n\nPlease constructively tell me where i am wrong, so that i can be right.\n\n\n"}, {"title": " Personal Bias (self.JordanPeterson)", "likes": "7", "comments": "7", "content": "I have have been heavily influenced by the works of Dr Peterson, and feel that his viewpoints resonate me in many cases as self evident truth.\nHowever, I hold within me a concern if my usage of these viewpoints is purely the incorporation of the compatibility with Dr Peterson’s and my own, or if it is in fact my own intellectual laziness to rely on the standings of another.\nI have listened to the viewpoints of many other prominent figures who occupy a similar space to Dr Peterson, but I still find myself biased towards his.\nMy fundamental question, is how can one tell whether their personal beliefs are earnest and have simply value ranked one higher through comparative analysis, or if it is in fact a prejudiced bias?\n\n"}, {"title": " Can I write 12 Rules of life as a set of 12 Poems without getting sued by publication 🐧? (self.JordanPeterson)", "likes": "0", "comments": "7", "content": "I loved reading 12 Rules of life....\nFollowing the teachings of father figure Jordan Peterson is genuinely beneficial.\nI was also inspired by professor Jordan peterson's advice on writing...\nI started writing and I discoverd the unforseeable benefits of it.\nNow I want to combine my love of writing with one thing that discouraged many and may keep them away from the great teachings of Jordan Peterson.\nI want to minimise 12 Rules of life as a set of 12 Poems.\nThe problem is \nCan I do that? And sell that book or even self publish it?\nEach poem is going to explain the chapters in a short  and fun filled way that's it.\nCan anyone give me advice about this poem book I want to self publish.\nI have no intention of using his name for self promotion I want to transform the teachings into short poems that's it.\n\n"}, {"title": " \"Stand up Straight with Your Shoulders Back\" Changed my Life....and yet.. (self.JordanPeterson)", "likes": "7", "comments": "6", "content": "Hey there! long-time lurker here. Hope everyone is well during these trying times.\nFor a while now I've had my copy of Jordan Peterson's 12 rules for life, and the one that strikes me the most is his first chapter which talks about lobsters. This really struck home for me as it reminds me of what  Academia was like for me. Growing up I didn't have a lot of friends and I definitely wasn't the outgoing type. I was very soft-spoken and easy to be picked on. This definitely did a number on my self-esteem and I assigned myself as a defeated lobster who knew its place in the world. I was never taken seriously, I definitely didn't get the girls, I was always anxious.... Basically the whole package.\nYears ahead at 27, I was actually able to get a partner and I've been trying even more to figure out more parts of me that needs fixing. A few days ago a thought popped into my head that seemed self-defeating yet comforting in a weird way:\n\"I will always be the defeated lobster.\" \nI could understand why it felt comforting because most of my life was in defeated lobster mode and that it was the only thing that made the most sense to me. Sometimes I imagine myself as the lobster that dominated the ocean floor and for a short while I would smile but it seems that I don't fully believe I can. I see myself as the simp, or \"the friend.\" Or the beta cuck as some would call.\nThis is probably based off of emotion, but honestly I don't know how I feel about it. All n all, it was something I wanted to share with you all. Take care and be safe!\n\n"}], [{"title": " [ ] (self.JordanPeterson)", "likes": "2", "comments": "1", "content": "OBS: this request is not for counciling or alike \nDear Jordan Peterson\nAs many others, I have been following you for quite some time and find it quite beneficial.\nI write this post in hope of communication, and i realise I am among thousands of others who attempt the same, but i really feel like i need to! I am a mid 30s Scandinavian man, who were in a traumatic traffic accident when i was 17, and though i am highly functioning (doing a BA now, and have been working before this, i.e. im living a normal life) - my experience of life is very altered and different from other people. My accident was an encounter with a big truck while i was driving a scooter, and beside all the physical damage it cause which were quite alot, it left me with a fractured skull and bleeding and damage to the right frontal lobe.\nI have noticed your interest in the difference between the hemispheres, and i can relate (and to me, whether it is true or not), i can understand precisely what you investigate hence I am living it every day. Uncauseous behavior i.e. difficulty judgeing effects of any given action, a constant fear everyday even though nothings wrong, my working memory is highly evolved due to a damaged shortterm memory, holistic scope of everything, etc.\nAgain, i am writing bcs i truely think that you could help me in any way, and I also could assist you in understanding the brain hence i have a little less than 20 years understanding my own psyche, brain structure, and all it entails.\nI write here since i do not know how to get a hold of you or your staff in any other way.\nNB: i have been to a gazillion doctors all my life, and though they have helped me alot, i havent gotten closer to a more thorough understanding.\nBest regards\n\n"}, {"title": " Peterson's online university - still a thing? (self.JordanPeterson)", "likes": "7", "comments": "15", "content": "A while back Dr. Peterson was talking about starting is own online university. Do any of you guys know if that is a project that is still in the works? I haven't been able to find anything more recent than around 2018 about it :)\n\n"}, {"title": " How do you guys form opinions? (self.JordanPeterson)", "likes": "3", "comments": "14", "content": "Yeah this might sound bizarre and this probably ain't the right sub. Basically, a friend and I were chatting about how people, usually our age (21) have strong opinion on a lot of things. We could also both say things with conviction and be combative but it just feels wrong. Even when I talk about JP's teachings, or talk about stoic teachings a part of me feels that I'm just rehashing what someone else has said. We came up with the conclusion that a) it probably comes with experience b) need to research and analyse science papers c) need to look at both sides. \nHas anyone else felt like this and if you changed that feeling, what did you do?\n\n"}, {"title": " An Interesting Story For Professor Jordan B Peterson (self.JordanPeterson)", "likes": "1", "comments": "1", "content": "The Story Of A Man\nBy Dave Still\nI’ve been following Professor Jordan Peterson on YouTube for a few years now, and his lectures have always had a profound affect me. When I saw one of his videos for the first time, just by accident, as I was browsing through YouTube one day, I felt like he was speaking to me personally. It was like a valve had been opened within me resulting in a wave of palpable relief. I felt like I identified intrinsically with what he was saying, with what he was talking about, like he was my very own therapist, and I’ve been following him ever since. I especially like the fact that he's from around here.\nBecause I have a story to tell about this place.\nDecember 20, 1974.\nAt that time, all was quiet on this western front.\nLike the Town of Machine, it is the end of the line before you hit the mountains travelling from all places east of here.\nI was born on the south and west side of the joining rivers, the Bow and the Elbow, in a hospital that no longer exists. I tried obtaining my hospital records, but they said the the files had been moved to another hospital and were on microfiche and were therefore too difficult to retrieve. Or so I am told; although I have no reason to believe that those who have informed me of my birthplace would have reason to lie to me, gaslighting has not been an unfamiliar phenomenon in my personal experience.\nI lived with my parents and my younger sister in a small house in the community of Marlborough, located in the north east quadrant of the city, on the prairie side, across the creek valley from the mountain side. We lived there until I learned to walk, and my younger sister learned to talk, and then we moved to a newly built house in the small, quaint and picturesque town of Airdrie, just to the north, under the water tower and next to the old hotel. My parents commuted to work in the city, driving the newly improved number two highway between the city and Airdrie they call The Deerfoot, but my mother took time off to walk me to kindergarten held in the basement of the local church when I was five.\nAfter that I walked alone, or sometimes with my little sister, to the public elementary school every day until grade four. I made no friends, as the school was small, but three classrooms larger than a traditional one classroom schoolhouse. Big enough to be anonymous but small enough that there were no other boys my age who didn't pick their noses and smell like goat manure, so I went home each day directly after school.\nWhen I turned ten, the family moved back to Calgary, into another newly built house in the north east quadrant, and I walked with some other kids I met who lived in the neighborhood, to the local public elementary school there until grade six. Then we were bussed on the yellow busses to an inner city public junior high school.\nIn grade eight, however, because of a teacher’s strike in the public school system, my sister and I were moved to a local Catholic school. My parents were mixed protestant and Catholic, so they decided it would be an option better than a babysitter or letting us stay at home by ourselves, missing school, setting the house on fire, not knowing how long the teacher’s strike might last.\nAfter a year in the Catholic school, where I had gotten into a fist fight with another boy who had been giving me a hard time, and had been whipped for the first time in my life because they still carried out the tradition of whipping students at the Catholic schools, for doodling in my notebook during class no less, and my sister having been bullied by some of the other girls, our parents put us back into the public system. But I had lost touch with the other kids I knew from before, so I stuck to doodling. Which they allowed in the public schools. And I got quite good at it, developing a bit of a reputation amongst students and teachers alike.\nSo, after high school I rode Calgary Transit to the Alberta College of Art in north central Calgary to complete a year of the four year degree program, but my grades were not good enough to get into the program I was interested in, so I quit. I went back some years later in an attempt to finish the program, but became disappointed in the prospects of art, and quit for good after the sophomore year. Since then, I have just been a working stiff, driving for a living, all kinds of vehicles except semi trucks; courier vans, instructor cars, hot air balloon chase vehicles, and ultimately buses for Calgary Transit. I even drove the C-train a few times.\nBack in 1974, there was a grocery store located within the inner city neighborhood of Ramsey, on the east side of the river, south of the tracks. A woman named Rose worked there as a clerk. One particular customer, a disheveled twenty something young man, had recently bought twenty seven tubes of model glue in one week, and Rose had realized that the guy probably wasn’t using the glue for model airplanes. Rose had refused to sell to him the last time he stumble into the store, and her suspicions were confirmed when the man became furious with her. He threatened her repeatedly and left in a rage.\n“If you call the police,” he yelled, “you’re in trouble.”\nRose called the police anyway. She’d never had a direct threat to report before then. Calgary was a quiet town, a nice, friendly medium sized western agrarian Canadian city, nicknamed Cowtown for the cattle yards located on the east side of downtown by the trains.\nWhile she waited for an officer, she drew a picture of the man. Harvey Gregorash, a constable in uniform, pulled up in his police car, just after lunch. Rose told him the story, and showed him the picture she had drawn of the man.\nTwenty seven tubes of glue, she said.\nFor whatever reason, Philipe Laurier Gagnon returned to the store. “That’s him!” she said, pointing her finger. Philipe then turned and ran out the door, and Harvey got in his police car to follow him, driving slowly behind him, stumbling down a muddy back alley.\nHarvey pulled up beside Philipe and said, “Hey, you wanna get in the car? I’d like to talk to you about all the glue you've been buying.”\nPhilipe’s nostrils were red, and a thick froth covered his lips. “No way am I getting in your car, man. I’m going home.”\nPhilipe then ran off between two houses, each decorated with Christmas lights. In the car, Harvey lost sight of him, but some people in the neighborhood directed Harvey to a garage on Ninth Street, near the railway. It was a warm, chinook December day, and many people were in their yards. Some even hung laundry, five days before Christmas. They’d all seen Philipe before. They knew him. He had introduced himself as Phil, and said he’d moved to the Ramsay neighborhood so that he could walk to his job at the local poultry factory.\nPhilipe had lived in the garage for a month, though the neighbors didn’t know that he’d arrived on the same day that his parole had expired. They didn’t know that he’d been released only months before from a three year sentence at Drumheller institution for rape. No one guessed he was a glue addict or that he’d twice been involuntarily committed to the Alberta Hospital psychiatric facility. The neighbors barely noticed him. They definitely didn’t know what the twenty six year old had in the garage on the hill by the railway tracks two blocks away from Rose’s grocery.\nThe garage was locked when constable Harvey knocked on the door without receiving any answer. He called on his radio for back up. Two more uniformed officers answered the call, officers Mel Linn and Tomas Dich. They showed up within minutes, and the three of them looked for a way to get into the garage.\nTom found an open window. He shouted at Philip to come out, they wanted to talk to him. “Come and get me,” shouted Philipe.\nTom and Harvey made their way in through the open window. The interior was dark, but they could see that the garage had been converted into an apartment and partitioned into several small rooms. They found the main door, and opened it up so that constable Linn could enter.\nThey found Philipe, sitting in a tiny bedroom, with a plastic bag pulled over his face as he inhaled the glue inside. There was a rifle in his hand.\n“Gun!” shouted Mel. The officers scattered, taking cover.\nPhilipe opened fire, with a .22 caliber rifle.\nHarvey dropped behind a desk. “Philipe! Hold your fire! We just want to talk!” he shouted.\nAnother shot rang out. The bullet ricocheted off the desk and sliced a chunk from Harvey’s scalp above his right eye.\nThe officers recognized a suicidal situation, and Tom ordered his fellow officers to get the hell out.\nAs they ran out of the garage, Philipe shot Tom in the hip. The bullet hit the wallet Tom had in his back pocket.\nThe three officers ran and took cover behind their police cars, their pistols drawn, and screaming into their radios for back up. Philipe closed the door to the garage and locked it. Officers and ambulances swarmed into the neighborhood. Police sped to the scene from all over the city, whether they were ordered to or not, hearing over the radio what was happening.\n“Get back in your house, and keep down,” officers yelled to neighbors who had come out to investigate the commotion. Police cordoned off the streets and evacuated people from their homes. People crouched behind parked cars on the streets.\nFrom inside the garage, Philipe shot randomly though the walls of the garage as officers arrived. He had the .22 caliber gun and a powerful .30 ought six rifle, both altered to fire automatically. The garage was stacked with boxes of ammunition. The gunshots were heard for miles around.\nOne of the first officers on the scene was Detective Boyd Davidson. The forty three year old was in the arson unit and had been only a few blocks away when the first shots were fired.\nBoyde, a former football player, a father of five, was popular with the other officers. His colleagues knew how he’d pushed for an arson unit job after he worked a case with a fire marshal the year before.\nThey’d also heard that he would often visit the criminals he’d put in jail over a 23 year career to help them adjust to life on the inside.\nBoyd took cover with his fellow officers beside a garage on the next property.\nCops were pinned down everywhere the moment they stepped from their cars.\nThe rare lull of bullets from the garage was always followed by another round of fire.\nNews reporters had arrived on scene, and those who got too close found themselves pinned against cars alongside the police.\nNot all of Philipe’s shots missed. One officer was shot in the hand, and another had been hit in the shoulder. Nobody wanted to poke their head out.\nAn officer took up a bullhorn. “Come out with your hands up. You’re surrounded. You haven’t got a chance.”\n“You bastards are dead meat!” Philipe shouted back.\nThe owner of the garage lived nearby, and police told him to draw a map of the interior. The picture was bad news.\nFive years before, the owner had dug a six foot pit in a section of the floor where he intended to put a furnace. The furnace was never installed.\nTo the officers, it was obvious where the gunman was firing from. Worse, the garage walls were made of one and a half inch wood that stopped police bullets, but not those of the heaviest of the rifles Philipe owned.\nAnother officer went to the ground with a bullet wound. Another shot tore into an officer’s throat. Paramedics rushed into the open to drag the wounded to safety. Officers provided a barrage of covering fire for the medics as they sprinted across sodden lawns. Ambulances constantly left the scene with patients and drove straight back when they were done.\nEmergency room staff at Calgary General Hospital gathered around a radio for news reports to anticipate casualties. They shouted questions at the paramedics who witnessed the ongoing shootout.\nOfficers continued to show up at the garage as word spread. More than half of the officers now in danger hadn’t been ordered to respond. They carried rifles, shotguns, handguns and shields. Officers peeked from behind light poles, trees, mailboxes, cars, garbage cans and fences.\nAn hour after he’d started shooting, Philipe Gagnon now held back more than a hundred police officers. It was difficult for the officers, unable to move, to speak amongst themselves in the constant clatter of gunfire. No one knew exactly how many uniforms had shown up or where they were. There were too many targets.\nAnother officer bellowed in pain as he was hit.\nDesperate, officers tried the bullhorn again. “Come out now and you won’t be hurt. Come out now and you’ll be out in time for Christmas.”\n“I got another one of your fucking pigs,” Philipe shouted.\n---\nOfficers decided to try tear gas.\nWhile the tear gas was being prepared, Boyd Davidson reached up with his shotgun to shoot out the windows of the next door garage, to lessen the chance of an officer being slashed by glass shrapnel. Boyd crouched to cover the officers who were chosen to lob the tear gas canisters. Philipe’s next shot burst through the walls of both garages and struck Boyd in the neck. A paramedic ran to his side as the detective crumpled to the ground, bleeding to death.\nThe tear gas didn’t work. The glue that lined Philipe Gagnon’s nose weakened the impact of the toxic smoke, and he continued to shoot randomly, aimlessly.\nAfter an hour and a half of gunfire, the police decided they needed something bigger. They made a phone call to the Canadian Armed Forces Base in Calgary. An armored military vehicle departed for the scene just eleven minutes later.\nThe military vehicle, an armored personnel transporter with tank treads needed a convoy of police cars to make it through Calgary’s afternoon traffic. The powerful vehicle drove to the edge of the yard with three soldiers from the Princess Patricia’s Canadian Light Infantry inside.\n“Hey army!” Philipe shouted from inside the garage, looking through the window from the darkness. “Come on army!”\nCaptain M. McMurray of the Canadian Armed Forces gave the commands.\nThe carrier rammed the vehicle into the garage, and although the garage door snapped, it didn’t give. The carrier bounced off it, backed up and took a second run. This time, it drove twenty feet inside.\nThe soldiers backed it up again, and rammed the garage again. And again, and again. The next two runs crumbled two of the garage walls. On the last run, they drove all the way through the garage. Large sections of wall hung off the carrier as it emerged on the other side.\nIn the ensuing quiet, Philipe Laurier Gagnon made a crouched, desperate run for the nearest house, a backpack full of bullets on his back and a rifle in each hand. He fired the guns wildly. “Come and get me!” he was shouting. The officers opened up, destroying the side of the house that Philipe was running toward in a hailstorm of bullets. Chunks of wood and broken glass flew into the air. Two hundred yards away at the roadblock, police and reporters dived for cover as bullets whined past them.\nPhilipe Gagnon was shot twenty one times. He fell dead, face down in the mud.\n---\nEdith Denniel watched the suicidal dash from across the street. Peering from her house the whole time, she described the standoff to a radio station over the phone.\n“It sounded like a war movie,” she said. “I could see at least eight officers waiting for him. He just came running out like there was a fire behind him.”\nTwo hours after Gagnon and constable Harvey Gregorash met at the grocery, it was all over.\nSeven police officers had been shot. All survived, except detective Boyd Davidson.\nNinety eight officers had fired nearly five hundred rounds into the garage.\nAs the officers cleared out, Lieutenant Fred Parker reflected on the loss of his partner. He and Davidson were partners in the arson unit. They had known each other for years.\n“All I can really tell you,” he said to reporters, “Santa Clause won’t be around for Christmas.”\n“A man with a heart of gold is gone.”\n---\nWhen my father, Sergeant Detective Stuart (Stu) Still came home from work that night, he cried. I had never seen him cry before, and I've never seen him cry since.\nThe tears welled up the moment he stepped in the door. Mom was there, in the foyer waiting for him, and I had sensed something was wrong, so I was standing near, watching, listening. I was seven.\nHe opened the door and stepped in, carefully closing the door behind him. Suddenly his face dropped. He looked at me, then her. She embraced him tightly. His eyes glazed over, and he began to tear, and the two of them sobbed, holding each other close. He looked back at me, wiped the tears from his eyes, and told mom quietly, that maybe I should be in bed by now.\nNothing afterwards was ever said about that night, and no mention of the events of that day were ever uttered in the house, at least, not in my presence. I don't doubt that my parents didn't get any sleep that night. But I had no idea what had happened, and the next day everything seemed back to normal.\nBut not for long. Both mom and dad changed over time. I will never forget my mother and father sobbing at the front door. But I only learned about what had happened decades later.\nIt wasn’t until I was living with my common law wife twenty years later that she had found a book, a book about police stories written by one Ryan Cormier, after whom I have written this story, and gave it to me to read. I’ve rewritten the story mostly verbatim, however I’ve made some small stylistic changes as a matter of flow. Nonetheless, I had been constantly talking to her about my past, always talking about how my father had changed when I was young, especially after he became detective, and she seemed to think this was a book I should read.\nSo then it made more sense. About that night at the front door. How he had become mean and sour after achieving detective rank. How if he wasn’t yelling he was stone cold silent. How he became angry at the drop of a hat, when prior he had been a really nice guy. How he had been a really nice, fun loving dad in my earliest memories. How, when I was only eight, that he told me I’d have to take care of myself from then on, like he was going away but never did. How he never talked to me. About anything. How he never taught me anything that he knew how to do, how to fish, how to hunt, how to fix a car, build a guest room or a deck, how to read, write or socialize. How especially he never talked about work.\nHow my mother had become distant and emotionless. How as a nurse she seemed to have gotten her hands on some mother's little helper, to assist with the trauma, anxiety and lonely suburban housewife syndrome. How the kids at school said my mom was frigid, which I didn’t understand. My mother’s a fridge? How does that even make sense? How she spent all her time with my sister, taking her to ballet classes, sewing the costumes, volunteering for the recitals. My sister and her husband now operate a dance studio in San Francisco.\nHow I thought it was odd she never hugged or kissed me as I was growing up. How neither my mother or father ever engaged in any deep or meaningful conversation with me, and discouraged me from speaking up or out, or offering my opinions or asking any questions. How I was to remain silent. How I had never been lectured or given a good talking to, only yelled at out of the blue and then, nothing but silence. How he complained to me that I wasn't enough like the other boys, and yet the other boys hated cops, or their parents did, because they were all smoking pot, and I was trying but my mother wanted me to grow up to be a kind and gentle man, educated and refined like her father who was a medical doctor, not a butcher or a soldier or an old boy on the old boy's network.\nHow later on, when I was seventeen, my mother had tried to tell me that dad suffered from an anxiety disorder. And how he had refused to acknowledge it. There, in the book, was the story that apparently changed my father forever. He had been in the navy, but saw no battles. After the navy he joined the police department. For a high school drop out with military experience, it was a cinch. Either that or pump gas. Until this happened, he was just a fun loving guy with a wife and kids to help him one day make detective rank.\nIt was he story that had transformed the police department into the police service. That had been part of the city of Calgary growing from a small agricultural town into big oil city, and it all made sense to me. The reason why he flipped out when he discovered I had tried marijuana and hallucinogens at college, and drove me to the homeless shelter to live there. Drug users, dealers, hippies, freaks, et al, were the enemy. They are cop killers.\nIt explained to me why I had been diagnosed with a social development disorder at age 10. Why I was apparently quiet and unresponsive, timid and shy, even though I didn’t think of myself that way. Why I didn't speak. Why I didn't respond normally. Why I came home directly after school, to sit at the desk in my room and read and draw comic books, or go out and ride my bike, and not hang out with the other kids. Why the kids in high school with long hair and black t-shirts called ‘head bangers’ laughed when the subject of law enforcement ever came up, and why they used the word “pigs” to describe the police. Why they punched me in the gut, out of left field.\n“Go ahead, tell him,” she said to my father one day when I was seventeen, after I had arrived home from school one day, holding me by the arm, standing at the entrance to the living room where my father sat staring out the front window. “Your father was diagnosed with anxiety disorder,” she said to me. I looked toward him, just sitting there, staring out the front window, shaking his head ever so slightly, saying nothing, and making no eye contact. He refused to talk about it.\nI looked at her, curiously, and she let go of my arm, saying, “Ok. You can go.” I turned, and went up the stairs to my room, not knowing what to think or say. I sat down at my desk, and stared blankly at the nothing upon it, clueless as to the condition I was in.\nI was common law married for a mere two and a half years, the third attempt at such a relationship in the 30 plus years I’ve been on my own, each lasting no more than a year or two. Single again, a year and a half later now, she had become abusive after her son left home, good on him, but her teenage daughter was not much better. As much as I hate being isolated, I won't stand for abuse. I've never hit a woman, not even a slap. But apparently I’m too difficult to live with.\nI’ve also lost my bus driver job at Calgary Transit, primarily due to a bad temper, but also budget cutbacks and a union that never accepted me into their own because of my weirdness, especially as there is a lot of illicit drug use among bus drivers as many struggle to cope with long shifts, covering for their fellow brothers, and my now ex common law wife’s sausage loving best friend likes to date bus drivers, so she said, putting my personal life out on the grapevine for them to devour when looking for fat to trim. Now my E.I. has run out, my savings are almost gone, I’m still unemployed, the covid virus has wrecked the already weakened economy thus increasing the number of unemployed people I’m competing against for employment, I have no really useful skills except driving and drawing cartoons, and the doctors say I have schizotypal or some type of personality disorder.\nAnd now I’m over 50.\nThe words of local psychology guru Professor Jordan B Peterson keep playing in my head, \"50 is a very difficult age to start over.\"\nEspecially for some, it seems.\nThough I understand, some have it worse. Many, many have it worse. Much worse.\nBut just because you've only lost your legs and not your arms and your legs doesn't mean it doesn't make you want to jump off a bridge sometimes.\nSorry if this is depressing. But since I was fired, I lost my employment benefits that paid for psychotherapy. Now I have to pay for it out of pocket, and I can't afford it. Ironic, those who need it most can afford it least.\nIf only there was a cheap, easily accessible psychotherapy for those who don't have coverage. Because Alberta Health Care only pays for the analysis, not the therapy. And it isn't free, and it isn't cheap.\n\n"}, {"title": " Brain Function (self.JordanPeterson)", "likes": "2", "comments": "5", "content": "Dear Jordan Peterson\nAs many others, I have been following you for quite some time and find it quite beneficial.\nI write this post in hope of communication, and i realise I am among thousands of others who attempt the same, but i really feel like i need to! I am a mid 30s Scandinavian man, who were in a traumatic traffic accident when i was 17, and though i am highly functioning (doing a BA now, and have been working before this, i.e. im living a normal life) - my experience of life is very altered and different from other people. My accident was an encounter with a big truck while i was driving a scooter, and beside all the physical damage it cause which were quite alot, it left me with a fractured skull and bleeding and damage to the right frontal lobe.\nI have noticed your interest in the difference between the hemispheres, and i can relate (and to me, whether it is true or not), i can understand precisely what you investigate hence I am living it every day. Uncauseous behavior i.e. difficulty judgeing effects of any given action, a constant fear everyday even though nothings wrong, my working memory is highly evolved due to a damaged shortterm memory, holistic scope of everything, etc.\nAgain, i am writing bcs i truely think that you could help me in any way, and I also could assist you in understanding the brain hence i have a little less than 20 years understanding my own psyche, brain structure, and all it entails.\nI write here since i do not know how to get a hold of you or your staff in any other way.   \nNB: i have been to a gazillion doctors all my life, and though they have helped me alot, i havent gotten closer to a more thorough understanding.  \nBest regards\n\n"}, {"title": " Disagreeable people, do you find you dislike other disagreeable people? Do you find you people try to get rid of you? (self.JordanPeterson)", "likes": "4", "comments": "14", "content": "Is there a reasoning to this or am I the only one who notices this?\nI noticed that highly disagreeable people in a group somewhat recognize each other and I often see dominance games or a lot of hidden hatred for each other. Maybe not always, but the these disagreeable people are never bffs with each other.\nI find at most I might be able to be acquaintances with them, but never closer that.\nI feel there is an advantage in society with being disagreeable , so this makes other disagreeable people a threat aka competition. At least my reasoning for why i think disagreeable people may not like other disagreeable people. It goes to hand with competitiveness too so I wouldn't be surprised.\nOn the opposite side, I feel disagreeable people don't like other disagreeable people because they both like to have their way. Disagreeable tend to challenge status quo and this may ruin any heirachy or power status of an top individual (most likely a disagreeable person to begin with). Basically disagreeable disrupt the rules or an order established, so I can see why someone on the top this order or who established it, would dislike having other disagreeable threaten them.\nAn example I can think of is my mother who volunteered at a food bank. She is highly disagreeable. So at the food bank, there is a lot of small scale corruption. Basically, much of the food is the trashiest and worst crop you can find. Old cabbages, rotting carrots and canned foods. I mean beggars can't be choosers but it is just plain gross and degrading to feed people smth you wouldn't eat. Anyways, so this food bank also got bakery goods delievered to them. Many of the staff there would take these for food during their shift but also pack some home for themselves for family etc. Rather than giving it to the homeless as was meant to be, they took the fresh baked goods for themselves and served the crap for the homeless to eat. If there were baked goods it was leftovers and the homeless were only given 1, even though the staff hoarded boxfuls to themselves... my mom kept trying to disrupt the system and not only offered suggestions but even tried to bend the rules... distribute food and give seconds. Snatch a bunch of the baked goods fresh on arrival and give those out etc. obviously she was met with much criticism from the staff, but I can see how bringing one disagreeable person can disrupt an entire system that benefitted the people who created it. This can also be a threat.\nPeterson mentioned disagreeableness can be predatory if I remember correctly, so wouldn't there be some kind of evolutionary reason to dislike disagreeable people, especially amongst other disagreeable personalities?\nI am also apparently high on machiavellianism (not sure how reliable test are online). I believe there is also a correlation between machiavellianism and disagreeableness. I can see why this would make disagreeable people seem more like a threat.\nThis has happened all my life where I felt that I would be part of a social group but whoever was most disagreeable (usually socially dominant) would eventually have some weird power struggle with me. I am guessing because I am the type of person who would challenge someone or point out when they are wrong etc and this group leader often feels threatened somehow. \nI noticed this also in hiring processes... i always feel like some employers do not like that you are asking important questions like salary rate etc etc. Not only is this a good sign the employer lacks transparency but also it shows that these employers are looking for someone who they can pay low and easily control.\nI use to hate working on projects with other disagreeable people because it also became impractical sometimes since everyone had an opinion and couldn't agree. Partially, why I wonder if there is a thing where like recognizes like and dislikes in relationship to disagreeableness.\nI have also tried leading group meetings and there was a struggle, even though there was only one other disagreeable person out of our group of 5. Long story short, so and so thought their way was better and didn't agree that I should be leading the exercises and warmups (not physical but rather for public speaking)... i obviously did my research but so and so didn't seem to bend (it wasn't their field of expertise and i gave a detailed reasoning of why these exercises were beneficial.). It worked but there was a struggle. I found later meetings when so and so was not present, to go much much smoother. So and so was open to how i did things and the logic behind them but they were definitely less open than the rest. Most people in my group are at a healthy level of agreeable and disagreeableness. I think maybe why so and so and I knock heads is because we both are pretty high on disagreeableness.\nAnyways, this is less of a clear question and more of a discussion. I also would like to hear experiences. Maybe I am just an introverted person who is highly disagreeable (i am also high on openess), and unfortunately this made me a life-long outcast. So maybe I am just bitter and trying to find cool reasons to compensate 😂\n\n"}, {"title": " Isn't this good enough reason for post-modern feminists to back off criticising Jordan? (self.JordanPeterson)", "likes": "0", "comments": "5", "content": "The competition for power is a stain in a society. If you notice carefully, Jordan is never about the pursuit of power, rather he is in pursuit of meaning - as a result of that pursuit of meaning, power just come to him voluntarily, and naturally, as he amasses a group of like-minded individuals with a sole purpose to become better people and forge a good life for ourselves.\nIsn't that good enough for the post-modern, and radical feminism to keep their mouths shut? I don't understand - thoughts guys?\n\n"}, {"title": " Multitude of viewpoints: My thoughts on \"Jordan Peterson versus ___\" (self.JordanPeterson)", "likes": "3", "comments": "2", "content": "I do feel that Jordan Peterson's viewpoint, in some case, wasn't really suited for Sam Harris who is not a biologist and isn't interested like a biologist would. A biologist has an appreciation for understanding why we are the way we are. Sam Harris is much more present and future oriented, such that he's a bit dismissive for when Jordan explains why things are and happen the way they have. Nonetheless, I do appreciate the discussions we got out of these two.\nRichard Dawkins is probably annoyed by now by the various people that ask him about Jordan Peterson, but the truth I think is that if they actually talked, it would've been an interesting and productive conversation, not without its disagreements though of course. But they would talk about what I wanted to hear more of (our evolutionary history).\nIt's very fun in the meta to refer to these as \"versus\", but the discussion and understanding on the level of the individual is deeper than a mere battle matchup, and I think the people who get to listen to the thought-provoking ideas are what makes us, the audience, the beneficiaries.\nThe black sheep is the hypothetical \"Peterson versus Hitchens\" which always comes from a more intellectually inappropriate comment to the degree of \"if Hitches were alive right now, he would destroy Peterson.\" From at least what I'm able to tell, the only thing Hitchens does differently than Harris and Dawkins is that he has a different manner of speech in which his ability to shame his opponents and turn them into caricatures on-stage gives his fans a rush in dopamine. And I believe that's what his fans are after. But I wouldn't say that's an interest in a discussion for the pursuit of what's true in an intellectually honest discussion.\nAs a final two cents, I have to say that the Jordan Peterson 'fanbase', if you will, is the most open-minded fanbase I've ever had the luxury of participating in. So I wanted to thank you all for that because nothing is quite like this, even in contrast to a fanbase like Alan Watts... Alan Watts, an individual who's attempted to communicate ancient wisdoms from Eastern Philosophy... I disappointingly found this fanbase to be anti-Western, which is a great shame. But I am happy to say that although those who've listened to Alan Watts might not appreciate Jordan Peterson, those who've listened to Jordan Peterson are probably open-minded to things such as Eastern Philosophy (something we are seldom exposed to). If you find yourself interested int he journey of learning Eastern Philosophy (what it means to meditate, etc), perhaps to switch up the pace from Western thinking and Philosophy, I would recommend the book \"the Power of Now\" by Eckhart Tolle.\n\n"}, {"title": " ran some Peterson images through Deep Style Transfer and wanted to share the best ones for me (self.JordanPeterson)", "likes": "4", "comments": "4", "content": "​\nhttps://preview.redd.it/o32ro4f8iaw41.jpg?width=417&format=pjpg&auto=webp&s=7af46a03c44597cc1b02b26d20741130617ab2e1\nhttps://preview.redd.it/yr7iz01aiaw41.jpg?width=700&format=pjpg&auto=webp&s=ca9604e17601d70df092f9903ae1117739a3954e\nhttps://preview.redd.it/19jxwhuniaw41.jpg?width=700&format=pjpg&auto=webp&s=15facda90e5d81ff2554ba7c85736f353cb926a6\n\n"}, {"title": " Podcast not working (self.JordanPeterson)", "likes": "2", "comments": 0, "content": "Is any of you having problems playing second season podcast episodes. All before 50 shows error.\n\n"}, {"title": " Homeless bums break the law and nothing happens.. a normal human gets full fines and jail time? (self.JordanPeterson)", "likes": "0", "comments": "55", "content": "Why do bums get to tent wherever they want when I cannot?\nWhy do bums get to gather in groups during coronavirus lockdown and  humans get fined beaten and jailed if they go out together or visit family?\nWhy do bums get to steal shopping carts ?\nWhy do bums get to openly use and sell/buy drugs without police interference?\nWhy do bums get to drink in parks and the street when a responsible human cannot have a beer on the beach or at a park?\nWhy are bums above the law?\n\n"}, {"title": " My first rap track inspired by JP (self.JordanPeterson)", "likes": "0", "comments": "2", "content": "Hope you like it :)\nhttps://youtu.be/QPQqbmeWWPs\n\n"}], [{"title": " Who are the Post-Modern Neo Marxists? (self.JordanPeterson)", "likes": "7", "comments": "13", "content": "I've been brushing up on my 'Jordan Peterson', and trying to understand his world view. And a big part of that is the idea of the 'Post-Modern Neo Marxists'. But who ARE they?\nFrom what I've seen, Peterson gives a cogent explanation of how PMNM started, and that is (to briefly summarise as best I can)... \nIn the West in the 1960's, Marxist Philosophers such as Foucault, Derrida and Lacan, realised they could no longer openly advocate for Marxism (in light of the atrocities of Stalin and Mao). And so they shifted the focus of discussion away from 'flat out Marxist support' to 'Identity Politics'. But 'Identity Politics' is merely a Trojan Horse to spread the same hard totalitarian Marxist ideals which led to the likes of Stalin and Mao.\nSo fine... Peterson gives an explanation of how it started. But as of right now, in the present, WHO are these people? Often times, when Peterson is critiquing PMNM's, he just alludes to ''these social justice types'' which isn't very helpful. Right now, I'm having a hard time nailing the specifics of what kinds of people are PMNM's... Asides from a vague notion that it's possible anybody who is further left than 'centre left'?\n\n"}, {"title": " Open inquiry to Dr. Peterson about teaching in future my unborn son what it means to be a man, and how to funnel his energy and aggression into productive and worthy causes. (self.JordanPeterson)", "likes": "5", "comments": "3", "content": "Hello Dr. Peterson, as well as anyone else reading this text. I am, at the time of this writing, a 23 year old Army infantryman from the united states. My wife is at 17 weeks of pregnancy, and we have been told we're expecting a boy. I am absolutely excited in every way, as well as worried, and hoping for some guidance on how to set good, healthy, and effective examples on healthy masculinity. My wife, as well as myself, have grown up with less than optimal men in our formative years (Abusive fathers). \nThe further into her pregnancy we go, the more determined I become to break the cycle of unhealthy masculinity in both of our families. I consider myself a good man, but as a child, I was stubborn, headstrong, and combative with my parents. I hold much resentment towards my father for the way he treated my mother and I, and to a lesser degree my mother for taking her frustration out on me. \nI am determined to break the cycle, and I assume that our son will likely be just as headstrong as my wife and I (although we have a very strong relationship, our stubborness compliments each other and actually strengthens our relationship.)\nIn regards to this. Do you have any advice or insight on how to set a strong, but controlled example of how to be a man for my son, as well as how to teach him how to funnel his aggression and energy into productive pursuits?\nThanks, And hope you're doing well.\n\n"}, {"title": " How wrong is Jordan Peterson? (self.JordanPeterson)", "likes": "6", "comments": "25", "content": "I was suicidal about 2 years ago and found JP on YouTube like many other of you on this sub. He saved my life when I was in the dark. Now that I’m passed that, in reflection of that time and JP’s work, I wonder how much of his work is wrong? Does anyone else have this feeling? I’m always weary of idealizing anyone because no one is perfect.\nEdit 1 : I apologize that I wasn’t more precise in my speech. I know there is already like a weekly discussion analyzing JBP’s work on this sub. I didn’t have anything particular in mind when I asked my question. Just getting a feel of people’s current thoughts on his work. I know he has decades of work so I apologize I didn’t narrow it down.\n\n"}, {"title": " I couldn't have done this without you. (self.JordanPeterson)", "likes": "6", "comments": 0, "content": "Before I begin, first let me say that this is not an attempt at shameless marketing on reddit. That being said, I hope that these words somehow reach the eyes of Dr. Peterson himself, though I am not expectant. \nI have struggled with depression and suicidality my entire life. When I discovered the biblical lectures on YouTube, my life was changed, and it set me on a path of conscientious drive and determination that ultimately saved me from the noose. I have been tossing around ideas for a fictional universe since I was fifteen, but I never had the drive to actually pursue them until I heard the lessons that Dr. Peterson offered in his lectures. With them bolstering me, I was able to put my nose to the grindstone, and hammer out this 522 page, 130k word novel, compose symphonic music for the project, create art, design the website, and do many other things to get to where I am now. More information on the project, which is only beginning, and will see an additional 5 books in the future, can be found at siizeru.com, on instagram @siizeru, or on Facebook. \nI would like to offer Dr. Peterson himself a free copy, as a measure of gratitude for helping me get here, though he has never heard of me. He can reach me using the contact information on the website if he so chooses. \nIf any of you would also like to check out the project, feel free. It kept me from committing suicide many times, and now it is my primary focus in life. \nThank you for your time and energy. I wish blessings on you all.\n\n"}, {"title": " Documentary (self.JordanPeterson)", "likes": "5", "comments": 0, "content": "Has anyone seen the Amazon documentary TFW NO GF? It's good. I think it does a great job highlighting the same issues faced by young men that Peterson brought up in his podcasts \"Toxic Masculinity\" and \"The Crisis of Masculinity\".\n\n"}, {"title": " [ ] (self.JordanPeterson)", "likes": "5", "comments": "3", "content": "Brasilia, may 3rd of 2020,\nDear Jordan B Peterson,\nWhen I was 16 a colleague asked me what was it like to \"be like me.\" That was a weird question, I think she meant was did it feel like to be a smart kid, or to be a fast thinker (maybe that would be more accurate) but anyways I ended up writing a poem about it and a few minutes ago I realized that it has much to do with some of yours thoughts on individuality x group identity. So, without further due I'll try to translate it to you (I do not think it is good poetry, but it might contain good ideas, or at least I hope it does)\n​\nSingular\n​\nI don't wanna hold the world in my hands \nBut I confess I'd appreciate if it were more like me\nJust a tiny bit\n​\nIt's just that sometimes it is a little overwhelming\nTo be a little singular \nIn a world that's always plural\n​\nBecause these eyes when they look at the world\nUsually they go deep\nAnd maybe deep is just too much\n​\nBecause in the insane attempt to do everything differently\nEverything inconsistently\nMade itself more of the same\nI know it is hard to assimilate\nBut this is haw it became unacceptable\nTo be a little bit singular \n​\nHope you like it somehow, sorry if my english was not that good!\n​\nWarm greetings from Brazil,\nMaria Eduarda Barbosa.\n​\nP.S.: It was not that long ago, I'm turning 19 tomorrow. I am also heavily considering to go study psychology by the way.\n\n"}, {"title": " Dream Realization (self.JordanPeterson)", "likes": "4", "comments": "1", "content": "I recently had a dream that I realized I was dreaming downtown of a busy city. I remember looking at the people walking around and yelling at them \"I'M IN CONTROL, YOU ARE NOT IN CONTROL.\" I felt sheer power over them and I knew what they were.\n\n"}, {"title": " Self Authoring Age Limit/Recommendation? (self.JordanPeterson)", "likes": "3", "comments": "4", "content": "Does Dr. Peterson recommend you to be a certain age if you’re taking the Self Authoring program? I’m 18 and I’m about to finish my first year of university and I was unsure if I should be taking the program. I already bought it but I’m not sure if I should take the time to do it yet. Thanks\n\n"}, {"title": " [A   from a Confused Young Man] (self.JordanPeterson)", "likes": "4", "comments": "7", "content": "Dear Dr.Peterson,\nI'm a lucky and fortunate enough, to have just graduated with a degree in Mechanical Engineering. It's taken alot of sacrifices, long nights, stress, anxiety, hardwork, dedication, and support from friends and family to get to this point. Yet I know this is a minor stepping stone in my personal, social and professional life. As any 21 year old I have dreams and ambitions, unfortunately they aren't of monetary or familial fabric. I have dreams and goals that I would dare put out there in public or say out loud, cause I will be mocked and belittled. It is time for me to start slowly but steadly craving my path in that mountain of a goal that I have set myself.\nAlthough I have an end goal, I currently feel stuck and stagnated; I find it very challenging to push myself during this pandemic and more often than not I find myself confused and staring at this huge dark unknown, that is the future. I have applied to multiple colleges for a PhD program, and I trust my gut feeling that I will not get in, yet it does not worry me. What worries me is failing a second time, since I feel like failing a second time is unforgivable. Through out college I have survived off the fear of failure, yet I want to learn and transition my life into fear of not achieving success.\nI understand that this letter would probably never get to you due to the shear volume of people who write to you but in the off chance that it does. I would highly appreciate some advice on me setting myself those \"unrealistic\" goals (whether it is a right thing to do) and how can I transition my fear of failure to a fear of unsuccessfullness (and if that is even a healthy thing to do).\nHope you are safe out there and that you are taking good care of yourself.\nYosef\n\n"}, {"title": " Blame vs. Responsibility (self.JordanPeterson)", "likes": "4", "comments": "5", "content": "If I am distracted and pained by the words and actions of others, I have forgotten what I can and cannot control.\n\n"}, {"title": "   to the people who are already in the right path (self.JordanPeterson)", "likes": "4", "comments": "5", "content": "Where did you find your purpuse to aim at, that made you ignore the inevitable suffering of life? What do you fight for?\nA higher salary is not a purpose\n\n"}], [{"title": " [myth] Jordan Peterson's view on transgenders is the same as Ben Shapiro's ... [fact] Peterson has a much more mild, open view that is open for gaining clarity (self.JordanPeterson)", "likes": 0, "comments": "1", "content": "Jordan Peterson's view on transgenders (short youtube video):\n(1) Peterson would, when perceiving a transgender person who he believes is not trying to make a power play, refer to them by whatever pronoun they prefer\n(2) Peterson says it is important not to allow laws and bills to be made that require citizens to label genders accurately according to a person's perceived gender; because it leads to endless complications as new types of gender identities are discovered/surfaced, because it prevents freedom of speech, and because it allows even non-transgender people to abuse the system and get attention even when they aren't actually transgender\n(3) Peterson openly speaks about not understanding what it means to be transgender; he doesn't claim to know the implications and what is going on in the lives of transgenders\n​\nBen Shapiro's view on transgenders (best/shortest youtube video I could find):\n(1) Shapiro says [in the video in the link] that he would refer to someone who is transgender as being their perceived gender *when* there were a functional reason, such as if he were going to dinner (in theory) with Blair White (a transgender woman), he might say \"my table is with that woman\", referring to Blair White as the gender that she outwardly appears to be (and the gender that she prefers to be called) ...\n(2) ... in virtually all other videos and content, however, Shapiro says that he only will use pronouns that match biological gender at birth, and that he avoids using pronouns at all when possible to avoid that conflict/confusion; he prefers simply referring to people by name, not using pronouns at all, he says in the video link\n(3) Shapiro says [in a different video] that transgenders are \"mentally ill people\" and they need help, while he doesn't seem open to learn about the science behind what transgender people experience and how being gendered according to their perceived gender brings so much emotional relief (with brain scans for evidence)\n​\n... Jordan Peterson has been a positive influence in my life. And I have consumed many hours of his content. ... I recently had a very large break through in self-awareness, and I had to review Peterson's perspective on transwomen to see how they reflected on my on beliefs. ... I recently discovered that my deeply suppressed emotions and my personal strange jealousy and idolization of women likely comes from the fact that, like many transgender women, my brain seems to have developed as female before birth, though the rest of my body seemed to have already formed as a male unborn baby at that time (explained the science video in the above paragraph).\n​\nIt was a pleasant surprise to find that, Peterson's ideas did not contrast my own emotional needs to start finding ways to express myself in a more sophisticated, feminine way, so as to appease my female brain and emotions that I've been burying and hiding from myself and others for so long. ... As I find ways to express myself in more and more sophisticated and feminine ways, my long-lost sense of sense of emotional identity, sense of emotional stability, sense of confidence in being myself -- these are finally returning to my life, allowing me to start living and expressing, instead of burying and distracting myself like I used to, before I discovered myself. ... Peace.\n\n"}, {"title": " [ ] Thanks Jordan (self.JordanPeterson)", "likes": "3", "comments": "1", "content": "Thanks Jordan\nI am having been dealing with depression since I was 15 years old, I'm 24 now.\nI went to psychologist when I everything became too much to handle when I was 20 and the psychology treated me really badly and turned everything to be my fault. This was first time I open up about myself, doubt and hate for myself. I listen to everything she said and took it in that I am worthless person.\nThen started to self-harm because I wanted to feel anything. I told my psychologist I was doing worst but she did not listen to me. I started to beat myself down every day and told myself I am worthless, and everyone will feel better with me gone. So, 28 November at 03:58 2017 I wrote my letter. That date and time is so burned in because I wrote my suicide latter on the computer and my roommate was coming home at 05:00 so I had to hurry up I said to myself. I did not succeed with it and I told myself I am joke I cannot even take control over my life and end it. I felt like failure with everything in myself. \nI don't have any close friend that I could talk with about my feeling so best thing I could done that I slipped up at work and mentioned the letter and one person that person took it serious and took me to the hospital but i didn't want to go because I was treated so badly when I reached out for help first time. But she went with me to the hospital and it was best thing ever happen in my life. But because our hospital system is overworked. I could not talk that long with psychology, but it was better than nothing. It helps me to crawl out when I was in the darkest part in my life.\nSo I don't have psychology right now and I'm on venlafaxine it helps but I don't like to take them because I feel numb and empty so no feelings at all I just become robot, but if I don't take them I sit and do nothing expect think back to my life and started to harm myself again with knife. \nEverything is so hard right now in life, I do not have any friends because I shut myself in for so many years and did not want to talk to anyone. My family act like nothing happen doing those years and I feel like I am wearing a mask. I think about a lot who am i, why do I keep going up everyday?\nDoing this corona and quarantine I just sit home alone with my thoughts and I think I am starting to go mad because no contact me I don't contact anyone because I don't have anyone close to talk to.\nWatching your video about depression helps me to really think about my depression and I think I'm starting to feel better about myself.\nI hope you see this letter Jordan, I just want to say thank you I'm taking my anti-depression medicine again and trying to walk forward.\n//Anders\n\n"}, {"title": " [ ] (self.JordanPeterson)", "likes": "3", "comments": "1", "content": "Greetings Dr. Peterson. I'm a doctoral student working on my dissertation. I was wondering have you had much experience with treating individuals who present with psychopathic symptomology?\n\n"}, {"title": " Self authoring program difficulty (self.JordanPeterson)", "likes": "3", "comments": "2", "content": "I’ve been doing the past authoring on and of few a couple of weeks and I find it difficult to find significant experiences in my life and how they have shaped who I am. A lot of the experiences I’ve chosen don’t seem very significant. \nAnyone got any advice on doing past authoring? And not just do it badly.\n\n"}, {"title": " The New Archipelago (self.JordanPeterson)", "likes": "3", "comments": "1", "content": "Who has read the abridged version? Would it be best to read the three versions instead?\n\n"}, {"title": " Need a source for a uni paper on Peterson's claim about postmodernism (self.JordanPeterson)", "likes": "3", "comments": "15", "content": "I need a source, preferably from someone such as Derrida on Peterson's claim that 'Postmodernism is essentially the claim that (1) since there are an innumerable number of ways in which the world can be interpreted and perceived (and those are tightly associated) then (2) no canonical manner of interpretation can be reliably derived.'\nAnother question, is this claim basically what deconstructionism is? Thanks.\n\n"}, {"title": " Hope!!! (self.JordanPeterson)", "likes": 0, "comments": "1", "content": "Jordon, I just want to express my most profound thanks for your willingness to endure the pressure and abuse that so many have tried to heap upon you because of your willingness to challenge the insanity of so much of the dialog that infects our world these days. Peoples’ fear of anything that would lead them to discover their emptiness and lack of purpose is most intense, and their anger at being “robbed” of their defenses leaves you in their minds as an evil threat. Stay strong brother. Regards, John\n\n"}, {"title": " Path of the Fool (self.JordanPeterson)", "likes": "2", "comments": 0, "content": "https://preview.redd.it/7n2blvvpwrw41.jpg?width=820&format=pjpg&auto=webp&s=e609fbaf8e736917307e742a0d8f910cd78aff59\nCan we be open-minded, but still hold on to what we believe?\nCan we give it our all, without operating under the illusion of perfection or control?\nCan we be compassionate, while still maintaining healthy boundaries?\nCan we live a responsible live, towards our personal greatest star, while still maintaining openness to being continuously confronted with our limitations and powerlessness?\n​\nYes we can!\n​\nHow? That's what we're here to figure out. falling and stumbling, but wholeheartedly and honestly.\n​\nRemember: The Path of the Fool is the precursor to the Path of the Hero!\nSo stumble forward with a straight back, you phoenix-lobsterboys. you pathetic bunch of wurms, each with a spark of god-consciousness\n\n"}, {"title": " How can I get past my resentment after an experience where \"manipulating the bureaucracies\" no longer worked (self.JordanPeterson)", "likes": "2", "comments": 0, "content": "Long story short.  When I was in early elementary school, I hated being in school, and had some behavioral problems, and was quite bitter and angry about being in school.  Mostly because I hated being forced to go to some institution that expected conformity, and punished kids for being kids.  Eventually I had the realization that complaining about the systems, and acting out was not going to make things any better.  So I realized that I can manipulate the systems to work for my interests.  By this, I dont necessarily mean in a bad way.  For example, I had enough experience to know how to appeal to the teachers better natures, which made the experience of school significantly less authoritarian.  In fact, this worked throughout my last years of elementary school, middle and high school.  I will admit that I sometimes did unethical things to manipulate the system, such as taunting bullies insecurities to get them off my back.\nHowever, once I got into a tech school after graduation, things went downhill, and manipulating the system no longer worked when I did not do so well on a test.  This teacher called me out as not showing much loyalty to the school, and told me to stop doing things my way.  After that, I ended up struggling with school, and only getting C's, despite my efforts.  I know that the teachers at the school all talked, as I overheard the teachers sharing gossip they had on other students.  \nThen I got myself on a quest to find a structure that had no judgmental or tyrannical elements(looking back, I would have told myself \"good luck with that\").  Then I started to develop these myopic ideas about primary school having no judgmental or tyrannical elements.  My first dabbling was to seek out religion, only to find that much of religion, particularly in the Evangelical Christian traditions had a strongly tyrannical and judgmental fundamentalist aspect where they placed literal interpretations of the bible above personal searching.  And on top of that, promised eternal damnation on anyone who deviated from their way of seeing things.  Then I got into a fundamentalist form of Catholicism, which I thought would be safer, due to having other authorities besides a literally read bible.  And the Catholic church is open to the Salvation of others outside Christianity.  But I found that Fundamentalist catholicism could be pretty demanding of their own, and promised damnation to apostates.  I got into a period of anxiety over this fear of hell, and then became released from anxiety when I saw how stupid such a mindless devotion was.  \nThen I developed this idea that right wing structures were the oppressive structures, while the left wanted to create structures to empower the individual and protect them from tyrannies like organized religion, corporations(which I feared were workplaces like the tech school) or other bigots and control freaks.  However I learned how the left could be just as judgmental and tyrannical when they decide who is competent enough to make their own decisions, and then thinks they can \"care\" for those they deem incompetent.  Then I came to realize that there are no structures of any sort that dont have tyrannical elements.  \nBut in the past, using the system to your advantage always worked.  Now it seems like this does not work so well.  I keep asking myself why \"Manipulating the systems\" no longer worked.  And the more I look, I have reason to believe this is so.  I have had some jobs after the tech school in the food service, which was just as authoritarian, and I had to deal with street smart bossy co-workers who did not like me just being on the job till I found something better.   And I have seen with the internet, there are plenty of religious bigots who cyber-harass anyone who they think are heretics.  And I have seen plenty of college graduates who seem so brainwashed by far left propaganda, and act like anyone who does not agree with them as a bigot, fascist, racist or oppressor if you dont see things their way.    \n\n"}, {"title": " Helios rising: The fading away of Venus's Temptation! (self.JordanPeterson)", "likes": "2", "comments": "1", "content": "The English word family comes from the root word famulus(latin) – which means servant/slave. The groupings of these families(servants) is called a society. The English word society comes from the Latin word socius which means companion. \nIf human society really means fellowship amongst the families, why are they divided into groups and why is there conflict? \nWe think ourselves to be better than the creatures of this earth. But, we are of fragmentation, conflicting each other in all dimensions of our existence. The conscious and the subconscious, the heart and the mind, the man and the woman etc., If we are of superior quality then our world arises with, a feeling of no otherness & no idea of separation. \nOne needs to be at a vantage point to see clearly– that the whole of human world is based upon conflicting paradigms! \nWhat is the relationship between a master and a slave?\nThe whole system is based on sadomasochistic relationship. The evidence can be found in our daily lives. The elements remain that of authority and conformity. A mere tug of war within oneself and with the natural world. \nWe can romanticise, justify Or complain and rebel against but it’s still the progeny of sadomasochism! The echelons are wired together upon this tether!\nThe investigation could only progress by maintaining a constant indifference. If there is an indulgence or refrainment to what is perceived, then that vantage point perception is taken away instantly and one is forced into positions within the system. One must be aware of the system, the fractions within the order, this deep entrenched need to belong, to crystallise, mark, label, into a certain order within the system and the turbulence that surrounds the orders(forcing one to enter the immediate available position). \nFrom the masters of the highest order to the slaves of the lowest order do not possess “this seeing”. Why? Because they have chosen their coordinates within the system and have lost the ability to see beyond. \nThis is clearly seen during this coronovirus pandemic! All of human endeavour grounded upon the psychosomatic syndrome - neurotic impulses and harmonal instincts. \nWho is the ruler of the system? \nOne has to be deeply alert similar, to when standing at a precipice! This alertness is that reflective light. Like that of morning star “Venus”. \nThis alertness is the ruler of the system! It is very clear that the alertness or the light of Venus is secondary or subordinate to the Sun(which is pure light of its own)! This reflective light is not the same as Helios/Sun. It is not a bearer of another’s light, it is of its “Own”.\nVenus is the epitome of arrogance & pride. (Being filled with the Sun's radiance desired to be equal to the Sun). But once THE SUN rises above the horizon the truth is revealed and Venus's emulation end.Thus Venus falls down from its grace(luminance). \nBeing hurt by the actuality of its dullness, jealous and enraged with hatred for the Sun’s radiance , goes ahead to cause an effect, a principle movement to which the system is dedicated. By decieving humans into the system. Tempting the masters with immortality and charging accusations against one another.\nOne must not fall asleep, be enchanted by(Venus)!!! The Dawn is here. \nThe investigative penetration must progress by maintaining an “extraordinary indifference”. The temptation is of immense attraction. If there is a temptation to indulge or refrain from this perception, then the vantage point perception is taken away instantly and one is forced to partake in Venus’s desideratum!\nThe system can only work in descent and never move in continuous ascension. The masters and the slaves void of ascension beyond their own limitations fall endlessly to this temptation and give ears to the accusations!\nThe entire sadomasochistic system exits on the ground of deception(tempt, allow the fall and accuse). \nThe human habituated on this way of existence lack true light! The hearts and minds part of this system are devoid of a relationship with the Sun! Hence still within the boundary of time, always living in the past and looking towards the future! This human never free from the burden of mortality and impermanence! The human has lost his being, to be present in the moment. \nThe system: all activity that has the shadow of the past! Any expression and action born out time, inevitably has the signature of “Venus”.\nIt looks like the system is in progression and it is changing, only at the peripheral! The ruler never changes and thus the system with its legion of masters at the top to the slaves at the bottom of it, never change!\nThe system is illusory just like the light of Venus!!!\n\n"}, {"title": " Critical Examination and General Discussion of Jordan Peterson: Week of May 04, 2020 (self.JordanPeterson)", "likes": "2", "comments": "5", "content": "Please use this thread to critically examine the work of Jordan Peterson. Dissect his ideas and point out inconsistencies. Post your concerns, questions, or disagreements. Also, defend his arguments against criticism. Share how his ideas have affected your life.\n\nWeekly Discussion will go from Monday to Sunday. \nThe Critical Examination thread was created as a result of this discussion\nView previous critical examination threads.\n\nWeekly Events:\n\nDigital Meetup\nBook Club @ JBP Discord\n\n\n"}, {"title": " Relationship advice for male who's personality is very different from the typical male: abnormally high on traits Agreeableness (96th percentile) and Neuroticism (97th percentile) (self.JordanPeterson)", "likes": "2", "comments": "5", "content": "I would be grateful if I could get some advice from you guys, and from Professor Peterson if he happens to be reading this.\nI'm Male, 26 and my personality is a complete outlier to the typical male - I'm abnormally high on traits Agreeableness (96th percentile) and Neuroticism (97th percentile). What kind of a woman (in terms of her trait percentile scores) would be an ideal partner for me?  \nI know that it's absolutely necessary that I do assertiveness training so that I can stand up for myself more and be able to say no when I need to say no, but realistically speaking, I don't think I'll ever be able to make myself low on trait agreeableness.  \nI'm also very high on Openness to Experience (95th percentile), Conscientiousness (94th percentile) and Extroversion (75th percentile) if that helps.\n\n"}, {"title": " Gender differences in competitiveness: Nature or Nurture? (self.JordanPeterson)", "likes": "2", "comments": "3", "content": "Has he ever spoken similarly about competitive behaviour differences in the gender context? A research article I recently read a research article by UCSD Economist that talks about how competitiveness seems to be very strongly affected by 'nurture' rather than 'nature'.\nI have heard Prof. Peterson make an argument about the inherent difference (on average) in 'agreeableness' between the two genders and how that could be a contributing factor to the wage gap. He has also talked at various points about a) men, in general, being more interested in things than woman, and b) a tiny minority of men willing to work insane hours and succeed at any cost, that could be seen as indicating competitiveness.\n------\nSource: Gneezy, U., Leonard, K. L., & List, J. A. (2009). Gender differences in competition: Evidence from a matrilineal and a patriarchal society. Econometrica, 77(5), 1637-1664. \nLink: https://onlinelibrary.wiley.com/doi/abs/10.3982/ECTA6690?casa_token=-ytWTPgsTAQAAAAA:RQMh8OqS6fi64Xdcpo7wc--P9xLFUp97aToAtBNl-B8u2HtJDY3Lv4M0AbstJJWhb6aHncrL7IPz8ac \nP.S. I have not read his books but only seen his talks so I am in no way claiming familiarity with his complete thesis.\n\n"}, {"title": " Does anyone have a list of interesting books that Jordan Peterson has recommended in his lectures? (self.JordanPeterson)", "likes": "2", "comments": "1", "content": "I trust this mans opinion so much that I’ll read anything he says is worth reading lol. Any books you’ve read thanks to him will be welcome!\n\n"}, {"title": " Zizek fans dislike Jordan so much, why ? (self.JordanPeterson)", "likes": "1", "comments": "7", "content": "When sam harris and Peterson talked both sides had respect for each other but when Zizek and Peterson talked Zizek fans seemed to really dislike him. Like they think Jordan is completely discreditable\n\n"}, {"title": " If someone has a free self authoring code they would be willing to give me, I'd be most grateful. (self.JordanPeterson)", "likes": "1", "comments": "1", "content": "If so please pm, thank you. Will remove/update when needed.\n\n"}, {"title": " [ ] (self.JordanPeterson)", "likes": "1", "comments": "1", "content": "hello Jordan Peterson\nI would simply describe myself as someone whom looks up to you, as i have found a lot of your online\n videos to be a helpful approach to life as a 19 year old. currently i am in Seattle attending the UW and trying to expand my youtube channel during this time. I have a few short ended questions regarding social media and relationships. I have developed some of these questions after watching your lecture videos. Are you avaliable for a 15 minute zoom interview revolving around my 2 topics relating to social media and young relationships?  \n(after the recorded zoom interview i would upload it to my youtube channel where my subscribers can view it)\npeace,\nMonte Amr\n\n"}, {"title": " I'm looking for a clip of JP (self.JordanPeterson)", "likes": "0", "comments": "1", "content": "Hi, I'm looking for a clip where JP talks about the understanding of certain statistics. He starts off by talking about rate of aggression being 60% male en 40% female. After that he talks about picking a random person out the 100 most aggressive people, always being a male. \nCan anyone help me?\n\n"}], [{"title": " 12 Rules for Life Book Review and Discussion│Rule 1 Stand Up Straight With Your Shoulders Back (self.JordanPeterson)", "likes": "0", "comments": 0, "content": "https://youtu.be/haUrzVoLmHU\n\n"}, {"title": " Why aren't companies hiring lobsters for HR? (self.JordanPeterson)", "likes": "0", "comments": "24", "content": "So imagine you are a company and you have two choices, hire lobsters or SJW for your HR department.\nOne believes in telling the truth, rights and personal responsibility, the other believes in censorship, bullying and no responsibility (eg. loans should be cancelled).\nOne lobster Jordan Peterson has made a bucket ton of money. SJW are behind the \"get woke, go broke\" trend.\nWhich would you hire?\nWhy aren't companies anti SJW?\nDo you think the current status quo is changing? Some memes that SJW may dislike:\n\nget woke, go broke\nSJWs aren't your customers\nSJW will never be satisfied by your pandering to them\n\nAt what point will these memes force a change in hiring and marketing practice?\n\n"}], [{"title": " Puberty blockers are safe, well-studied, completely reversible, endorsed by credible medical and endocrinological associations, and effective at reducing dysphoria, anxiety, and depression (self.JordanPeterson)", "likes": "0", "comments": "55", "content": "​\n\nPublic Broadcasting Service News: Korry 16\n\nEverything you need to know about puberty blockers \nFull-blown puberty is irreversible\nTaking a gonadotropin-releasing hormone (GnRH) agonist, secretion of the sex hormones can be stopped and the onset of puberty suppressed, so that the body does not develop secondary sex characteristics\nThis has been done safely for decades to suppress sex hormones in children who develop too early, a condition known as precocious puberty. Suppressors have also been used to treat endometriosis, uterine fibroids and prostate cancer.\nIt was only in 2008 that the Endocrine Society approved puberty suppressors as a treatment for transgender adolescents as young as 12 years old. The Society, with members in more than 100 countries, has since declared that the intervention appears to be safe and effective.  In 2011 the World Professional Association for Transgender Health (WPATH), also issued Standards of Care for the treatment of patients with gender dysphoria, which include puberty suppression.\n\nVries et a. 14\n\nSmaller Dutch study on puberty blockers\nAll 55 participants were on par with or better than others their age when it came to things like anxiety, depression and body image, and none of them expressed regret as adults about their transitions or the choice to delay puberty.\nSince puberty suppression is a fully reversible medical intervention, it provides adolescents and their families with time to explore their gender dysphoric feelings, and [to] make a more definite decision regarding the first steps of actual gender reassignment treatment at a later age\n\nHuman Rights Campaign et al. 16\n\nBIG report on trans youth and transition\nEndorsed by the Human Rights Campaign, American Academy of Pediatrics & the American College of Osteopathic Pediatricians which affirms the validity of transgender youth, encourages appropriate care and respect for their transness and provides resouces on how to do so.\nOutlines TYPES OF TRANSITION: hormone blockers are the ONLY treatment used on adolescents and are COMPLETELY reversible.\n\n\n\n"}, {"title": " You can still uphold the principles of JP and have \"leftist\" policy positions. (self.JordanPeterson)", "likes": "1388", "comments": "549", "content": "You can be against the ridiculous wokeness and compelled speech on college campuses, and still be for Medicare-for-All.\nYou can be against equity / equality of outcome, and still be for the decriminalization of marijuana possession.\nYou can be a critic of socialism, and still be a critic of capitalism.\nDon't worry about labels and think for yourself. Not openly evaluating ideas because they are \"liberal/leftist\" will stunt your intellectual growth and will make you less dangerous.\n(*Not here to debate politics, just making a point. Sorry if it sounds preachy.)\n\n"}, {"title": " Toxic Masculinity: Today I lost my friend. (self.JordanPeterson)", "likes": "1772", "comments": "176", "content": "You can call it coincidence; I call it collective suffering.  Yesterday I started listening to Dr. Peterson’s newest pod-cast on Toxic Masculinity. Today I found my friend dead in his home. He had killed himself. He was a 42-year-old man with many of the same problems I’ve had. Maybe that’s why we became friends. You see, I live on a community farm in the foothills of the California. I’ve heard it said that people move to the mountains for one of two reasons; You’re either chasing something or you’re running from something. Both Ryan and I were the latter.\nMy story is very similar to a lot of men in my generation. Parents got divorced when I was young and 1980’s justice was to give the kids to the mom. I saw my dad 4 days a month or less from 3rd grade until we just stopped seeing each other.  My mother was a full-time corporate accountant and my sister hated me, so I basically raised myself. And I did a terrible job. Surrounded by two women for the better part of my life, I never had a stable father figure to show me even the simplest of things. Like how to shave. My mom did her best, but here’s a tip single moms; \"some\" Men shave with the grain. (Apparently I still don't know)\nSo poor me right. I had all the material possessions a kid could ever want. And I didn’t know it at the time, but that’s not everything a kid could ever want. Needless to say, I found drugs at a young age and quickly fell into that dark and desperate world. Fast forward 20 years later… I’m strung out on heroin and crack and I just tried to kill myself. I found out I tried to kill myself days after I did it. I had blacked out again. This time it was for just over a month. When I did come to, I was in the ER having been sowed back together. I wish I had died. But there I was in the hospital on my way to being shipped off to my 50th some odd treatment center, no exaggeration needed.\nAt this point the recovery community had given up on me along with every other person I had ever cared about. And for good reason. It wasn’t that I was a criminal or did terrible things to people. In fact, I never stole anything, or physically hurt anyone. You see I started a business when I was very young and I managed to keep it going despite my best efforts to ruin it. So there I am, home less again with every bridge burned. My grandfather had died while I was in treatment. I received a car and about $2000 for my inheritance. I took that money and car and began rebuilding my life all over again. I moved into an abandoned trailer on a community farm in the middle of a snowy winter. I had no heat, no electricity, and no running water. I was the happiest I had ever been.\nHere I am 2 years later, still clean. Everyone thought I was crazy, and secretly still does, haha. But I needed to hit the reset button on life. I needed to find out what was real and what was lingering psychosis. The city had betrayed me. I had betrayed myself. Somewhere in these hills I found a little peace. Who knew that’s just what I was looking for?\nAlong came Ryan. He had just come out of the bush, literally. Very similar story to mine except he was a drinker. We didn’t go to meetings or really have much as far as recovery goes. But we had the farm and our tiny little insignificant lives. Like everyone on the farm he started building. Ryan was an out-of-work carpenter, and was obviously a skilled tradesman. I liked Ryan. He was bat shit crazy, but who isn’t a little crazy after having gone through what we had.\nWe developed a close friendship over the past few months. I would bring him supplies from the world, like gas for the generator, a pouch of tobacco, that sort of thing. I live a pretty normal life now, considering. I go to work every day pay bills, even bought a brand-new Subaru which I’m very proud of. Ryan was just getting started on his new life. He had a hard go of it and his stories were a testament to that. We would exchange tales and talk about our plans for the future. I even found him a job and let him use my car to put in a bid. Things were looking up for Ryan and I.\nThese last couple days it rained pretty hard. Usually when that happens, everyone on the farm stays inside. It’s pretty nasty off-grid when the weather is bad. So we bunker down and stay warm and when the sun comes out we return to what we were building. Well last night I walked down to Ryan’s tiny house to bring him some tobacco. I called to him and heard no answer. I walked into his area and looked in the window. I saw him sitting there in his recliner with his eyes closed. I assumed he was sleeping. I left his tobacco on the porch.\nThis morning when I woke up, I had this bad feeling like something seemed off. I kept thinking about him sitting in his chair with his head tilted off to one side. It seemed like a strange position to take a nap. When the sun came up this morning, I walked down the dirt road to Ryan’s tiny house. This time when I looked in, I could see that there was blood coming out of the side of his nose and mouth. I didn’t even go inside. I knew. I called the police and they came right away. The police confirmed what I had suspected and said there was an empty pill bottle on the ground. My heart sank.\nI wish I could tell you that this is the first time this had happened to me. The truth is my life has been littered with suicide and overdoses for the better part of a decade. These are the places where people like Ryan and I end up. And not too many people will miss us. Probably rightfully so. But I’ll tell you what, I miss him. Ryan was a man, just like me, that had lived a hard life. Probably harder than any of you could imagine. I don’t blame him for doing what he did. I have felt his pain and know it very well. Death was the least of his problems I assure you.\nToday I finished Dr. Peterson’s pod-cast on toxic masculinity on my way to work. Just a couple hours after finding one of my only remaining friends in this world dead in his home. If there is a God, it was speaking through this pod-cast directly to me. It was what I needed to hear at that exact moment. When everything in my being wanted to scream at the world for our existence, Dr. Peterson brought me back to gratitude. Grateful for having the opportunity to get to know Ryan and the non-toxic side of him. Also grateful for my own life, the beauty that I get to see every day, and the now productive service that I get to provide to people in this time of need. You see I still have a job through this pandemic. Millions of men AND women are getting up every day and heading out there to do our jobs, never knowing if we will be the next one to get sick. Not because we are men or women. But because we are human beings and that’s what we do for each other. Somewhere along the line we all forgot that we are in this together, and most of us are just doing the best we can. Be good to each other, please… RIP Ryan.\nSincerely,\nThe real Chris\nP.S. Thank you Dr. Peterson for your work. I was very angry at myself and the world. Through your book and your podcasts, I have found my aim again. Better late than never. Please continue helping people, you are brilliant.  \n\n"}, {"title": " I am a young woman who turned her life around after finding Dr Peterson (self.JordanPeterson)", "likes": "2139", "comments": "148", "content": "I'll try to keep this brief. \nI am a woman of 25 years, who in January 2018 at the age of 22, happened to watch the debate between Dr Peterson and Channel 4's Kathy Newman. \nMy initial thought was as such: she is not listening to a word this man has to say. The incredulousness of this led to my watching of several of his lectures that evening.\nAt this point in my life, I was living in a squat with other drug addicts. I had been in a spiral of drug use and agoraphobia ever since being violently sexually assaulted. I was violently sexually assaulted because I was engaging in prostitution from the age of sixteen. I was engaging in prostitution from the age of sixteen because my mother refused to be responsible for her children, because she believed that the state would be an adequate father. I am eternally thankful that I happen to be infertile, for obvious reasons.\nThe lectures of Dr Peterson introduced me to Carl Jung. I began to enact responsibility in my life. In the space of two years I had become sober and managed to get a salaried job. I started attending weekly psychotherapy with a wonderful Jungian analyst, who has been perhaps the first positive female figure in my life. I began recently training after work as a counsellor, aiming to assist those in similar situations. \nI still struggle with nightmares, but I no longer wake into panic attacks. I still must be vigilant against the conditioning of my upbringing and its impact on my behaviour, but I must remember that the willing inversion of good is evil, and that it is differentiated from suffering. \nI think it is clear that worldview of Dr Peterson has benefited me far more than that of Kathy Newman. I will defend the right of a woman to determine her own path in life, but she should refuse to see herself as the victim of some manner of patriarchy, and should instead be responsible for her own self determination in life.\n\n"}], [{"title": " Seriously, How is J.P. even controversial? I simply see good common sense and balanced logic. (self.JordanPeterson)", "likes": "1507", "comments": "787", "content": "Like most, I stumbled upon him on YouTube, was blown away and now maybe have listened to nearly every lecture and interview. \nI honestly don’t understand how there is hatred or controversy around his ideas. \nUnless someone deeply believes that the entire system and men themselves are the purest form of evil and should be burnt to the ground - literally an anarchist nazi view point towards men. I have no grasp on what he has said that is so upsetting? \nIf anything, I feel his lectures if not simple ideas should become required material for all school children, especially boys, but girls need to understand too that half the population isn’t evil. \nAny insights?\n\n"}, {"title": " I really hope Dr Peterson makes it through this tough time. I had the thought of losing him today & I honestly started to cry. I never had a father who loved me so to hear his inspiring words really meant the most to me. He’s changed my whole life. The father of the internet & the father I needed (self.JordanPeterson)", "likes": "1316", "comments": "142", "content": ""}, {"title": " To those who say we shouldn't listen to Peterson's life advice because his own life is in shambles (self.JordanPeterson)", "likes": "3387", "comments": "1107", "content": "With Peterson's personal disaster comes a horde of vicious haters using it as an opportunity to tear him down. When he was well, they twisted his words. And now that he's sick, they're using it as a chance to launch a new type of offensive. They rejoice in his suffering, and ask what they consider to be a slam-dunk question: \"If Peterson can't keep his own life together, then why should we listen to his life advice?\"\nI was once a regular customer at a cafe in my area. It was a lonely time in my life, where I spent my days enveloped in depression. Nearly everyday I would drive to that cafe and spend hours studying while drinking green tea. There was a particular employee that I was always happy to see. Although I was in a very introverted state at the time, he managed to consistently engage me in a way that met me where I was and helped me find a little bit of brightness in life. Eventually I moved on and stopped going to that cafe. A few years later I returned and I was told that he had walked into a forest with a revolver and ended his life.\nWhat's the lesson here? People who go through hardship in life build tools designed to address those hardships. People who journey through Hell learn how to survive Hell. But sometimes these people never quite build something powerful enough to save themselves in the end. Struggling with depression for years, the employee at the cafe had a lot of practice developing a way of being that would address depression in himself and others. I found talking to him cathartic. His tools were powerful enough to help me at the time and help him in the short term, but they weren't powerful enough to save him when everything in his life came to a head.\nPeterson has suffered from severe depression, anxiety, and other mental and physical health problems for his entire life. He's had profound difficulty keeping his mind and body in one piece. Throughout his life, he's built a deeply woven system of philosophical and psychological insight designed to help himself and others. The power of his tools are in proportion with the depth of his struggles. Whether or not he's able to save himself in the end, he will have helped millions through his effort to educate.\nBesides, Peterson took every last ounce of strength that he created in himself by applying his insights to his own life and reinvested everything into more thinking, more speaking, and more writing. He pushed himself to the absolute limit of intellectual performance and social communication. With such a powerful system of self-improvement, he could have slowed down in life, taken it easy, and had a simple life of happiness, health, and order. But instead he put everything on the table in a way that few ever do, and he pushed so hard that he finally fell apart.\nMost people criticizing him couldn't say the same thing about themselves. They might note that their lives are more orderly and less chaotic than Peterson's, but what does that prove? Imagine the stupidity and arrogance you would need to make fun of a professional athlete who sustains a career-ending injury while they're pushing the limits of their sport, simply because you, sitting on your sofa at home eating chips and watching TV, never would have hurt yourself that way. Peterson walked a fine line between order and chaos. In his mission he pushed the limits of the human spirit, and for that we can only be forever grateful. From day one it was clear that he was prepared to sacrifice everything and pay the ultimate price. As he said himself at the height of his great run, \"I'm surfing a 100-foot wave, and generally what happens if you do that is that you drown.\"\nThe happy and healthy rarely become philosophically minded intellectuals who spend 80 hours per week for 30 years thinking about profound concepts. People like Peterson are born out of torment. Rather than criticize him for falling headlong into perhaps the greatest chaos of his life, let's be grateful for the sacrifices he's made for the betterment of humanity.\n\n"}, {"title": " Four months of REALLY working on improving myself really don't seem long, but the results speak for themselves (self.JordanPeterson)", "likes": "602", "comments": "84", "content": "The relevant bit is near the bottom, just have to walk myself there, because each step along the way was meaningful.  \nJust skip to where the asterisks are.  \n\nI've been dealing with BPD for the past...\n12 years if not more?\nNeedless to say, it fucked me up in more ways than one, especially because I barely had any manic episodes, so mostly it was just getting up each morning and fighting not to kill myself, because then who's going to take care of my dogs?  \nI've always avoided getting an actual prescription, because some of the pills I tried literally erased WEEKS of my life, so yeah...\nThankfully, my ADHD prescription seems to make the existential fog bearable, so I just stayed on that.  \nNote on using stims to treat depression:\nDon't.\nIt works for me, but N=1, and even then, it just turns everything to a sort of dull... something.  \nOK, so along with the ADHD meds, I was also self medicating with nicotine(I used to smoke is what I'm saying), and about 2 years ago I noticed that I had a persistent cough that wouldn't go away, and it was dawning on me that I was starting to get winded doing things that I'd considered easy in the past.  \n\"Max, you actually promised yourself back in 2011 that you'd quit smoking when you stopped working in the service industry(specifically, when I stopped working as a chef). It's been a year, WTF happened to that promise?\"  \nQuitting attempt numero uno went about as well as expected for cold turkey quitting.\nLasted a week, then smoked a full pack like nobody's business.   \nAnother 2 months pass by, and October rolls along.\nI got introduced to vaping.  \nOh, people actually use this to quit smoking?\nYou can control your nicotine intake?\nSounds cool, let's try it.  \nBought a kit, some vape goo, and promised myself that each month I will lower nicotine concentration by 4mg per month.  \nThe first week of each month was awful, because the lower doseage had me craving for a smoke, but it wasn't as bad as when I went cold turkey(Plus, I stopped smelling like an ash tray, so definitely a plus).\nBefore I knew it, 4 months had gone by, and I hit 0mg of nicotine(basically just flavored vapor).  \nAnd yet I didn't stop vaping, because I still had that oral habit, but at least I was no longer having nicotine withdrawal, so it was purely psychological at this point.  \nThen, I was on my way to work in May, and hit a turn in a bad way, sending me flying at ~30 kph off my bicycle.  \nBroken radial bone, cracked shoulder joint and heel, and 4 bruised ribs.\nAlong with numerous scuffs on my face, arm, and leg(think scuffed knees on kids, but bleeding heavily and covering large sections of the face, outer shin and around the elbow).  \nWhen you realize the fact that I was riding without a helmet, the fact that I managed to get out mostly walking(I had to crawl to the side walk, because my I couldn't stand up at first, or breath, for that matter. Not that I remember the crawl itself, since I think I blacked out from the pain for a minute), and without even a mild concussion(I climbed into the ambulance on my own, and managed to diagnose most of the damage even before the medics arrived. I did miss a rib, and didn't know about the shoulder, but 🤷🏼‍♂️) is downright miraculous.  \nOh, and all my vape supplies were broken from the force of the crash(or me landing on them, who knows?).  \nEnter 3 weeks of watching anime and sleeping.  \nWhen I got back to work, I didn't have even a hint of craving for a smoke.\nVictory!   \n\n15 months later, I decided that I should bring my own food to work.\nEnter the weekly meal prep, along with the associated mess that you get when you cook 10 meals at once.  \nA month later, I spotted one of these folders, and bought it as a gag gift for my future self.  \nA week later, it arrived.  \nAs it happened, that same day I had a \"ok, from today, let's try changing one small thing at a time.\" moment, and decided that I should at least get my t-shirts in order.\nThe next day, when I got up, I thought to myself:\n\"Let's make the bed before leaving.\"  \nSo a month passes by, where I make my bed(badly, but I keep at it), every single day.\nOn the weekends, I decided to clean one shelf at a time in my closet and desk, and keep it clean.\nAnother month passes, and before I know it, my room is spotless at practically all times.\nBut there's more!\nI actually started sleeping better, and this snuck up on me, and I realized this only last week:\nThere are days where I actually experienced happiness at simply being alive.\nNot because something happened that hyped me up, but literally waking up and greeting the day with a smile, come what may.  \nAt this point, it's mid July, and since my room is spotless, I decided to start organizing the kitchen in the same way.  \nAfter I finished washing the dishes, I started opening cupboards and reorganizing all the dishes and tupperware, tossing away boxless lids, and lidless boxes.  \nAfter doing a fair share of cleaning for the day, I went on to get my reward:\nA nap, and some mind numbing anime.\nAt some point, my brain went:\n\"Y'know, it'd be cool to learn Japanese.\"  \nSo I started looking up how to study properly, while using the first lessons on duolingo to at least familiarize myself with the alphabet(2 weeks in I'd found a lot of reviews saying that the Japanese course on duolingo is shit).  \nHowever, that didn't matter, because at that point I think I formed a keystone habit.  \nEvery day, I'd do at least an hour of Japanese practice(I moved someplace else, and my commute is 30 minutes one way by public transport now, along with another 10 by bicycle, so an hour of study gained), but that's not all.  \n2 weeks later, I decided to use the momentum I was building, and started vacuuming and mopping the house.\nThree times a week.\nWash the porch once every 2 weeks, as well as my bathroom once every two weeks(So I do one of those every week basically).\nThen, in the middle of August:\nI signed up to a gym, and started going 3 times a week, before work.\nLiterally getting up at the crack of dawn to get to the gym as it opens.  \nAnd that brings us to today.  \nDespite not changing my sleeping schedule at all(around 6:30 hours per night, just the hours were moved around a bit), I have WAY more energy when compared to me 5 months ago.\nI also, magically, have MORE free time.\nAround 3 hours each night, after I'm done cleaning.  \nAnd, as mentioned before, I actually feel...\nNot happy per-se, but not depressed either.\nSatisfied? Content?\nWhere the me from 5 months ago was lucky to get a day or 2 every few weeks where he was feeling at like +3 on a scale from -10 to +10, I've been at a solid +4 for about 3 weeks(With some dips towards rage, which I believe is justified, since it happens whenever someone nearly runs me over).\nI only have pictures of my room on my phone, mostly because the rest of my house doesn't match the same level of care, and I unfortunately don't have any \"before\" pictures for my room, because I didn't actually believe I'd reach this point, but here's the \"after\":\nhttps://imgur.com/a/CHiVeWB \nIn the closet:\n- Bedding\n- Sweatshirts, light sweaters, and a thick woolen one\n- Ratty shirts I wear around the house/walking with my dogs/doing stuff that might ruin my clothes, t-shirts I actually wear when going somewhere(separated to 2 sizes)\n- Long sleeved button downs, short sleeved ones(There are actually more in the left section, hanging on proper hangers, since it's still summer), shorts\n- Towels, jeans\nTop drawer is boxers and socks, bottom one is workout gear.  \nEdit:\nHoly crap!\nMy first plat!\nThank you kind stranger <3  \nAlso, this totally exploded more than I thought.\n\n"}, {"title": " M-103 'Islamophobia' bill propagandist regurgitates 8 minutes of buzzpoints (self.JordanPeterson)", "likes": "10", "comments": "6", "content": "A.K.A. How to say absolutely nothing in 8 minutes:\nhttps://www.youtube.com/watch?v=bHEyWmIrybs\nWhat proportion do you think Joly doesn't understand where the interviewer is coming from, and what proportion is pure propaganda? Note that she's a PR expert as well as a politician.\n\n"}, {"title": " YOU! Yes, you. I want you to have a great weekend. (self.JordanPeterson)", "likes": "1453", "comments": "109", "content": "❤️\n\n"}], [{"title": " A paralyzed young man thanks you Dr. Peterson (self.JordanPeterson)", "likes": "225", "comments": "13", "content": "I am reaching out to let you know just how much you have effected my life. In 2016 i was in a quite horrific motorcycle accident. This left me paralyzed at the age of 19 years old. I was put in a situation that i would never wish upon 99.99% of the world. I had to relearn every single aspect of my life it seemed. One day I stumbled upon your podcast with Joe Rogan and I learned who you were and why you became so well known. Little did I know that I would be spending hours and hours listening to you speak while I was recovering in the hospital and in physical therapy. Your lessons on taking responsibility for yourself were so basic yet so important for me to hear. I had to realize that i needed to stop blaming everything around me for what happened, take some ownership and move on. This is just one example of many, in ways that you have helped improve my life. I don't know if you will ever see this, but after speaking with my Neurosurgeon, (who's also a big fan of yours) he convinced me to write to you.\nThanks again Dr. Peterson! Keep doing what you are doing, your positive impact is immense and I wish you and your family a great 2020 and many more years to come!\n-Liam Wagner\nPS. This photo is me and my Monoski which I have set a goal to compete racing professionally one day!\n\n"}, {"title": " Alternative view of meaning of scriptures (self.JordanPeterson)", "likes": "2", "comments": "1", "content": "Hello Dr jordan Peterson, have you heard of or seen Dr. Hugh Ross or other scientist like him. They tend to come to the conclusions that biblical scriptures of genesis does give an accurate siscription of.  The creation of the earth and that current scientific data now is confirming them. He has videos on youtube also and is popular. I was wondering, in your lectures you tend to put forth that they may not be factually based as to what happened and possibly brought about only as storys designed to bring forth a deeper understanding of our individual and cultural underpinnings.  Is it possibly both. I belive it would be an Awesome discussion having the two of you come together to bring your science's together and see what kind of conclusions could be made.\n\n"}, {"title": " Thank you for literally saving my son (self.JordanPeterson)", "likes": "1746", "comments": "63", "content": "Hi Jordan \nI want to thank you for literally saving my son. The difference in him and the improvement in his mental health is nothing short of a miracle . He has not only transformed himself but also in doing so, his families life for the better too. He is 18 and Autistic and for many years suffered with debilitating anxiety and depression. He could not cope with mainstream school and had to go to a specialist provision. Through listening to your lectures, he decided to improve his life.  He heard you mention many philosophers , researched several and related particularly well to ancient philosophy, mainly stoicism and Taoism. It was like someone gave him the rules to live his life in a positive , empowering and proactive way. He is now actively healing himself through a mixture of philosophy, meditation, mindfulness and working through an anxiety workbook. He is unrecognizable from 6 months ago and his Psychiatrist is so surprised and pleased with his progress. He is now regularly attending his Autism specialist college 9-3pm (he was for the last few years only managing 2-3 hours a day due to debilitating anxiety.) He is finally starting to blossom, his mental health is massively improved and he is developing so many independent living skills . The roles have now completely reversed and he is now his mother’s mentor and life coach! I too have learnt so much from you and just wanted to express my huge gratitude to you. Thanks for your passion, energy and inspirational commitment to helping others become better human beings in the dense fog that is modern western life. Best wishes Katie\n\n"}, {"title": " Books that are spoiled in 12 Rules for Life (self.JordanPeterson)", "likes": "19", "comments": "6", "content": "Hi Reddit\nI was reading 12 Rules for Life and accidently had the ending of The Stand by Stephen King spoiled, when Jordan reference it in Chapter 3 (?). Are there any other works by King that are spoiled in 12 Rules? I was annoyed by it, because The Stand is on my shelf, and I haven't read it yet. \nThanks\n\n"}], [{"title": " Tammy Peterson's condition: \"cured\"!!! (self.JordanPeterson)", "likes": "2514", "comments": "200", "content": "Here are previous updates on Tammy's health. \nAnd here's the latest, wonderful news: \n\nOn the personal front: As most of you know, my wife Tammy was diagnosed with cancer almost a year ago now and has had several surgical procedures in the last five months (the first, in March, to remove a third of her left kidney; the second, in May, to remove the remainder as well as much of the surrounding lymph system, as the rare malignancy she was suffering from had spread to some of that tissue). As a consequence, she developed a surgical complication known as chylous ascites, which meant that her lymph system was leaking more than four liters of fluid per day into her abdomen. It’s a rare condition, and very dangerous in its own right. After trying dietary manipulations (low fat is recommended to reduce lymph production) as well as five weeks of intravenous feeding—which bypasses the lymph system and allows it, in principle, to recover—we took her to a clinic in Philadelphia run by Dr. Max Itkin, Director of the Penn Center for Lymphatic Disorders, the only specialized unit in existence that deals specifically with the condition that was afflicting Tammy.\nOn Wednesday, August 21, Dr. Itkin and his colleague Dr. Gregory J. Nadolski, both interventional radiologists, tried a needle-guided procedure to glue the internal leaks shut, after locating them with a poppy-seed derived dye and oil. That procedure failed, as the ducts were too mobile to pierce, even with the exceedingly thin needles employed. They tried two other techniques as well, more standard—but reported to us after several hours that they were unable to repair the problem. That was exceptionally disheartening news, as the Penn clinic was in some sense our last hope. Both physicians did promise that they had other tools at their disposal, but that their use would require more extensive interventions, including, perhaps, additional abdominal surgery. That was a very dark day. But then, something marvelous: in about 50% of cases, the poppy seed dye, lipiodol—which is also a tissue irritant—closes lymphatic leaks. Over the course of the next few days, Tammy’s fluid output decreased markedly. She was put on a low fat diet (taking food by mouth for the first time in five weeks). The flow continued to decrease, so we upped the fat content (as higher fat diets produce more lymph, and also tend to turn it cloudy, so that remaining leaks can be identified as they drain). By Monday, August 24, her production of lymphatic fluid had normalized completely. They removed the catheter which had been draining her abdomen, took out the intravenous feeding tube that had been inserted through the veins in her arm to an area just above her heart—and discharged her. Cured. And, even more unbelievably, all this occurred on the same date as our thirtieth anniversary.\nSo, we flew back home to Toronto on Tuesday. Tammy’s feeling very good and, although she is still emaciated and much weaker than normal (she lost 15% of her body weight during her ordeals) she has a tremendous appetite and seems able to tolerate almost all foods. Now we’re trying to determine how to return to a life that approximates normal and stable. We still have concerns about the return of the cancer, of course, and have a CT scan scheduled for mid-September, but the last few scans and analysis of abdominal fluid have been clear, so we have reason for cautious optimism.\nI’m so shocked by this turn of events (a sentiment shared by the rest of my family) that I don’t know what to think or do. So, I’ll just thank all of you who shared messages of hope and prayers (many of which we printed and posted on the wall of the hospital rooms she occupied for so long in Toronto). They were very helpful.\n\n\n"}], [{"title": " What is your Dragon that you need to slay? (self.JordanPeterson)", "likes": "1530", "comments": "542", "content": "I feel lately this sub is slowly becoming a circle jerk for uninspired, uninteresting, conservative ideological posts. To change that I want to motivate this sub to go back to what Peterson is actually teaching and ask:\nWhat is the Dragon that you need to slay and what is holding you back/ what is making it difficult?\nWriting this down will 1. help you articulate your problems so that you are no longer in the unknown and know what needs to be done to win and under what conditions you lose. And 2. It would be nice to see what problems this sub has and how Peterson was able to help/ will be able to help.\nEdit: I am reading all the comments and this is exactly what I was looking for. This type of community engagement is ten times better than the lame posts about Greta Thumberg, feminists and what not. Thanks all!\n\n"}, {"title": " Racist professor recorded teaching anti-white curriculum (self.JordanPeterson)", "likes": "1363", "comments": "862", "content": "Some of you might remember me from the incident last January where I was disqualified in a high school debate round for quoting Jordan Peterson and Ben Shapiro.\nI am now a university student and have been recording my professor promoting abhorrently anti-white and anti-intellectual arguments, such as:\n\nScience is fake, white people invented it to control the world. Outer Space is not real\nAll white people are racist\nDenying that you are racist is proof that you are racist\nBlack students should not answer questions from white students\nTelling someone what words mean is linguistic sexual assault\n\nAnd many more. I've uploaded it to YouTube and am hoping to bring attention to this.\nhttps://youtu.be/YjvmIFrX1xQ\n​\nEDIT:  To address a concern that keeps popping up: No, the professor was not \"just playing the devil's advocate\", nor was he \"forced to defend those positions\".  You are not playing the devil's advocate when the vast majority of your lectures involve pushing a particular set of ideologies which barely relate to the subject, all while being dismissive towards any criticism and being unwilling show the other side. If he were truly concerned with teaching debate, he would at least acknowledge valid criticisms that I bring up against these positions, like the fact that we have telescopes and black astronauts that allow us to verify the existence of space, or that there are plenty of white people are not racist and do not have privilege. He easily could have agreed that these are arguments that I could make, even if he thinks that there are responses to them. Instead, he shuts them down immediately and in a manner which suggests that he isn't an advocate, but the devil himself. We were not in a debate round, he had no reason to present the positions in this way. I touch on this in the later half of the video, but the fact that he told me that I wouldn't be allowed to argue for the philosophy of Stoicism - yet he is somehow okay with rounding up all white people and sending them to the space gulag - shows that he isn't focused on the argumentation of the positions, but on their ideological conformity. This is a debate class, but it is being used as a training ground for post-modern critique and cultural marxism, instead of real debate.\n\n"}, {"title": " Petition for the moderators to remove posts that have nothing to do with Jordan Peterson (self.JordanPeterson)", "likes": "2677", "comments": "420", "content": "Mods:\nPlease start removing off topic threads.\nA post expressing a view that vaguely aligns with something Jordan Peterson said once does not mean that the post is about Jordan Peterson.\nMasturbatory comments about free speech or telling the truth are not about Jordan Peterson unless Jordan Peterson said them.\nIt shouldn't be enough to take a video of someone \"telling the truth,\" give it a caption related to rule 8, and then post it here. Fight videos are not rule 11.\nThis is not supposed to be a clone of r/conservative. This is not the place for strawman anti-trans memes or facebook-worthy posts about how leftists are hypocritical. Allowing these posts to take over the sub does not mean you are championing free speech. All it's doing is making the community toxic. None of these threads contain deep discussion, abide by the best practices in the sidebar, or have anything to do with Jordan Peterson.\nMany of us would like you to do your jobs. Every thread recently has at least one comment asking if there is an alternative subreddit. That means your community is unhappy.\nNobody is trying to censor conservative ideas or kick out the right. There is a diversity of political views among JP fans, but we can all get along as long as the posts actually have something to do with the common interest that led us to this sub. Asking for posts to be on-topic is not a high bar.\nPlease enforce the rules and remove the off topic political spam.\nSincerely,\nA dissatisfied subscriber\n\n"}, {"title": " RE: Transcript of my Tonderai speech which got censored by Mr G (self.JordanPeterson)", "likes": "163", "comments": "76", "content": "Due to popular request, below is my full Tonderai speech, which my school censored:\nFeminism, as a political philosophy, was first developed throughout the 19th and early 20th centuries, with first and second wave feminists striving to achieve equality of opportunity; that is, the right for women to work and study as men do. However, modern third wave feminism, developed in the late 20th and early 21st centuries, currently aims to introduce a different type of gender equality: equality of outcome. Simply put, equality of outcome is a biological and psychological impossibility, and, therefore, third wave feminism is in no way an improvement to Western society, but in fact a detriment.\nTo elaborate, third wave feminism, governed by this doctrine of equality of outcome, aims to reduce the number of male graduates in every field to 50%, thereby forcing equal representation from both sexes. Third wave feminists believe that the “misrepresentation of women” in many male-dominated fields is primarily the result of an oppressive patriarchy, which is somehow present in today’s society. To be clear, the mere suggestion that our society is ‘patriarchal’ is tremendously absurd: the truth of the matter is that men and women have been living in cooperation since the dawn of time, and the inevitable divergences evident in the differing roles of men and women are the result of the immutable biological differences between the sexes.\nTake for example, the hormone oxytocin, which dictates our social proclivity. Whenever we are involved in a social situation, oxytocin is released into our systems, which consequently triggers the release of dopamine and serotonin, whilst reducing the presence of cortisol, thereby making us feel terrific. However, women are much more sensitive to oxytocin release than males, meaning that women have a much higher social proclivity than men. This biological fact gives rise to the common saying: men prefer things, women prefer people.\nThis hormone alone can clearly explain why 84% of Australian engineering graduates are male (as of August 2019) [i]. Given that men are less susceptible to oxytocin than women, and therefore more likely to work with things over people, men are more likely to study engineering than women. Furthermore, consider the fact that 92.8% of Australian nurses are female (as of September 2018) [ii]. This figure becomes obviously justified once one realises that women have a higher sensitivity to oxytocin than men, and are thus more likely to prefer working with people over things. Once again, these statistics are not the result of any ‘patriarchy,’ as radical feminists so often suggest, they are instead purely biological.\nIn closing, I want to make it clear that all efforts to force equality of outcome have failed. For example, many Nordic countries have gone to great lengths to establish gender equality, such that, according to a New York Times article released in March 2018, Swedish preschools teach boys to dance, and girls to yell. However, a recent study [iii] performed by Leeds Beckett University and the University of Missouri has found that, since these egalitarian measures have been introduced, the aforementioned psychological differences between men and women have increased: that is, the proportion of male STEM applicants has increased, while the number of female STEM applicants has decreased. This, if anything, shows that gender equality cannot be forced; not through women in engineering scholarships, not through enforced quotas, and certainly not by feminising men. \nTo be clear, gender equality cannot be forced, furthermore, by brainwashing English students into believing that traditional gender roles are inequitable. Doing so is an insult to truth. Teaching should be devoted to the conveyance of facts, not the creation of left-leaning, data-deficient ideologues.\nIn summary, equality of outcome is a biological and psychological impossibility. Third wave feminism, an ideological catastrophe, is nothing but a parasite to Western society, and a disgrace to the honest pursuit of equity that feminism used to be. Thank you.\n[i] https://www.theguardian.com/australia-news/2019/aug/29/university-makes-10-point-entry-score-adjustment-for-female-applicants \n[ii] https://www.brisbanetimes.com.au/national/queensland/only-7-per-cent-of-qld-s-nurses-are-men-here-s-why-that-s-a-problem-20180831-p500zt.html \n[iii] http://eprints.leedsbeckett.ac.uk/4753/6/symplectic-version.pdf\n\n"}, {"title": " My speech was censored from a free speech event because I wasn’t politically correct. (self.JordanPeterson)", "likes": "2675", "comments": "450", "content": "My school runs an annual free speech competition called Tonderai: the event is dedicated to a man (named Tonderai) who was killed for standing up for what he believed in. Students are encouraged to write a speech and present it in front of the school on assembly. I have never done a speech before, but now that I am in Grade 12, have read 12 Rules for Life, and solidified my own political opinion I decided to discuss the dangers of equality of outcome and third wave feminism. I wrote my speech and sent it to a couple of friends who were excited at the discussion it might create. It got circulated around the school, and I received an email from the teacher who coordinates the event (we’ll call him Mr G) telling me that I was no longer allowed to present my speech as he had read it and thought it might offend some people. I told this to my friends, who, like me, became quite upset. One friend (we’ll call him Sam) got particularly angry about how my speech was being blocked from a free speech event and decided to do my speech instead of his. I thought this was an awesome (and edgy) idea, but told him not to be afraid to back down as well, as the repercussions may be huge. Sam did the speech on assembly this morning. Mr G was fuming and staring at me the whole time. It was pretty funny to be honest. Many teachers and students have since found out about it, and our head of secondary himself, after finding out about the situation, said that blocking my speech totally went against the spirit of the Tonderai event and he therefore fully supports what Sam did. The speech also encouraged some healthy discussion about feminism throughout my school, so that’s good. Mr G is still angry though. He sent an email to everyone involved in Tonderai thanking them for their time, but didn’t sent it to Sam. Haven’t heard anything from Mr G yet, and honestly am not expecting to. This censorship totally backfired on him.\n\n"}, {"title": " This subreddit is way to toxic. (self.JordanPeterson)", "likes": "4012", "comments": "894", "content": "As a big JP Fan, I came here expecting smart conversations and arguments. What I instead found is a place where propaganda is the most thriving factor.\nWould like to know why you are here giving your political opinion, in some cases clearly only to trigger people?\nEdit: Thanks for gold and silver, kind sirs and siretts.\n\n"}], [{"title": " The Doge Republic Wishes to Propose an Alliance with Petersonland. (self.JordanPeterson)", "likes": "3", "comments": "31", "content": "Hello,\nA group of us are running an innovative campaign that wishes to promote critical thinking, humor and classical liberalism. The campaign is very tongue-in-cheek. It's done so on purpose, in order to make it spread quickly, through all corners of the Internet.\nWe are also trying to promote the presidential candidate Andrew Yang (whom Elon supports), as well as Sam Harris, Professor Peterson and Elon Musk. It would be great if we get some support from people in this Subreddit.\nWe aren't necessarily doing this in order to get Andrew Yang elected, but rather, to bring visibility to things that he says, that no other politician is saying. The fact that Amazon pays 0% in taxes in the US, and no other politician is talking about it, is not acceptable.\nAdditionally, we are trying to bring the conversation around UBI and AI+Automation, within the Overton window of political discourse. America is probably not ready for someone as progressive as Yang in 2020, but we believe it is crucial to raise visibility around such issues, so that they become mainstream by the time the next presidential election rolls around.   \nAnd now, for the humorous intro:\nWe call ourselves \"The Republic of Doge\". The Almighty Doge has issued an executive order, for the formation of a Fellowship, as a way of fighting against the Chaos that exists in the world. Doge wishes to inform people of important issues, and banish misinformation.\nCheck us out: https://thefellowshipofdoge.com\nDoge.\nWith love,\nDoge.\n\n"}, {"title": " Let’s wish Dr. Peterson well — together (self.JordanPeterson)", "likes": "1529", "comments": "386", "content": "Edit: Video is done: https://www.reddit.com/r/JordanPeterson/comments/d9nq7u/love_to_the_peterson_family_collaborative_video/\nThank you for trusting me with this project. Any feedback at all please let me know.\n​\nAs you may know, Jordan Peterson is in rehab, suffering from anti-depressant (anti-anxiety drug clonazepam) withdrawal. He’s also been through a lot with his wife being extremely sick (but she’s better now). Edit: If you're not caught up, just watch this video that his daughter released 2 days ago: https://www.youtube.com/watch?v=SPwaixIuTrU\nFilm a 15-second or less video note of love to JP. Email it to me. I will simply edit them together and upload.\nIf I get at least 100 \"In\" comments I’ll comment to each of you individually with link to upload video to.\n​\nEDIT: Got enough people. Awesome. Let's do it. Email me your videos:\nEMAIL: [petersongetwell@gmail.com](mailto:petersongetwell@gmail.com)\nDEADLINE: MONDAY (9/23) Tuesday NIGHT 11pm EST. (Aka: Just film and send me your video NOW.)\nI will have uploaded by end of Tuesday (9/24) Wednesday (9/25). Be sure to check back here where I will post the link!\nFeel free to spread this post to anyone, anywhere. I will take as many videos as I can get.\n\n"}]]}