{"data": [[{"title": "Reminder that accounts need to be over 1 day old to post. (self.Jung)", "likes": "11", "comments": "22", "content": "Welcome to the many new subscribers.  Around 100 people per day are signing up and this has been the trend for a few months now.\nThe Automoderator has been set up to block new accounts from posting.  The reason is that (the very few) banned posters were immediately re-joining with a new name and posting again.\nIf new subscribers give it a day or two they should be able to post their own material.\n\n"}, {"title": "I read in psychology today that a fetish is the opposite of a phobia, both are defense mechanisms but one does it through fear other through pleasure. If a phobia can be integrated than why cant a fetish? (self.Jung)", "likes": "100", "comments": "40", "content": ""}, {"title": "Has Jung ever discussed about vivid dreams that take place when you're sick/have a fever? (self.Jung)", "likes": "15", "comments": "7", "content": "I think it's interesting that when someone usually has a fever or is ill, they sometimes end up having very vivid dreams that are almost hallucinogenic in nature.\n\n"}, {"title": "Dream InterpretationHave I experienced synchronicity? (self.Jung)", "likes": "4", "comments": "2", "content": "Hello, forgive me if this post gets a little wordy but I want to make sure that I explain everything I need to. For a little bit of background info, I am a 16 year old male, turning 17 in about a week. \nA week ago, I had a dream that I was sitting in my room, which sits at the front of my house. I was looking out of the window, and a firetruck was parked against the curb directly in front of my house. Nothing seemed abnormal in the dream, and I didn't feel especially positive or negative towards the firetruck. I woke up and sort of forgot about the dream, until later in the day when I was in my room around noon. I was sitting in roughly the same spot as I was in the dream, when suddenly a firetruck drove past my house. To give some context, I live on a dead end suburban street, and I haven't seen a firetruck come down it in years. The firetruck drove past my house, went around the col-de-sac, and drove back past my house the other way without slowing down or stopping. Once again, I didn't get any specific feelings from seeing the firetruck, but I was sort of freaked out because my dream more or less predicted the event.\nDoes anyone know the significance of this? As far as I can remember, firetrucks hold no special significance to me, so I don't know what to make of this. Did I experience synchronicity, and if so, what was the meaning? Any thoughts would be appreciated, thanks.\n\n"}, {"title": "Question for r/JungWhat are the symptoms or signs of mother/ father complex? (self.Jung)", "likes": "3", "comments": 0, "content": ""}, {"title": "Question for r/JungWhat did Jung had to say about psychopathy? (self.Jung)", "likes": 0, "comments": 0, "content": ""}, {"title": "What happens to one with a mother complex when their actual mother dies? (self.Jung)", "likes": "24", "comments": "14", "content": ""}, {"title": "What would Carl Jung say about the Mandela effect? (self.Jung)", "likes": 0, "comments": 0, "content": "How can hundreds of thousands of people possess the same ‘false’ memory? \nIs it an example of the collective unconscious? But if it’s false, how does it arise in the first place?\n\n"}, {"title": "Can anxiety be cured? (self.Jung)", "likes": "5", "comments": "8", "content": "Anxiety and the feeling of inferiority caused from childhood be fully cured?\nIt seems like cbt is a very superficial thing which only fixes the present anxiety. Cbt doesn't allow for me to adapt to a new task. Its like whenever I fix one anxious part of my life now the next task makes me anxious.\nThere seems to be a deeply rooted problem of always feeling inferior, most likely due of lack of approval during childhood.\nI heard of inner childhealing and meditating and self acceptance but wtf are these things suppose to do. I have been doing them but it doesn't do anything.\nOnly thing it has helped me on is just simply being aware of my thoughts. Like when working at Starbucks and getting into an argument I feel VERY strong emotional rush and I am more aware of it and I fight it anyways whereas before I would shrink and let the other person win over me.\nYes, sure mindfulness allowed me to be conscious and do it anyways but the anxious feeling is still there....\nI was talking to this friends who is getting phd in psychology and he just mentioned that it can never really be fully gone, also there is a huge genetic component to it, as in you are just ultra sensitive so for one person getting rejected during childhood might not mean nothing while to someone like me it can cause a scar eventually causing social anxiety.\nBasically he said live with it, be happy your not living in Afghanistan.\n\n"}, {"title": "The shadow is the key to physical immortality (self.Jung)", "likes": 0, "comments": 0, "content": "https://medium.com/@richardobyrne/weaponized-culture-and-the-fundamental-nature-of-reality-9467166c4427\n\n"}, {"title": "Memories, Dreams, Reflections - a new analysis of an old dream. (self.Jung)", "likes": "2", "comments": "1", "content": "I recently re-read memories, dreams, and reflections and was struck by Jung's assertion that a person's psyche is not necessarily Christian, or \"Western.\"\nWhen I was a teenager, the night my grandfather passed away, I dreamed of the church where his funeral was held.\nThe church has a large golden cross, hung in skylights.\nI see Jesus hanging on the cross - suddenly the cross darkens and sprouts branches, which in turn bear leaves.\nJesus grows paler, older, his beard grows white and long, a rope appears around his neck, and a spear appears in his side.\nOne of his eyes opens, and gleams White, the church background becomes a dark forest.\nThe new man on the cross speaks, each line with increasing volume and puncutated by an earthshattering \"BANG\"\nI know I hung from that windy tree\nSwung there nine long nights \nWounded by my own blade\nBloodied for ODIN\nMyself an offering to MY-SELF\nI had some prior interest in the Norse Eddas, but had not consciously committed anything to memory - these are the exact stanzas of Odin's account of his initiation by hanging from the world tree.\nI don't know what to think of this dream, in this context, but the memory haunted my reading of the book.\nThoughts? Primarily I think my unconscious may be hinting that to grow closer to my archetypal self, I must in turn become less \"Christian.\"\n\n"}, {"title": "Identifying too closely with the Self? (self.Jung)", "likes": "2", "comments": "6", "content": "This was mentioned in a book by M.L. Franz, but without any details. Anyone in r/Jung knowledgeable so as to be able to detail this over identification?\n\n"}, {"title": "Dream about Anima and Shadow (self.Jung)", "likes": "4", "comments": "1", "content": "I was in a anime like World where I had to fight to come to the top (think of Naruto/DBZ). I had a demon in me, who gave me his power and who made me stronger. I became a gift from a woman which was a ghost, who normaly rejected to connect with people with the demon, but it connected with me this time. The ghost let me transform into a woman when I used it´s powers. \nI´m pretty sure that this dream was about the integration of shadow and anima but I cant figure out more. What do you guys think?\n\n"}, {"title": "Question for r/JungHow do you know when you encounter the anima/animus? (self.Jung)", "likes": "36", "comments": "15", "content": ""}, {"title": "Question for r/JungActive imagination and background noise (self.Jung)", "likes": "2", "comments": "4", "content": "Hello all, hope you're all doing well.\nI've started using active imagination, through the \"hole digging method\" which was mentioned by a fellow Jungian of this sub. I've made three attempts with some amount of success. One thing however that is proving difficult to me, is that once I've relaxed and engaged with my activity, I am bombarded by background noise in my own head. Background noise such as, music in my head, quotes from films, my own intrusive thoughts all seek to dissolve the connection which I'm trying to establish and maintain.\nDoes anyone know of any means of reducing the amount of background noise in your head, so that you may be able to talk to the person in your active imagination?\nThanks as always and stay safe\n\n"}, {"title": "Question for r/JungMy anima is a little girl? (self.Jung)", "likes": "7", "comments": "3", "content": "I few years ago (around 2016-17) I had a dream that I will never forget. I believe that I met my anima in this dream. However, I notice that a lot of people will equate their anima with their soul mate, and have romantic/sexual themes in their dreams with them. I recorded my dream in my notes, which I posted below. Can animas have themes that are are not romantic/sexual in nature? If so, what could they symbolize? \nFROM NOTES: —I was in a place that was my room. It felt like my room but, it looked different. The windows were open and had big thin curtains flowing at the sides. It was light outside and I could hear the breeze and the sound of the leaves tumbling and being crunched outside. It looked like autumn time with all the naked trees and dead leaves everywhere. There were giant red bunnies running arounds and creatures that looked like boars. I remember telling someone (who turned out to be the girl) that they could enter my room through a certain spot in the window. She climbed through. I was sitting on my bed. She came to me and sat in front of me with her legs crossed. It was a little girl. She had pale white skin and blone hair. Her eyes were green with a reddish tint. She wore a thin strapped white under garment. She looked a little dirty, like she had fell in a pile of dead leaves. I said hi, and asked what her name is. When she opened her mouth to respond, the world became silent. I couldn’t hear her response. It was like if the audio were to suddenly cut out from a video. It may sound eerie, but nothing ever spooked me. Soon after the pause, I woke up.\nI felt so calm. Everything was so captivating and serene. It was a short lived dream. \nI don’t really know any little girls who looked like that in real life. I’m not sure who she was, or what she symbolized. Maybe she was a past life. Maybe she was the embodiment of something about me.—\n\n"}, {"title": "What does Jung say about the origins of pedophilia? (self.Jung)", "likes": "3", "comments": "5", "content": "I can imagine Freud would say repressed sexual desire and/or upbringing. But what would Jung say?\n\n"}, {"title": "Different categories of archetypes (self.Jung)", "likes": "9", "comments": "6", "content": "I have a brief understanding of the archetypes in terms of the different characters (hero, trickster, etc.). I also understand that the self, persona, etc. are also archetypes. What bothers me is that they are both archetypes even though they seem like completely different things. \nI’m not sure if I’m phrasing this question well, but what is in common between them that puts them both under the definition of an archetype?\n\n"}, {"title": "Question for r/JungDifference between the Ego and the Self (self.Jung)", "likes": "2", "comments": "7", "content": "I’m currently reading Man and his symbols and I’m on part written by Joseph Henderson. He says about the archetypes of heroes and initiation. He also says about the ego and self. Maybe it’s a stupid question but I can’t really understand the difference between those two. Could someone explain it to me in simpler words?\n\n"}, {"title": "Question for r/JungHow does the mother-/fathercomplex impact sexuality? (self.Jung)", "likes": "7", "comments": "1", "content": ""}], [{"title": "Is there a book or anything about keeping esoteric things a secret? (self.Jung)", "likes": "2", "comments": "3", "content": ""}, {"title": "What is the antidote to embodying the negative aspects of an archetype? (self.Jung)", "likes": "6", "comments": "6", "content": "Through shadow work I am noticing that I love being how I am. I've found the pleasure in these states of pain, anxiety, sadness, no responsibility, not caring about things etc.\nIt just sort of becomes funny. I sat down to meditate with things in my past that used to bring me great pain. There is still pain there for sure but I just laughed during the meditation. They just feel like things that happened but something is telling me they are not fully resolved.\nThis funny-ness is sort of unsettling. I have seemed to land in a place where all of the things I was working on to 'fix' now feel apart of me. I embody these things. I do not even feel so much that I need to change. If there is bliss and pleasure in every aspect of life then why would I change?\nThe idea of changing for me brings about a greater sense of charity and selflessness - being of service and helping others however I feel an annoyance with this, that I don't really want to help people so much as feel good about giving advice.\nThis sort of troubles me but then I realise I enjoy this feeling. I enjoy putting out an image of myself that doesn't ring completely true with how I am feeling. I feel quite split. I want to help people but also they somewhat annoy me.\nIt's a funny place to be but I feel as though I identify with the jester archetype.\n​\n\nThe Jester uses humour to heal, reveal and hide even the deepest of human traumas.\nThey are not concerned with romance or quests, but instead, with making everything seem lighter, so that reality is not such a heavy load to bear. \n\nOther functions of the Jester:\n\nTo highlight the paradoxes and absurdity of life\nTo use humour to show where hypocrisy has taken hold\nTo close the gap between the powerful and the powerless\nTo smooth out aggression and arguments\nTo banish anxiety and depression\nTo banish fear\n\nThe Jester is present in the now, rather than dwelling on the past or future. It is not goal-oriented, which can be a welcome relief from stress.\nShadow side:\n\nNot healthy - they use humour to avoid looking at the shadow or deepest aspects of life.\nCan belittle others, laugh at their sincerely-held beliefs and feelings. The humour then has an inappropriate and insensitive use, making people feel uncomfortable.\nDrug/alcohol abuse, sex addiction and/or perversion & other extreme forms of lack of self-control.\n\n​\nIt is mainly the humour and destructive habits I am seeing and feeling in myself. I still eat an excess of sugary foods to the point of feeling uncomfortable and then I exercise to burn it off. A complete waste of energy really but I actually love every part of it. There is a secret enjoyment in it otherwise I would not be drawn to this experience over and over.\nIt is my assumption that this is some stage of integration and that more lies ahead.\nCan anyone share any views? Perhaps someone has experienced this before or as the title says, can give me an antidote?\nIt's as though I don't currently want to embody or even look at positive aspects of myself. Perhaps this is now where I need to go with shadow work? Just writing this last part I felt some activation in my heart so maybe this is key.\n\n"}, {"title": "Jungian Literature Inquiry (self.Jung)", "likes": "3", "comments": "5", "content": "I’m fairly unfamiliar with Carl Jung as I’ve only studied brief bits about his philosophies and works in a few of my psychology classes. I’d love to get into his theories, but where should I begin? What books would you recommend I check out?\n\n"}, {"title": "Carl Jung drawings (self.Jung)", "likes": "6", "comments": "2", "content": "Hello,\nLooking at Jung's drawings I can't avoid noticing that he was really good at it. Also pretty good at sculpting. Would be interesting to know how that came about, did he had teachers? Taught himself by taking courses of reading training books? Or just learned by pounding at it?\n\n"}, {"title": "Question for r/JungMeeting Philemon (self.Jung)", "likes": "4", "comments": "2", "content": "I was wondering if anyone has any advice on how to meet my own shadow guide (like Philemon), I understand this is a deeply personal process. Please share any personal experiences of your internal guide if you would be so kind. Thanks!\n\n"}, {"title": "Carl Jung the man? (self.Jung)", "likes": "4", "comments": "8", "content": "Does anyone know a good book / documentary on the earthly life of Jung? Anecdotes, what did he liked / disliked on daily life, stuff like that. I'd imagine that some of his closest collaborators might have tackled this subject at some point.\n\n"}, {"title": "Who are some other psychoanalysts to look into? (self.Jung)", "likes": "4", "comments": "16", "content": "They don't need to be of Jungian thought.\n\n"}, {"title": "Mythology Multiverse: A Non-RP Discord Community for all things Mythology, Jung, and more! (self.Jung)", "likes": "3", "comments": 0, "content": "Mythology Multiverse: A Non-RP Discord Community for all things Mythology!\nLooking for a non-RP Mythology server? Mythology Multiverse is a place of diverse Mythological study, discussion, exploration, and more!\nMythology Multiverse is a casual corner for all things Mythology, Legend, Folklore, Fables, Fairy Tales, Tall Tales, etc. We also discuss esoteric matters, such as Alchemy, Astrology, Paganism, Symbology, Divination, Mysticism, Occultism, and much more!\nA few features we have to offer:\n\nCults (clubs) for all kinds of topics (un)related to the Mythological!\nA few Cults we have to offer:\n- Cult of Seshat (Book Club) - We read/discuss when and what we can, sometimes full novels, sometimes short stories, or other forms of media, from webcomics to movies!\n- Cult of Dionysus (18+) - For the adults in the server!\n- Cult of Fortuna - Storytelling just like our ancestors used to do it! Like an E-Campfire if you will!\n- Cult of Bragi (Music Club) - Where the lovers of music meet to recommend and vote on music!\nWe also actively seek out Content Creators so that we can use the server as a platform for the promotion of their work, and in turn, the further popularisation of Mythology as a whole.\n- If you would like to become a Mythology Multiverse Content Creator, then send me (the owner) a DM once you get into the server and we can sort out the nitty-gritty privately.\nMonthly Themes & Rewards where we focus our attention on a particular Mythology for the month, rewarding those who contribute to this theme the most with all kinds of goodies at the end of that month. This Mays theme is Aztec Mythology!\nMythology Multiverse also offers a wealth of resources, templated, tagged, and summarized for easy searching within Discord itself if you don't want to get lost scrolling. This area is for the students of Mythology, or those just looking for the odd piece of Art, Music, Literature, or Academic Insight related to their favorite Mythos.\n\nI hope to see all you fellow Mythology and Folklore enthusiasts there!\nInvite Below...\nMythology Multiverse: Join Now\n\n"}, {"title": "Anti-psychotics (self.Jung)", "likes": "4", "comments": "23", "content": "I started a trial of anti psychotics last night. My second dose was this morning and I find myself with little wonder.. I am not taking them again.  I feel very misunderstood by psychiatrist's.  My mom is one and she doesn't understand Jung.  I'm wondering if anyone has had experience with antipsychotics and would be willing to share there experience ?\n\n"}, {"title": "Is there any website/PDF to search/ask for an explanation of a dream according to Carl Jung? (self.Jung)", "likes": "2", "comments": "7", "content": "Sometimes i dream weird shit and i would love to know their explanation through Jung's work.\n\n"}, {"title": "Is there anybody who reads Jungians and not Jung? (self.Jung)", "likes": "7", "comments": "8", "content": "Hello guys.\nI have seen that I have been making progress but I am learning through the eyes of the analysts and not Jung himself. I am reading the Jungians which are very approachable in their content and are easy to read. I for some reason can not find myself in a “flow” state when I read Jung.\nAnybody else like me?\n\n"}, {"title": "Jung, Cultural manifestations of archetypes. A bit confused (self.Jung)", "likes": "4", "comments": "7", "content": "I am in my first year of studying Jung and have grown confused on explaining how archetypes manifest within culture, I have read after catastrophe, with the 'European guilt'  and i have also read on the 'american psyche'. I need to blend and understand the concepts overall to be able to write about them. I was also going to explain how muth helps understand the UC and vice versa. \nMany thanks\n\n"}, {"title": "Dream Interpretationterrifying dream (self.Jung)", "likes": "4", "comments": "2", "content": "recently i decided to pay close attention to my dreams and the last one was both terrifying and confusing.\n\nIt starts with a bird, a black raven, in an open space. Suddenly I shrink before this bird and realize that the crumbs it is picking are actually human heads. Much later on, I'm at sea, there is no land in sight. Then I come upon a black bird, but this time something like a swan. As i draw closer to the bird, i notice it has two heads criss-crossed together. This two headed bird just sat calmly above the water, it didn't disturb the waves or charge at me, it just sat there expecting worship and  trepidation.\n\n\n"}, {"title": "What of Freud should I read before Jung? (self.Jung)", "likes": "3", "comments": "9", "content": ""}, {"title": "dream where my anima declares herself lesbian? (self.Jung)", "likes": "3", "comments": "7", "content": "Rather short dream, im at a house party in my own house theres allot of guest chilling around in chairs around me, mostly men a few women aswell. the anima (there is no doubt it was my anima btw, I can identify her rather easily nowadays) walks into the party and starts greeting everyone, she seems to ignore me at first but suddenly she recoqnizes me and gleefully yells out my name, as one would when suddenly seeing an old friend again. We talk for a bit (cant remember about what) and then she stands up, starts flirting with a faceless girl at the party. They kiss and walk outside hand in hand. I feel lost as if all the time I spend with my anima throughout my life and dreams was for nothing, but at the same time I also feel sort of liberated, and jealous. I follow them and realize that outside of the house theres a giant party that stretches on for miles and miles. I can no longer find them, but I do find older versions of the anima, I dance with them very shortly before moving on again. I never find them, lost in the sea of people. I then wake up\n\n"}, {"title": "Question for r/JungHow do I know when my shadow is integrated? (self.Jung)", "likes": "3", "comments": "5", "content": "If I'm not mistaken, I understand that the shadow might not ever be 100% integrated. But how do I know when the shadow is integrated enough to start working on the anima/animus? People say to integrate the shadow before the anima/animus but then they say you can't fully integrate the shadow. I'm rather confused. Is there maybe any Jung books that expand on this idea specifically?\n\n"}, {"title": "Jung on islam (self.Jung)", "likes": "13", "comments": "21", "content": "What do you guys think about islam and it stories. Also about Sufism\nI have read a few things on islam from Jung himself when he visited Tunisia or Egypt. But it is not deep enough and what can u recommend?\n\n"}, {"title": "Mandala-thread. Share your mandala if you want to! (self.Jung)", "likes": "4", "comments": 0, "content": "Personally, after a heavy mushroom trip a few years ago, I started drawing. It happened almost compulsively, I just had to get something on paper because my mind were spinning in all directions. It was a weird experience to see something on paper that I had no intention of making. \nHere are some of mine. Not all mandalas, but part of my journey still. \n1\n2\n3\n4\n5\n6\n7\nDon't be shy, please share <3\n\n"}, {"title": "“Memories, dreams, reflections” for newbie reader (self.Jung)", "likes": "6", "comments": "12", "content": "I have read about 1/7 of this book and it looks to me a little bit boring. Will it get better, or this book is not for me (I am 22y old and started reading books not long time ago and maybe this stuff is too hard for me)? Also I love to read about human psychology and I don’t like religious stuff.\n\n"}, {"title": "Question for r/JungIf \"worthlessness\" is an attribute of my shadow then why would I want to integrate that? (self.Jung)", "likes": "3", "comments": "14", "content": ""}], [{"title": "Why are some of Jung's Collected Works so expensive? (self.Jung)", "likes": "3", "comments": "14", "content": "Both paperback and Kindle editions are extremely expensive on Amazon, and these seem to be the only legal ways to acquire them. What gives? I've been really enjoying Jung's works but why are they so expensive?\n\n"}, {"title": "Personal ExperienceMeaning of the number 33 (self.Jung)", "likes": "1", "comments": "14", "content": "I have a friend who is kinda gifted with instinct and higher-consciousness and she always told me her favorite number was 33 and she would see it everywhere. I didn’t pay it any mind, but I started seeing the significance of this number in a lot of texts. Jesus died at 33, in Islam inhabitants of Heaven are aged 33 and in Divine comedy all 3 parts contain 33 Cantos. I remember Tesla’s quote that went something like “If you want to find the secrets of the universe think of 3,6 and 9”. Do u think this number is significant?\n\n"}, {"title": "What's the difference between a projection and an assumption? (self.Jung)", "likes": "2", "comments": "3", "content": ""}, {"title": "Question for r/JungDora Kalff's Jungian Sand-play Therapy? (self.Jung)", "likes": "7", "comments": "4", "content": "I recently stumbled across Jungian Sand-play therapy and was fascinated by it as a process. \nI was wondering what benefits it gives over other Jungian therapeutic, active imagination, practices and if anyone has any interesting stories about what types of things were revealed to them during the practice not afford by those other practices.\n\n"}, {"title": "Dream InterpretationDreaming with horses and their aura (self.Jung)", "likes": "3", "comments": "6", "content": "Today I dreamed that I saw the aura of some horses. At first, they were pink and yellow. There was someone by my side asking me about the color. Later I noticed a black horse that had a multicolored aura... The person next to me said, what do you see? And I replied: that horse is called Beelzebub. And I don't remember much more, I saw other animals but not their aura... \nDoes anyone know what interpretation it has?\n\n"}, {"title": "CommentI cleaned my room but not because Jordan Peterson told me too. (self.Jung)", "likes": "9", "comments": "31", "content": "I have enjoyed learning about Jungian Philosophy lately, I am new to the subject. However, I can’t for the life of me stomach Dr. Peterson. I do find some of his lectures informative, but I can never get past his media presence. \nIn his stage and classroom lectures he comes off informative and encouraging, like any good teacher would. But anytime he is speaking to the media, he seems like a bully that uses his intellectual speak to belittle people and social movements. \nI am not astounded he has such a following. This is an age where the fringes of society reward hyperbolical speech with steadfast loyalty. But I do fear that following, both joining it and upsetting it. \nI just can’t help wondering, if it’s all an act? If it is not an act, then those are just his opinions and that is fine. If it is an act then there is motivation behind it, and that is troubling to me.\nPlease tell me if I am way off base here or if there is a place for my thoughts. \nI posted this question because as I continue my research I continue to run into Dr. Peterson’s thoughts on this part or that part. And I grappling with what to do with my bias towards his more bombastic views.\nI’m linking an interview that I think show both sides of what I am talking about. The link is not my own content. vice\n\n"}, {"title": "Try this simple exercise with archetypes (self.Jung)", "likes": "4", "comments": "3", "content": "Here’s a great exercise for anyone interested in mythology and archetypes: watch a handful of your favourite movies which involve hero stories and make a list of the traits possessed by the main character as well as the general situations they find themselves in and how they deal with them. Do this for a few movies and then compare notes from each film, I think you will be amazed at how many similarities there are with regards to recurring themes. I can honestly say I have learned a ton about myself and effective ways of acting in the world from this.\n\n"}, {"title": "Jungian child-rearing & child psych literature (self.Jung)", "likes": "4", "comments": "5", "content": "Hello, I am hoping that I can get some recommendations for literature about child rearing, child psychology, child development and/or childhood trauma from the Jungian tradition, preferably that would be accessible to a layperson.  Sorry if this kind of question is disallowed.\nBackground: I am considering adopting a child from the foster care system and I want to familiarize myself with the literature with a first preference given to material that comes from the intellectual milieus that I am most comfortable with.  Thanks!\n\n"}, {"title": "Question for r/JungIs it normal to get easily irritated when I'm in a deep state of being alone with my own thoughts and someone invades my area with their uninvited energy? (self.Jung)", "likes": "6", "comments": "15", "content": "I keep reacting badly when this happens and I'm trying to figure out if there's any thing I can do to channel this annoyed frustrated energy of interrupted alone-time.\nI have a similar personality description as INTP. the reason I look for advice in this thread is cause other threads and subreddits just repeat the same things and feel more superficial.\n\n"}, {"title": "Is Christianity a mystery religion? (self.Jung)", "likes": "2", "comments": "10", "content": ""}, {"title": "Question for r/JungWhat are good examples of characters integrating their shadow in movies? (self.Jung)", "likes": "8", "comments": "11", "content": "I am struggling with the concept of integrating ones shadow, and interested if this is represented anywhere in film?\n​\nalso if anyone has any in sight into how to go about integrating your shadow I'm all ears!\n\n"}, {"title": "Was Jung sexually abused when he was younger? (self.Jung)", "likes": "9", "comments": "9", "content": "Jung apparently disclosed this to Freud in letters. Does anyone have a link to the letters?\nIf anyone has a pdf to the letters or can link the url, I'd be eternally grateful.\n\n"}, {"title": "Personal ExperienceI think I have some form of Messiah complex (self.Jung)", "likes": "3", "comments": "5", "content": "A friend used to say to me that I have super hero complex.\nI invariably find myself imagining that I am preacher of some sort.\nAs if I don't really have any substance, but I want to preach for the sake of preaching.\nWhere should I go from here?\nIt is a strange self deception.\n\n"}], [{"title": "I read in psychology today that a fetish is the opposite of a phobia, both are defense mechanisms but one does it through fear other through pleasure. If a phobia can be integrated than why cant a fetish? (self.Jung)", "likes": "103", "comments": "40", "content": ""}, {"title": "Question for r/JungHow do you know when you encounter the anima/animus? (self.Jung)", "likes": "35", "comments": "15", "content": ""}, {"title": "What happens to one with a mother complex when their actual mother dies? (self.Jung)", "likes": "25", "comments": "14", "content": ""}, {"title": "Has Jung ever discussed about vivid dreams that take place when you're sick/have a fever? (self.Jung)", "likes": "14", "comments": "7", "content": "I think it's interesting that when someone usually has a fever or is ill, they sometimes end up having very vivid dreams that are almost hallucinogenic in nature.\n\n"}, {"title": "Different categories of archetypes (self.Jung)", "likes": "8", "comments": "6", "content": "I have a brief understanding of the archetypes in terms of the different characters (hero, trickster, etc.). I also understand that the self, persona, etc. are also archetypes. What bothers me is that they are both archetypes even though they seem like completely different things. \nI’m not sure if I’m phrasing this question well, but what is in common between them that puts them both under the definition of an archetype?\n\n"}, {"title": "Question for r/JungMy anima is a little girl? (self.Jung)", "likes": "6", "comments": "3", "content": "I few years ago (around 2016-17) I had a dream that I will never forget. I believe that I met my anima in this dream. However, I notice that a lot of people will equate their anima with their soul mate, and have romantic/sexual themes in their dreams with them. I recorded my dream in my notes, which I posted below. Can animas have themes that are are not romantic/sexual in nature? If so, what could they symbolize? \nFROM NOTES: —I was in a place that was my room. It felt like my room but, it looked different. The windows were open and had big thin curtains flowing at the sides. It was light outside and I could hear the breeze and the sound of the leaves tumbling and being crunched outside. It looked like autumn time with all the naked trees and dead leaves everywhere. There were giant red bunnies running arounds and creatures that looked like boars. I remember telling someone (who turned out to be the girl) that they could enter my room through a certain spot in the window. She climbed through. I was sitting on my bed. She came to me and sat in front of me with her legs crossed. It was a little girl. She had pale white skin and blone hair. Her eyes were green with a reddish tint. She wore a thin strapped white under garment. She looked a little dirty, like she had fell in a pile of dead leaves. I said hi, and asked what her name is. When she opened her mouth to respond, the world became silent. I couldn’t hear her response. It was like if the audio were to suddenly cut out from a video. It may sound eerie, but nothing ever spooked me. Soon after the pause, I woke up.\nI felt so calm. Everything was so captivating and serene. It was a short lived dream. \nI don’t really know any little girls who looked like that in real life. I’m not sure who she was, or what she symbolized. Maybe she was a past life. Maybe she was the embodiment of something about me.—\n\n"}, {"title": "Dream InterpretationHave I experienced synchronicity? (self.Jung)", "likes": "4", "comments": "2", "content": "Hello, forgive me if this post gets a little wordy but I want to make sure that I explain everything I need to. For a little bit of background info, I am a 16 year old male, turning 17 in about a week. \nA week ago, I had a dream that I was sitting in my room, which sits at the front of my house. I was looking out of the window, and a firetruck was parked against the curb directly in front of my house. Nothing seemed abnormal in the dream, and I didn't feel especially positive or negative towards the firetruck. I woke up and sort of forgot about the dream, until later in the day when I was in my room around noon. I was sitting in roughly the same spot as I was in the dream, when suddenly a firetruck drove past my house. To give some context, I live on a dead end suburban street, and I haven't seen a firetruck come down it in years. The firetruck drove past my house, went around the col-de-sac, and drove back past my house the other way without slowing down or stopping. Once again, I didn't get any specific feelings from seeing the firetruck, but I was sort of freaked out because my dream more or less predicted the event.\nDoes anyone know the significance of this? As far as I can remember, firetrucks hold no special significance to me, so I don't know what to make of this. Did I experience synchronicity, and if so, what was the meaning? Any thoughts would be appreciated, thanks.\n\n"}, {"title": "Can anxiety be cured? (self.Jung)", "likes": "6", "comments": "8", "content": "Anxiety and the feeling of inferiority caused from childhood be fully cured?\nIt seems like cbt is a very superficial thing which only fixes the present anxiety. Cbt doesn't allow for me to adapt to a new task. Its like whenever I fix one anxious part of my life now the next task makes me anxious.\nThere seems to be a deeply rooted problem of always feeling inferior, most likely due of lack of approval during childhood.\nI heard of inner childhealing and meditating and self acceptance but wtf are these things suppose to do. I have been doing them but it doesn't do anything.\nOnly thing it has helped me on is just simply being aware of my thoughts. Like when working at Starbucks and getting into an argument I feel VERY strong emotional rush and I am more aware of it and I fight it anyways whereas before I would shrink and let the other person win over me.\nYes, sure mindfulness allowed me to be conscious and do it anyways but the anxious feeling is still there....\nI was talking to this friends who is getting phd in psychology and he just mentioned that it can never really be fully gone, also there is a huge genetic component to it, as in you are just ultra sensitive so for one person getting rejected during childhood might not mean nothing while to someone like me it can cause a scar eventually causing social anxiety.\nBasically he said live with it, be happy your not living in Afghanistan.\n\n"}, {"title": "Dream about Anima and Shadow (self.Jung)", "likes": "4", "comments": "1", "content": "I was in a anime like World where I had to fight to come to the top (think of Naruto/DBZ). I had a demon in me, who gave me his power and who made me stronger. I became a gift from a woman which was a ghost, who normaly rejected to connect with people with the demon, but it connected with me this time. The ghost let me transform into a woman when I used it´s powers. \nI´m pretty sure that this dream was about the integration of shadow and anima but I cant figure out more. What do you guys think?\n\n"}, {"title": "Question for r/JungWhat are the symptoms or signs of mother/ father complex? (self.Jung)", "likes": "3", "comments": 0, "content": ""}, {"title": "What does Jung say about the origins of pedophilia? (self.Jung)", "likes": "3", "comments": "5", "content": "I can imagine Freud would say repressed sexual desire and/or upbringing. But what would Jung say?\n\n"}, {"title": "Jungian Literature Inquiry (self.Jung)", "likes": "3", "comments": "5", "content": "I’m fairly unfamiliar with Carl Jung as I’ve only studied brief bits about his philosophies and works in a few of my psychology classes. I’d love to get into his theories, but where should I begin? What books would you recommend I check out?\n\n"}, {"title": "What would Carl Jung say about the Mandela effect? (self.Jung)", "likes": 0, "comments": 0, "content": "How can hundreds of thousands of people possess the same ‘false’ memory? \nIs it an example of the collective unconscious? But if it’s false, how does it arise in the first place?\n\n"}, {"title": "The shadow is the key to physical immortality (self.Jung)", "likes": 0, "comments": 0, "content": "https://medium.com/@richardobyrne/weaponized-culture-and-the-fundamental-nature-of-reality-9467166c4427\n\n"}, {"title": "Memories, Dreams, Reflections - a new analysis of an old dream. (self.Jung)", "likes": "2", "comments": "1", "content": "I recently re-read memories, dreams, and reflections and was struck by Jung's assertion that a person's psyche is not necessarily Christian, or \"Western.\"\nWhen I was a teenager, the night my grandfather passed away, I dreamed of the church where his funeral was held.\nThe church has a large golden cross, hung in skylights.\nI see Jesus hanging on the cross - suddenly the cross darkens and sprouts branches, which in turn bear leaves.\nJesus grows paler, older, his beard grows white and long, a rope appears around his neck, and a spear appears in his side.\nOne of his eyes opens, and gleams White, the church background becomes a dark forest.\nThe new man on the cross speaks, each line with increasing volume and puncutated by an earthshattering \"BANG\"\nI know I hung from that windy tree\nSwung there nine long nights \nWounded by my own blade\nBloodied for ODIN\nMyself an offering to MY-SELF\nI had some prior interest in the Norse Eddas, but had not consciously committed anything to memory - these are the exact stanzas of Odin's account of his initiation by hanging from the world tree.\nI don't know what to think of this dream, in this context, but the memory haunted my reading of the book.\nThoughts? Primarily I think my unconscious may be hinting that to grow closer to my archetypal self, I must in turn become less \"Christian.\"\n\n"}, {"title": "Identifying too closely with the Self? (self.Jung)", "likes": "2", "comments": "6", "content": "This was mentioned in a book by M.L. Franz, but without any details. Anyone in r/Jung knowledgeable so as to be able to detail this over identification?\n\n"}, {"title": "Question for r/JungActive imagination and background noise (self.Jung)", "likes": "2", "comments": "4", "content": "Hello all, hope you're all doing well.\nI've started using active imagination, through the \"hole digging method\" which was mentioned by a fellow Jungian of this sub. I've made three attempts with some amount of success. One thing however that is proving difficult to me, is that once I've relaxed and engaged with my activity, I am bombarded by background noise in my own head. Background noise such as, music in my head, quotes from films, my own intrusive thoughts all seek to dissolve the connection which I'm trying to establish and maintain.\nDoes anyone know of any means of reducing the amount of background noise in your head, so that you may be able to talk to the person in your active imagination?\nThanks as always and stay safe\n\n"}, {"title": "Question for r/JungDifference between the Ego and the Self (self.Jung)", "likes": "2", "comments": "7", "content": "I’m currently reading Man and his symbols and I’m on part written by Joseph Henderson. He says about the archetypes of heroes and initiation. He also says about the ego and self. Maybe it’s a stupid question but I can’t really understand the difference between those two. Could someone explain it to me in simpler words?\n\n"}, {"title": "Is there a book or anything about keeping esoteric things a secret? (self.Jung)", "likes": "2", "comments": "3", "content": ""}, {"title": "Is there any website/PDF to search/ask for an explanation of a dream according to Carl Jung? (self.Jung)", "likes": "2", "comments": "7", "content": "Sometimes i dream weird shit and i would love to know their explanation through Jung's work.\n\n"}], [], [{"title": "I think I just met my Anima (???) (self.Jung)", "likes": "81", "comments": "14", "content": "I just had one of the probably most meaningful experiences of my life and I would love to hear your views on it.\n2 months ago I did a retreat that got me really into my own body and connected with my feelings and emotions. I was like a walking feeling-radar and I felt like I perceived the world through my feeling-body, if that makes sense.\nOne of the things we did a few times was this Osho kundalini meditation where for 15 minutes you let yourself shake and then for the next 15 minutes you dance to music. The first thing I noticed about this when I did it the first time is that it gets me really connected with the presence of my (feeling)body.\nThat dancing in the last few days of the retreat got very physical and visceral. Where in the beginning of the retreat I had still been concerned with how my dancing looked i.e. how beautiful it was as if I were in a club trying to advertise myself, in the last few days I was just dancing and moving on the energy in my body. Fuck looking beautiful. I felt like every move I made, or felt the urge to make, meant something. And I started to have these symbolic visions while dancing. At some point had this vision-feeling of being this great tree that had it's roots into the earth and it was sucking in all this live energy into itself from the earth to then spewing it onto everyone else I was there with, as a kind of 'tree of life' act or desire. At another time I had this vision-feeling of feeling like this great oriental warrior standing strongly in squat pose and I had this tube of nectar in my body that ran from from genital area all the way to my neck and these small people would come to me to get the nectar and I would let them, while remaining very strong.\nAnd I would express those feeling-visions in my dance by the way I held my body and moved. In a sense actually embodying that which I felt as a kind of symbolic vision.\nNow, I had read Jung about a year ago, but nothing like this had ever happened to me, it was quite novel, and the retreat itself in no way made any references to this kind of stuff at all so I wasn't be massaged to get visions or anything. The retreat itself was mostly about getting into contact with your (repressed) feelings and emotions let's say.\nAnyway, this all felt VERY satisfying. As if some hidden aspect of my psyche was being discovered.\nThen at the last time we did this Osho kundalini meditation I was dancing again and suddenly this big cobra appeared in front of me - huge, like 4 meters in height at least - and she had a female face. She was dancing with me. And while we danced with each other, she started bitingly attacking me while I was evading her by moving to the sides while dancing. But it wasn't like she was attacking me to kill. It was like she was attacking me to give me a message. And while I was scared of her and on guard, I was at the same time mesmerized by her and very strongly drawn to her. As if I needed her very deeply. Or needed something from her. I felt even in some sense prepared to let her attack me and kill me if only that meant I would get from her what I - in some sense - desperately wanted. Was it sex? (she moved very sensually). Was it love? Maybe, but a dangerous kind of love. An unsafe kind of love. I did not know exactly what it was but we kept dancing for minutes and then the music stopped and she was gone. Before she was gone I asked her \"what do you want. What are you here to tell me? What are you guarding?\" But no answer.\nThis all felt very meaningful. I felt like I had actually encountered an entity. And the fact that she was female seemed very important. As was the fact that she was a snake, an imposing cobra, to be precise.\nEvery since that retreat she had been in my mind. And about a month later I met her again while doing the same dance to the same music in my living room. And again the same dynamic.\nAfterwards, I realized that I felt very strongly that her femaleness and way of being were archetypically representative of both my mother and my ex girlfriend who I was (am) still in contact with. Needing something from them desperately which they are the guardians of but at the same time always on the watch for the danger, the unpredictableness of the snakebite, of the pain.\nI've since told this (to some people very weird and 'out there') story to some people, a testament that it was still in my mind. But I didn't feel like I had gotten anything out of it except for the opening up to this dimension in myself and being able to have met this being at all. I could not figure out any message or lesson from it (her).\nThen today I had taken a microdose of psylocibin mushrooms (0.2grams. Which means I am not tripping in the slightest, yet I feel somewhat more connected to myself and existence but in such small amounts that you could very easily convince me that it was a placebo if you had administered it to me) and I was sitting with myself, meditating, looking at myself in the mirror and trying to give myself love. While I was focusing on my body to get closer to my felt-sense of being, I felt the urge to get up try to do that via dancing again. So I started moving, quietly without music, and after a few moments there she was, the female cobra. As big and alive as she had always been. And with the realization of her felt representation of my mother and ex girlfriend. I started to feel that this was in a way how I was relating to all women I encounter. That there is something about them that I desperately need or want or desire, but that it always comes paired with danger and guardedness for being bitten.\nAnd then a girl popped into into my head that I had met last week in a workshop. We at some point sat next to each other after not have exchanged any words for 2 days in the group, and I again felt a reluctance to speak with her. So I looked at her, and when she looked at me, I mustered the nerve to say the most honest thing I could at that moment and I asked her \"Is there something going on between us?\" And after having both focused on the energy between us, she agreed, although we could both not pinpoint what it was exactly, although we both agreed that It felt both very good but also a little dangerous. Like a bungee jump would feel. That afternoon we hugged, and we could not let go for what was probably a good 3 minutes. Which is a long time for an actual hug if you think about it.\nI've been chatting with her on whatsapp for the past week and we will meet up next week to explore what the hell this thing between us actually is.\nAnyway, back to the cobra I was just dancing with, feeling that she represented something about how I felt towards all women I encountered. And I realized she might be the negative aspect of my anima.\nAfter that I started to project the 'danger' I had felt with this girl last week as also an aspect of the danger of that cobra. And when I did that, it felt absolutely completely off. Wrong. Inaccurate in every sense.\nHere was this aspect of this human being, this rather beautiful girl, that in no way fit onto the archetype that was standing before me.\nAnd when I realized that (and I am getting goosebumps typing this out). Something happened. The cobra became smaller. Until she had lost everything that was threatening about it. It seemed kind of hilarious to me that this is what I had been afraid off, but at the same time so hopelessly drawn to. A little fucking snake. As if I had to realize or encounter another aspect in this girl that would make me realize that the cobra was not the whole picture... I guess?\nAt this point I decided to turn on the music that I knew so well from the retreat and continue dancing to that.\nMy mind gave me a sort of heads-up in a way that the cobra would change into something different (and this all happened in a manner of seconds) so I was prepared for something to come. But the cobra did not change. It remained. And what appeared in front of me, within a short few moments, was this woman with piercing eyes, like the famous National Geographic fotograph of that child. She looked somewhat middle eastern (I am from the Netherlands) although I could not clearly see her face because it was partly veiled in this beautifully white radiant, almost godly fabric.\nAnd as soon as that face appeared, she receded a ways back, standing next to the cobra, in full body, and I realized; that cobra was her guardian. Her Pet(!), in some sense. And next to this cobra was this absolutely magnificently radiant woman, dressed all in white, mysteriously veiled, with radiant pieces of cloth wavering all about, as if in the wind, with a presence that… Fucking hell…\nI asked myself, but obviously with her knowing (as if anything could ever escape her) \"who are you?\"\nAre you my mother…? No you're not.\nAre you my ex girlfriend…? No, you're not.\nAre you the girl from last week…? No, you're not.\nAnd then a second or two it was quiet, and then the word grandmother appeared.\nAnd I was like, \"grandmother?\" with both of my grandmothers flashing before my eyes: No.\nAre you the grandmother? No. You don't look anything like a grandmother any way.\nAnd then I realized… She was the Grand-Mother. The Grand fucking mother. The omega.\nAnd I went down to my knees and I bowed to her. There was absolutely nothing about myself that I could ever even dream of hiding from her. And there was nothing that she didn't accept in me.\nShe was…. Man… To say she was incredibly beautiful would be like calling the Mona Lisa a cute little drawing.\nI felt absolutely exposed in the most satisfying way possible. And my first instinct was indeed to go on my knees and worship her.\nAnd then she told to \"get up\", in a way that signified that what I was doing in that moment wasn't necessary.\nSo I got up. And as I was standing, the wordless question arose that said as much as \"what am I to do with you? In which box can I place you?\" And the feeling of that question become loaded with examples: should I place you in the 'Mother' box? Should I place you in the 'lover' box?\nAnd as soon as this sense of not knowing what to 'do' with her arose, she knew I had asked it, for again, there was nothing to hide from her, and as soon as I had felt that question burning, she opened her robe and showed me her absolutely, perfect beautiful naked body with her robe with a 1000 cloth pieces wavering in the wind at her back and her body and tits perked out, as an answer to that question. She was fucking powerful beyond belief. And I could have taken her if I wanted to, but only because she would let me, because it would be one of the reasons (but not the reason) I had been created as a man in the first place. And that was all I needed to know. I felt no need to take her. Although I felt a strong need to be in her presence.\nHer body was other-worldy beautiful and desirable, and with her showing of it she answered in an instant the question I had posed.\n\"I am all. I am that which has created you, which nurtures you, which protects you, which gives you strength, which roots for you, and I am that which you can reflect your own manliness into if you so, or when, you desire. I am what you need. And I want you to be what I need.\" - She told me as I was still moving my body to the music in the background.\nMy whole body filled with this enormously satisfying energy, and she told me to finally be a full man in the face of womanhood and the world at large. To be strong, to be manly, to also be gentle, and supple and soft and caring and feminine. To be a man, but even more important to be a human being, in the face of the world, in the face of females in the face of other males. That it would be no use to hide either my masculinity or my femininity for she sees anyway, she knows. And all of this she was telling me from a place of other-worldy support and love to be my absolute self. My absolute real self. That there would be nothing more manly, more humanly to do than that, to show my strength and my weakness. And with the incredible wisdom and fiercety and love and support with which she said it, I knew I was in the right hands to actually be that person. To be in the right hands for the first time in my life.\nAs I am typing this I have been crying on and off, and I still feel her presence with me, she is here with me. As a new example of all that is feminine and wants to draw out the masculine (the true masculine) at the same time. And… I am home…\nAnd even now, I feel her. She doesn't want me to do anything. Not worship her, not show my attractiveness or manliness to her. She wants nothing except for me to be as I was intended to be.\nThis radiant white clothed being that you do not want to fuck with but has absolute support in every aspect of me being human.\nGod I hope she'll remains here…\nEDIT: Jezus christ... 10 minutes after writing this my mother who I haven't seen in about a year and haven't spoken to in a few months sends me a message...\n​\nEDIT2: Grammar and typos.\n\n"}, {"title": "interpreting my own poems using intellectual and spiritual approach (self.Jung)", "likes": "6", "comments": 0, "content": "This is very long. it’s literally me reporting myself while spacing out to a childhood trauma (which I didn’t know is a trauma) during writing this post\nI know how some may say you gotta do these things spirituality, but I think the intellectual approach is really helping me, alongside with the spiritual approach. \nYou know, in Iran, some of our historic poets insist on using both your “Heart” and your “Mind”. There were some who believed the “Heart” way was the only way and they were some who were only pro “Mind”. Some would say the heart sees what the mind understands and vice versa. But some insisted that guys, guys, you are all right, you have to use both “Heart” and “Mind”. \nSo I guess now during my self-therapy, I’m heeding their guideline. I do intellectual research with 15 minute meditations. Then I write to record valuable information about my unconscious for my future self. Cause I may not understand their meaning yet, but I know she will. Cause the mind is slower than the heart. \nThese days I’m finding answers in the works of art my past self has stored for me without knowing what valuable thing she’s doing for me (or maybe she does?)\nEver-since I learned writing, I started to write. \n7-12: Childish stories about animals and stuff. \n12-19: very disturbing long and short and edgy stories + tons of diary notes which mostly consists of poetic texts describing the way my thoughts hurt me!\n19–23: lots of love and depression poems + again poetic texts nagging about my mood and my thoughts + a very detailed diary of half of 19 + most of 22 \n24: which is now. \nI’m currently going through all these “memoirs” I like to call them, trying to find clues to interpret what my subconscious shows me. So I guess interpreting my own “art” while reading about psychology, is my intellectual approach and clues I get from my subconscious is my spiritual approach. \nFor example, I keep seeing scary eyes in my meditations. I find that 4 years ago I’ve written a poem about eyes:\n(An awkward english translation of my persian poem:\nI don’t know how not to see ‘the eyes’\nAnd worse than that,\nI don’t know how to close my eyes.\nOnly hate, \nand those escaping pupils, which are flowing in their prison.)\nJust translating this made me shake and goosebumps! This is how my subconscious lets me know I’ve found something that hints to her problem. \nImagine a 4 year old kid talking to a teenage metalhead, telling her to tell me this: Elham (my sister) makes me see her scary eyes cause I can’t close my eyes and just go to sleep. (I hear the sound of my mom telling me to just close your eyes). But what I’m doing (disturbing my family’s sleep) is worse than what my sister is doing (scaring me cause mom told her). So I hate myself, and then my pupils start getting dizzy (maybe caused by a trance to escape the fear) and I go to sleep.\nMy teenage me coded this in a poem and sent it to me. Word by word. While hinting to her own need to escape. \nI was a scared child, i guess that’s what the gift of imagination brings for your childhood.\nI was scared of every corner cause my mind would show me black shadows with scary eyes. It still shows me this image when I turn off the lights.\nMy family found this weakness/strength (fear/imagination) and used it against me,\nMy mom would tell me I have to sleep, otherwise the “Yesar2goush” would eat me up. \nMy sister had big beautiful black eyes with a long unibrow, She would cover her face with a blanket and show me scary eyes, playing the part of “Yesar2goush”.\nIt was their tactic for making me go to sleep.\nAs an adult, I struggle with sleeping too much and I constantly blame myself for it which results in a constant self-hate and guilt trip. Some days I even sleep for for more than 17 hours. My average is 12 hours.\nIt’s like two feelings and one external factor are tied in my subconscious: fear, guilt and sleep.\nfeel guilty about not being able to sleep fast while getting scared by your mom and your sister, go to sleep to “escape” the fear and stop the guilt.\nIt happens vice versa in adulthood.\nI get scared of the tasks of life, I sleep to escape the fear, I feel guilty about sleeping too much. \nNo wondering I dream so much of escaping. \nI also have lots of poems with the concept of escaping. During my teen years, I had written “I want an escape” in almost all my poetic texts and during my 23 I wrote this piece about how there is no hope for an escape and no energy to escape.\nMy whole life I’ve been doing what they did to me during childhood. \nAnd there...\nNow I know what to search for in my next meditation.\nEdit: I read some chapters of a long story I wrote when I was 12. The eye analogies are numerous in that story but I was shocked by its title the most: A sister from Hell. I was surprised to find that the hellish sister in the story wasn’t a symbol of my own sister, it was a depiction of my adhd traits.\nAlso I remembered how my mom would play “the guardian” while telling my sister to bring Yesar2goosh.\nEdit 2: I just realised that just a few weeks ago, i suddenly updated my instagram bio to “One is sleeping out of fear and the other is being kept awake by her dreams”.  I didn’t think of it much then, but it makes so much sense now.\n\n"}, {"title": "My Opinion on the Replication Crisis (self.Jung)", "likes": "13", "comments": "20", "content": "If I must be honest, I believe that the replication crisis is inevitable and I will explain why. I don't think this crisis came about by not having more rigorous research methods, not designing the research study well enough, not avoiding all available confounds, etc. ... Maybe p-hacking caused some of the damage. \nThe replication crisis occurred because humans aren't going to be consistent or the same over time. We are dynamic, we change constantly. Culture evolves faster than our biology. We create new systems of meaning and let go of old ones. We encounter new life experiences that change us. We experience traumatic events that cause us to reevaluate our place in the world. We develop new dances, new interests, new behaviors, new values, and new beliefs. \nIf we were to travel 2,000 years back in time with all the up-to-date research we have in psychology, we would realize that the majority of our studies would fail to replicate. And we'll realize that the way people understand, precieve, and find meaning in the world will be a lot different than it is now. Yes there may have been some behaviors that may be consistent, but everyone's collective cognitions will be vastly different from the ones we have today. A time when people believed in magic, curses, lived their life based on symbolic ideas of meaning. There isn't any way that our studies would replicate. \nFast forward 1,000 years into the future, the world and all cultures will be so vastly different that our present studies will be considered outdated and not useful. In that time span, so many things can happen in the world such as another world war, famine, space travel, etc. that it will greatly impact the way people understand, precieve, and behave in the world or the universe. The only way to study this change in behavior would be through phenomenological research, which I know carries its own problems and receives much hate from the psychology community as \"not scientific.\" \nBut this post wasn't meant to bash anyone or devalue anyone's research. It wasn't meant to make the argument that psychology is not a science. In fact we are a science and we are a hard one at that but we keep trying to follow the footsteps of the other reputable sciences instead of formulating a different way to study psychology.\nWhat I think is awesome about all the research that we've done now is that it gives us a clue on how our psyche worked during our time period. We archive all this information that people will read years from now. It gives them a sneak peek about how our brain functioned during our time period. \nWe are recording and documenting psychic phenomenon in real time as it happens and creating a history of the evolution of human conciousness that will be so useful for those in the future.\nThat is so damn cool to think about! And I want to say that you guys are awesome and doing a good job! So don't let the idea of a Replication Crisis frustrate you when it seems like it's meant to happen due to dynamical changes in the human species.\nEdit: I made this post under r/Jung because r/AcademicPsychology keeps rejecting my post. I've always been a fan Jung and the subreddit so I thought you guys would appreciate it a little more anyways.\n\n"}, {"title": "Jungian podcasts (self.Jung)", "likes": "48", "comments": "10", "content": "A few Jungian podcasts I thought the community would enjoy.  \nFirst, Alaln Mulhern's The Quest is excellent.  The most recent episode is about the last days of Jung's life, it is incredible, but I suggest going to the beginning of the Jung series.  The first episodes of the podcast are an overview of Jungian worldview and therapy. The second series is a study of great thinkers taht illustrate the psychic conflicts of our time, episodes include deep meditations on thinkers as diverse as Richard Dawkings, Teilhard de Chardin, and Jung himself.  The ultimate aim of this series is to achieve some kind of synthesis of these divergent ideas, in a way that will bring a measure of psychic healing and  evolution to the modern world.   Mulhern is a fully trained, practicing Jungian analyst.\nSpeaking of Jung is an interview series with Jungian analysts, it is absolutely excellent.  \nShrink Rap Radio is a weekly interview with authors in all areas of psychology, but the host takes a strong interest in Jung.  Linked episode is highly Jungian, there are many.  \nFinally, I think Living Thelema fits under the rubric of Jungian podcasts, as the author is a clinical psychologist who works in Jungian models (not a graduate of one of the Jung institutes)  Thelema is a branch of Ceremonial Magic, in the Hermetic tradition of the alchemists Jung studied.  It gets quite deep into kabbalistic jargon and practice, but the core message and practice are entirely compatible with Jung's vision.  I've linked to an episode on the Holy Guardian Angel.  I chose this episode because it maps directly to Jung's concept of the Self, and also because it is in some ways a better explanation.  Upon first reading, one can think of the Self as \"a better version of me if I cleaned up my room and hit the gym more often\", but from the ego's perspective it is really closer to an angel.\nAll are available through podcatchers, I've linked to youtube versions of some because they're easy to access on any platform.  If anyone knows about others, I hope you'll post them.\n\n"}, {"title": "Free PDF of The Complete Collected Works of C.G. Jung (self.Jung)", "likes": "93", "comments": "21", "content": "​\nhttp://library1.org/_ads/4B4EF4C3C9F169F269A5C9CA37200E57\nEdit: I clicked the \"GET\" button at the top and it downloaded instantly for me with no problem without signing up. I'm not sure how the other links work, but they're probably paid or make you sign up.\n\n"}, {"title": "\"As a plant produces its flower, so the psyche creates its symbols.\" (self.Jung)", "likes": "53", "comments": "4", "content": "I've been re-reading Man and his Symbols and thought I'd share this striking analogy Jung makes between plants and the unconscious psyche.\n\nWe should understand that dream symbols are for the most part manifestations of a psyche that is beyond the control of the conscious mind. Meaning and purposefulness are not the prerogatives of the mind; they operate in the whole of living nature. There is no difference in principle between organic and psychic growth. As a plant produces its flower, so the psyche creates its symbols.\n\n​\nJust beautiful.\n​\n\n"}], []]}