{"data": [[{"title": "Random Thoughts, Small Questions, and Newbie Help — May 03–May 16 (self.ZeroWaste)", "likes": "3", "comments": 0, "content": "This is the place to comment with any zerowaste-related random thoughts, small questions, or anything else that you don't think warrants a post of its own!\nAre you new to zerowaste? You can check out our wiki for FAQs and other resources on getting started. Don't hesitate ask any questions you may have here and we'll do our best to help you out. Please include your approximate location to help us better help you! If your question doesn't get a response after a while, feel free to submit your question as its own post.\nThink we could change or improve something? Send the mod team a message and we'll see what we can do!\n\n"}, {"title": "Rants, Fails, and Bummers — May 03–May 16 (self.ZeroWaste)", "likes": "3", "comments": 0, "content": "Things don't always go as planned. Sometimes, the barista uses a disposable cup to fill your tumbler, the cashier throws away a bag you didn't want, or the restaurant serves you a straw despite you having asked not to have one. If you need to rant, this is the place to do it! You can also share pictures of waste, stories of wastefulness you witnessed in the real world, or vent about unsupportive friends and family.\nThink we could change or improve something? Send the mod team a message and we'll see what we can do!\n\n"}, {"title": "ProgressA comparison of my monthly household waste to my countries average and US average (self.ZeroWaste)", "likes": "7", "comments": "2", "content": "After I posted about weighing my waste for the last four months and being quite discouraged because you all saw lots of room for improvement, which is definitely there, I tried to put my waste in perspective to cheer myself up again!\nI thought you might be interested in what I found\nEdit: fixed a mistake in my graph\n\n"}, {"title": "Any suggestions for decreasing waste while moving and furnishing a new place? (self.ZeroWaste)", "likes": "3", "comments": "4", "content": "My boyfriend and I are moving from Southern California to Seattle soon and are looking for ways to get more sustainable housewares and furniture.  Buying used is already on our minds, but for things that we’re not finding used it’d be nice to know of some sustainable companies to support.  Thanks!\n\n"}, {"title": "What's an alternative to freezer bags? (self.ZeroWaste)", "likes": "5", "comments": "3", "content": "Hey,\nNewbie here.\nI bulk buy and freeze (butcher meat, veg etc).\nWe use loads of frreset bags. Don't want the silicone ones for raw meat.\nAny ideas?\n\n"}], [{"title": "I urge EVERYONE to watch the documentary planet of the humans (self.ZeroWaste)", "likes": "12", "comments": "2", "content": "Truly an unseen viewpoint on global political and capitalist links to environmentalism.\n\n"}, {"title": "I am having trouble finding glass roll-on deodorant and dryer satchels. (self.ZeroWaste)", "likes": "2", "comments": "1", "content": "It seems like those that use roll-on is in plastic. Does any brand exist? \nAs for the dryer satchels... I know Trader Joes sells them but its a lavender scent and the packaging is in plastic. Does anyone sell an alternative scent and packaging?\n\n"}, {"title": "Is buying a sewing machine worth it? (self.ZeroWaste)", "likes": "5", "comments": "6", "content": "Hi, just wondering about this, since I am in isolation and quite bored. \nI have a small pile of thrifted treasures that I would normally bring to the tailor in my town, to get them fitted to my size. While everything being closed because of Covid I started thinking about doing it myself. \nI think about this at least once every month, when we have left over fabric from curtains, clothes, anything. \nI liked sewing with the machine until I was 13 years old, I kind of learnt it from my mother. But I am ofcourse not half as good as the tailor. \nDo you think it is worth it having your sewing machine?\n\n"}, {"title": "Suggestions for zero waste shampoo bar? (self.ZeroWaste)", "likes": "4", "comments": "8", "content": "I have a lot of hair and it’s long. I’ve tried a couple bars and have had issues with grease or residue. Send me your favorite shampoo bars! I can’t live with buying single use plastic for shampoo/conditioner anymore.\n\n"}, {"title": "Many people who are getting into the Zero Waste movement are completely unaware of how much micro-plastics are in items people are calling Zero Waste. Like Polyester reusable produce bags. Polyester, Nylon, Acrylic- all plastic. (self.ZeroWaste)", "likes": "101", "comments": "19", "content": "More than ever, our clothes are made of plastic. Just washing them can pollute the oceans. How much plastic is your washing machine sending out to sea?\nMost of the plastic products we use end up in the ocean, but how much of it are you unaware of? One major source of pollution is in clothes and some businesses that are now selling reusable mesh produce bags under the name “Zero Waste” online are made of micro-plastics. \nPolyester, nylon, acrylic and other synthetic fibers — all of which are forms of plastic — are now about 60 percent of the material that makes up our clothes worldwide. Synthetic plastic fibers are cheap and extremely versatile, they provide stretch breathability, warmth and sturdiness in winter clothes all fibers contribute to ocean plastic pollution in a subtle but pervasive way: \nThe fabrics they make, along with synthetic/natural blends leach into the environment just by being washed. Estimates vary, but it’s possible that a single load of laundry could release hundreds of thousands of fibers from our clothes into the water supply.\nAnd these tiny fibers — less than 5 millimeters in length, with diameters measured in micrometers (one-thousandth of a millimeter) — can eventually reach the ocean. There, they’re adding to the microplastic pollution that’s accumulating in the food chain and being ingested by all sorts of marine wildlife, and even us. Most of the plastic that’s in the ocean, in terms of number of pieces, is not in the form of whole products like cups or straws, but instead broken-down shreds of plastic.\n“Think about how many people are washing their clothes on a daily basis, and how many clothes we all have,” says Imogen Napper, a marine scientist at the University of Plymouth who co-authored a 2016 study on the plastic fibers that shed from our clothing. “Even when we’re walking around, not washing our clothes, tiny fibers are falling off. It’s everywhere.”\nWorldwide, there are now vigorous efforts to reduce the use of some of the products that end up in the oceans, like plastic cups and shopping bags. (Perhaps you’ve heard of plastic straw bans.) As we seek solutions to the overall issue of plastic pollution, we need to recognize that our clothing is a major part of the problem and will need to be part of the solution as well.\nMuch of the microplastic problem is a plastic clothing problem\nConsider the lint you collect in the dryer. That lint is tiny bits of thread from your clothing that have become dislodged and are caught by a mesh screen.\nSimilarly, synthetic fibers come off in the wash — but they’re so small, and there’s no filter inside the machines to catch them. Instead, these tiny plastic fibers pass through to sewage treatment plants, which often don’t have filters fine enough to catch them. (And if they do, the fibers may end up in another sewage byproduct: fertilizer.) Treated wastewater is then often dumped into rivers or the sea, carrying plastic clothing fibers with it, as a 2011 study found.\nIn 2016, Napper and a colleague designed a test to see how many of these fibers could be shed in the wash. They fitted a Whirlpool front-loading washing machine with a special filter to collect tiny fibers. They tested swatches of three types of fabric: a polyester-cotton blend T-shirt, a polyester hoodie, and an acrylic sweater. After a few washes (all garments shed more when they are brand new), the acrylic fabric shed the most, followed by the polyester, and then the poly-cotton blend.\nChristina Animashaun/Vox\n“We found that in a typical wash, 700,000 fibers could come off,” Napper said. Other studies have come up with different estimates. One 2011 paper found 1,900 fibers could be released from a single synthetic garment in a wash; another effort estimated 1 million fibers could be released from washing polyester fleece.\nIt’s hard to pin down the exact amount of plastic pollution per load because there are so many variables that may contribute to fibers shedding or not: garment construction, materials used, water temperature, detergent type, fabric softener, how full the machine is, etc. One study found that top-loading washing machines releases seven times the microfibers as front loaders.\nSee full article, by Brian Resnick \nfrom VoxMedia\nHow Much Plastic in Your Clothes are you Washing out to Sea?\n\n"}, {"title": "Anyone know any good tealight alternatives? I've looked at the refillable oil ones but they apparently have a huge flame which makes me nervous (self.ZeroWaste)", "likes": "3", "comments": "1", "content": ""}, {"title": "How often do you take out your trash? (self.ZeroWaste)", "likes": "1", "comments": "5", "content": "Just curious! All of our trash eventually gets put in our kitchen trash can and we change that about once a week. This past week was the time to go through old makeup, prescription, medicines, etc that were expired and and that contributed to my trash. Additionally, we got a cat so that contributes as well. Obviously we want to “take the trash out” as little as possible. It’s just me and my husband and our apartment complex doesn’t do recycling. When I lived back home, with 4 people, we took the trash out almost daily. So it’s definitely an improvement!\n\n"}, {"title": "5 Easy Beginner Tips to Go Zero Waste (self.ZeroWaste)", "likes": "2", "comments": 0, "content": "Hey, guys!\nI just wanted to start out my introducing a couple easy ways a lot of people can get started with reducing their waste. Next week I plan to talk about my kitchen essentials and a little bit about the food I eat! If you're interested in more ways to save the planet, please check out my channel!\nThank you guys for all your feedback and support! <3\nhttps://www.youtube.com/watch?v=Qll1AV9Wn_k\n\n"}, {"title": "Product RecommendationAny zero-waste toothpaste tablets with fluoride? (self.ZeroWaste)", "likes": "7", "comments": "6", "content": "Hi! I’ve been looking for toothpaste tablets that are zero-waste (ideally glass or compostable packaging) with fluoride, but I’m having a very hard time finding any? \nCan anybody point me in the right direction?\n\n"}, {"title": "Request - Write-able plastic tag (self.ZeroWaste)", "likes": "2", "comments": "5", "content": "Looking for something that can be re-used to be a durable plastic tag that you can write on\n\n"}, {"title": "Spilled a large refill liquid soap container on the floor (self.ZeroWaste)", "likes": "4", "comments": "3", "content": "I managed to use a dustpan to get almost all the spilled soap into a clean bucket. Any way I can use it instead of throwing it away?\n\n"}], [{"title": "Toiletry use up brigade (self.ZeroWaste)", "likes": "6", "comments": "7", "content": "Hi.\nI've been practicing zero waste for a year. I haven't bought any toiletries beyond shampoo and soap bars and toothpaste tablets cause low maintenance yo.\nWhat on earth do I do with all this moisturiser and conditioner?! I thought it would get used up eventually but it's still here and I want it gone but I don't want to waste it. 🤣🤣🤣\nI also have some hair putty that I bought when I first cut my hair short 3 years ago and realised I never use. It's all open so I can't give it away right?\n\n"}, {"title": "ResearchSince this is a topic that comes up frequently and that has come up twice today already, I decided to to some research on which type of bottle is best! Here is a graph, you will be able to see a translation when you open the imgur link. (self.ZeroWaste)", "likes": "21", "comments": "10", "content": "The data is specific to Austria and it's recycling system and transport distances but i think it can give you an idea about the environmental impact even if you live in a different country.\nThe only thing that will be very incorrect is the tetrapak since it seems that most countries don't recycle it! In Austria we recycle all three bottle options: tetrapaks, PET and glass.\nLink to the graph\n\n"}, {"title": "Replacing a zipper on a Nike coat? (self.ZeroWaste)", "likes": "2", "comments": "8", "content": "My dog chewed up the zipper on a coat I really like. I’ve looked online for a way to replace it but I’ve read that any seamster(seamstress?) would charge more than a new coat would be. Any ideas on what to do?\n\n"}, {"title": "Increase in plastic packaging due to increase in food deliveries and online shopping articles (self.ZeroWaste)", "likes": "9", "comments": "5", "content": "Hi lovely people! Has anyone come across any articles discussing the potential problems that have come with the increase in food deliveries and online shopping occurring as a result of the virus situation? Would love to have a read!\n\n"}, {"title": "Is glass actually better? (self.ZeroWaste)", "likes": "12", "comments": "21", "content": "I am pretty new to zero waste and try to at least buy plastic free when possible. I live in the south where there are VERY few recycling programs. You have to go out of your way to recycle anything IMO. I recently found out that glass is pretty much just not recycled in my state. \nIf a product is available in a paper packaging, then I buy that. If it’s only available in plastic or glass, then I feel like the “zero-waste” decision is supposed to be glass. If I can’t recycle the glass though, is it actually even better to get for me?\nI know that I could reuse the glass containers, but I am moving 3 times a year for the next 2-3 years so I keep minimal belongings.\nI am assuming other people in rural areas have this issue of not being able to recycle glass, so I guess I don’t understand why glass is seen as so much of a better option (unless you’re prepared to reuse all of the glass containers you end up buying).\n\n"}, {"title": "Low/Zero Waste online tea companies (self.ZeroWaste)", "likes": "6", "comments": "5", "content": "I don’t have access to bulk right now, so I’m wondering if you guys know of any good on loose leaf tea companies that ship plastic free/low waste.\n\n"}, {"title": "Use for fabric scraps: bean bag chair filler (self.ZeroWaste)", "likes": "5", "comments": 0, "content": "I like to do crafts and sewing but I always feel bad about the little scraps left behind. Even the ones that are obviously too tiny to make anything with.\nWe got to bean bag chair a long time ago. eventually it loses its fluffiness and you have to get more filler for it. The filler is horrible little pieces of foam to make a huge mess. Anyway, I figured out that fabric scraps make a great a solution for this! \nI just save tiny scraps in a little bag and then once in awhile unzip the bean bag and stick it in.\nAnd I know bean bag chairs are not everybody's style. They definitely have a college dorm feel. But they're actually my favorite reading chairs.\n\n"}, {"title": "Interviews with Ethical Companies (self.ZeroWaste)", "likes": "5", "comments": 0, "content": "I have been having interviews with the founders of ethical companies like Cut Le Crap, to get to know the people behind companies and vision of the products. Would love to know what you think:\nhttps://www.youtube.com/watch?v=-2d3GAJ2PVQ \n(This video was filmed outside, so there is some background noise. Also this was recorded in May 2019, long before the pandemic.)   \nMy website:  https://greenhaus.eco/\nCut Le Crap: https://cutlecrap.com/\n\n"}, {"title": "Composting....weed? (self.ZeroWaste)", "likes": "2", "comments": "4", "content": "So if this is not allowed then please delete, I apologise but I have an question I haven't seen answered. \nSo I have a compost bin, and to that bin I add stems from cannabis flower instead of tossing them. with that being said, I consume cannabis by using a \"water pipe\" or a regular pipe. Can I add the ash/ dirty bong water into my compost bin? I hate to waste the water because I clean it rather regularly.\n\n"}, {"title": "Glass Wine and Liquor Bottles?! (self.ZeroWaste)", "likes": "4", "comments": "7", "content": "Hi! I have a ton of glass wine and liquor bottles. I have no idea what to do with them all. I have been saving them for a long time. I would like to make good use of them, but I’m afraid it’s stressing me out trying to think of what I could do with them all. \nAny advice?!\n\n"}, {"title": "QuestionWhat's a way I can reuse my pill bottles? (self.ZeroWaste)", "likes": "6", "comments": "12", "content": "I take a few medications and have lots of empty pill bottles. I can't reuse them at the pharmacy. Any ideas for other ways I could reuse them other than to hold marijuana? Thanks\n\n"}], [{"title": "I urge EVERYONE to watch the documentary planet of the humans (self.ZeroWaste)", "likes": "12", "comments": "2", "content": "Truly an unseen viewpoint on global political and capitalist links to environmentalism.\n\n"}, {"title": "ProgressA comparison of my monthly household waste to my countries average and US average (self.ZeroWaste)", "likes": "6", "comments": "2", "content": "After I posted about weighing my waste for the last four months and being quite discouraged because you all saw lots of room for improvement, which is definitely there, I tried to put my waste in perspective to cheer myself up again!\nI thought you might be interested in what I found\nEdit: fixed a mistake in my graph\n\n"}, {"title": "Product RecommendationAny zero-waste toothpaste tablets with fluoride? (self.ZeroWaste)", "likes": "7", "comments": "6", "content": "Hi! I’ve been looking for toothpaste tablets that are zero-waste (ideally glass or compostable packaging) with fluoride, but I’m having a very hard time finding any? \nCan anybody point me in the right direction?\n\n"}, {"title": "Is buying a sewing machine worth it? (self.ZeroWaste)", "likes": "5", "comments": "6", "content": "Hi, just wondering about this, since I am in isolation and quite bored. \nI have a small pile of thrifted treasures that I would normally bring to the tailor in my town, to get them fitted to my size. While everything being closed because of Covid I started thinking about doing it myself. \nI think about this at least once every month, when we have left over fabric from curtains, clothes, anything. \nI liked sewing with the machine until I was 13 years old, I kind of learnt it from my mother. But I am ofcourse not half as good as the tailor. \nDo you think it is worth it having your sewing machine?\n\n"}, {"title": "What's an alternative to freezer bags? (self.ZeroWaste)", "likes": "5", "comments": "3", "content": "Hey,\nNewbie here.\nI bulk buy and freeze (butcher meat, veg etc).\nWe use loads of frreset bags. Don't want the silicone ones for raw meat.\nAny ideas?\n\n"}], [{"title": "Suggestions for zero waste shampoo bar? (self.ZeroWaste)", "likes": "4", "comments": "8", "content": "I have a lot of hair and it’s long. I’ve tried a couple bars and have had issues with grease or residue. Send me your favorite shampoo bars! I can’t live with buying single use plastic for shampoo/conditioner anymore.\n\n"}, {"title": "Spilled a large refill liquid soap container on the floor (self.ZeroWaste)", "likes": "4", "comments": "3", "content": "I managed to use a dustpan to get almost all the spilled soap into a clean bucket. Any way I can use it instead of throwing it away?\n\n"}, {"title": "Any suggestions for decreasing waste while moving and furnishing a new place? (self.ZeroWaste)", "likes": "3", "comments": "4", "content": "My boyfriend and I are moving from Southern California to Seattle soon and are looking for ways to get more sustainable housewares and furniture.  Buying used is already on our minds, but for things that we’re not finding used it’d be nice to know of some sustainable companies to support.  Thanks!\n\n"}, {"title": "Anyone know any good tealight alternatives? I've looked at the refillable oil ones but they apparently have a huge flame which makes me nervous (self.ZeroWaste)", "likes": "3", "comments": "1", "content": ""}, {"title": "Random Thoughts, Small Questions, and Newbie Help — May 03–May 16 (self.ZeroWaste)", "likes": "3", "comments": 0, "content": "This is the place to comment with any zerowaste-related random thoughts, small questions, or anything else that you don't think warrants a post of its own!\nAre you new to zerowaste? You can check out our wiki for FAQs and other resources on getting started. Don't hesitate ask any questions you may have here and we'll do our best to help you out. Please include your approximate location to help us better help you! If your question doesn't get a response after a while, feel free to submit your question as its own post.\nThink we could change or improve something? Send the mod team a message and we'll see what we can do!\n\n"}, {"title": "Rants, Fails, and Bummers — May 03–May 16 (self.ZeroWaste)", "likes": "3", "comments": 0, "content": "Things don't always go as planned. Sometimes, the barista uses a disposable cup to fill your tumbler, the cashier throws away a bag you didn't want, or the restaurant serves you a straw despite you having asked not to have one. If you need to rant, this is the place to do it! You can also share pictures of waste, stories of wastefulness you witnessed in the real world, or vent about unsupportive friends and family.\nThink we could change or improve something? Send the mod team a message and we'll see what we can do!\n\n"}, {"title": "I am having trouble finding glass roll-on deodorant and dryer satchels. (self.ZeroWaste)", "likes": "2", "comments": "1", "content": "It seems like those that use roll-on is in plastic. Does any brand exist? \nAs for the dryer satchels... I know Trader Joes sells them but its a lavender scent and the packaging is in plastic. Does anyone sell an alternative scent and packaging?\n\n"}, {"title": "5 Easy Beginner Tips to Go Zero Waste (self.ZeroWaste)", "likes": "2", "comments": 0, "content": "Hey, guys!\nI just wanted to start out my introducing a couple easy ways a lot of people can get started with reducing their waste. Next week I plan to talk about my kitchen essentials and a little bit about the food I eat! If you're interested in more ways to save the planet, please check out my channel!\nThank you guys for all your feedback and support! <3\nhttps://www.youtube.com/watch?v=Qll1AV9Wn_k\n\n"}, {"title": "Request - Write-able plastic tag (self.ZeroWaste)", "likes": "2", "comments": "5", "content": "Looking for something that can be re-used to be a durable plastic tag that you can write on\n\n"}, {"title": "Replacing a zipper on a Nike coat? (self.ZeroWaste)", "likes": "2", "comments": "8", "content": "My dog chewed up the zipper on a coat I really like. I’ve looked online for a way to replace it but I’ve read that any seamster(seamstress?) would charge more than a new coat would be. Any ideas on what to do?\n\n"}, {"title": "How often do you take out your trash? (self.ZeroWaste)", "likes": "1", "comments": "5", "content": "Just curious! All of our trash eventually gets put in our kitchen trash can and we change that about once a week. This past week was the time to go through old makeup, prescription, medicines, etc that were expired and and that contributed to my trash. Additionally, we got a cat so that contributes as well. Obviously we want to “take the trash out” as little as possible. It’s just me and my husband and our apartment complex doesn’t do recycling. When I lived back home, with 4 people, we took the trash out almost daily. So it’s definitely an improvement!\n\n"}], [{"title": "\"100 companies are responsible for 71% of global emissions\" rant (self.ZeroWaste)", "likes": "872", "comments": "53", "content": "I see this statistic floating around the internet from time to time, and people always use it as a way to discredit the effectiveness of individual action. It's so frustrating, because all they're doing is grossly misinterpreting a statistic. The 71% includes the USAGE of the fossil fuels, meaning it accounts for the emissions from driving a car, flying on a plane, making a plastic bag, etc. In fact, if they removed the consumer impact and only took into account the emissions companies are directly responsible for (i.e. those released during the manufacturing process), the 71% would be reduced to just 7%. Not to mention that these companies only exist because we as consumers demand their services. Richard Heede (the man behind the statistic) even said that individual action plays a role in fighting climate change! \nIndividual action should be done alongside government legislation, corporate change, etc, but that should not be conflated with the idea that individual action does nothing. In fact, I've noticed that government legislation can worsen the problem if consumers don't change as well. Just look at the latest plastic bag ban. Reusable bags are only better if they are actually being used long enough to offset their initial footprint, but people were just going out and buying like 30 of them that they would forget to use! It's estimated that in San Francisco, the footprint actually grew because people weren't using them long enough to justify their use. Not to mention, we just replaced plastic bags with paper bags, which are just as bad (paper has a greater initial footprint and releases methane in landfills).\nThe issue is that our fundamental habits of consumerism have not changed. We are doing the same thing that we did with plastic to other materials, which is treating something that should be reused as disposable. Plastic in of itself is not a bad material, but we should not be using it in the amounts that we are, and it certainly should not be considered disposable when it lasts for like 500 years. instead of trying to buy our way to sustainability, we need to buy less and buy meaningfully (i.e. not buying an excessive number of reusable bags). In order to fight climate change, instead of pointing fingers and saying, \"it's the [corporations, government, China] that's responsible, not me\", we should recognize that we all have a role to play and try to do as much as we can in the 10 years we have (according to the UN) before the effects of climate change become irreversible. \nTldr: Individual action matters.\nP.S. I know that posting this here is like preaching to the choir, but hopefully this serves as ammunition if someone tries to discredit individual action (which has happened almost every time it's become known that I'm zero waste. 🙄) Hopefully that behavior becomes less common and that mindset changes as time progresses.\nEdit: Thank you guys so much for the positive response and the awards! I didn't expect this to get so big. :)\nEdit 2: I should probably clarify that the 100 companies include mostly fossil fuel corporations, like Exxon. If you want to check out the report yourself, just search up the Carbon Majors Report 2017. Also, I wasn't trying to undermine the impact that these big corporations have. They have done so many unethical things, funded misleading studies, lobbied for or against legislation to fit their needs, etc. To emphasize, individual action should be done ALONGSIDE holding these corporations accountable (among other things)! This post was mostly to combat the misconception that \"individual action doesn't do anything\", which is why I focused so much on that.\n\n"}], [{"title": "The bread bag story (self.ZeroWaste)", "likes": "410", "comments": "49", "content": "So, a few months ago, maybe somewhere around april or may, I made myself a bread bag tailored for the whole grain bread of my local bakery. See, I'd decided to go zero waste, in the steps of \"be the change you want to see\" and just to sleep better knowing I was doing my part.\nSo it took me a couple of weeks to have the nerve to pull the bag out of my purse and ask to be served directly in the fabric bag, rather than in their usual plastic bag. \nBut when I did, the cashiers and baker were surprised, called all the team of bakers to the front of the shop to marvel on my initiative and to encourage me!\nSo I continued to bring my bread bag, and got odd looks from the customers, but the bakers were still nice and encouraging, so I let it slide.\nAnd a couple of weeks ago, my husband went to get the bread on a very busy weekend lunchtime. He told me there was a very long line of customers waiting to be served and they all marvelled at the bread bag. No more odd looks, just encouragement and people finding it a great idea.\nAnd something amazing has happened : today, I noticed that the baker had added a new product right in front of the cashdesk. Yup you guessed it : fabric bread bags !\nIn my wildest dreams I never believed that I could actually \"be the change I wanted to see\", and even less kickstart a local eco-friendly habit, but there you go!\nI guess the next step is seeing all the customers with fabric bread bags, but we're not there yet.\nStill an encouragement to all of us :what we do isn't just lowering our impact, it can be inspirational for others!\n\n"}], [{"title": "Let’s make a list of big-scale actions people can take. (self.ZeroWaste)", "likes": "31", "comments": "31", "content": "There are constantly posts about how it’s important to focus on corporations and larger-scale waste, or that we should decrease carbon emissions. We already know what needs to change. Let’s make a list of steps that people can take to make those changes happen. \nRight to Repair: Google “right to repair activism” to find more ways you can help. \n\nhttps://www.eff.org/issues/right-to-repair\nhttps://repair.org/\nhttp://fortune.com/2019/01/09/right-to-repair-manufacturers/\nhttps://www.ifixit.com/News/category/right-to-repair/activism/\n\nPopulation\n\nhttps://www.reddit.com/r/ZeroWaste/comments/c104h8/comment/er9radr\n\nDiet\n\n/r/EAAnimalAdvocacy\nhttps://www.sentienceinstitute.org/foundational-questions-summaries\nhttps://www.onegreenplanet.org/animalsandnature/why-shaming-people-into-doing-something-good-doesnt-work/\n\nChanging Minds, Sharing Facts, Building Motivation\n\nhttps://www.nature.com/articles/s41562-019-0632-4\nhttps://www.theatlantic.com/science/archive/2017/03/this-article-wont-change-your-mind/519093/\nhttps://wp.nyu.edu/sustainability-nyusustainablog/2018/02/13/how-to-help-your-friends-be-more-green/\nPsychology of Sustainability: textbook preview\nhttps://nbs.net/p/how-to-motivate-people-toward-sustainability-1d9e0fcf-8acb-48b1-b4d2-ad0b58395281 \nhttps://nbs.net/p/make-it-personal-how-to-get-people-to-care-about-susta-db82e0a8-5f54-48c6-8e6a-b29f08d2d127\nhttps://wp.nyu.edu/sustainability-nyusustainablog/2018/02/13/how-to-help-your-friends-be-more-green/\n\nEfficacy and Impact\n\nhttps://arstechnica.com/science/2019/05/people-drop-support-for-a-carbon-tax-when-getting-less-effective-nudges/\nhttps://www.nytimes.com/roomfordebate/2012/07/30/responsible-shoppers-but-bad-citizens/individual-actions-just-dont-add-up-to-environmental-change\nhttps://www.lobbyists4good.org/single-post/2018/06/07/Why-Online-Petitions-Do-Not-Work\n\nCharity, Careers, Donating, Volunteering\n\nhttps://80000hours.org/\nhttps://www.effectivealtruism.org/\n\nGeneral Tips\n\nhttps://www.reddit.com/user/ILikeNeurons/comments/?sort=top&t=month\nhttps://pollybarks.com/\nhttps://sustainability.stackexchange.com/\nhttp://zwia.org/\nhttps://www.sustainabilitydegrees.com/the-ultimate-how-to-guide-for-students/\nhttps://www.un.org/sustainabledevelopment/takeaction/\n\nLegislation\nLinks currently have a US focus. PM me with suggestions for other countries.\n\nGuide: How to Participate in Government\nIPCC 8/2019 Report: Climate and Land legislative priorities (international)\nTown Hall Project find out when Town halls are held so you can give feedback to politicians directly\nballot-o-pedia: see what will be on your ballot for the next upcoming election\nCitizen’s Climate Lobby: variety of opportunities\n\nLifecycle AnalysisMake sure to adjust whatever data to match YOUR use. Some examples are if you tend to lose or have to replace a reusable cup periodically, if you keep a ziploc bag for more than one use, whether you perform basic preventative maintenance and care for the product properly so it actually lives as long as it’s said to (clothes, suitcase)\n\nhttps://www.nrel.gov/lci/\nhttp://eplca.jrc.ec.europa.eu/ELCD3/\nhttps://sustainability.stackexchange.com/questions/2646/how-do-you-identify-what-is-sustainable-without-reverting-to-lists-and-other-peo/5761?r=SearchResults#5761\nhttps://www.cfp-japan.jp/english/list/\nhttps://www.bettermeetsreality.com/carbon-footprint-of-common-everyday-things-products-foods/\nhttps://nexus.openlca.org/\nhttps://www.lifecycleinitiative.org/applying-lca/lca-databases-map/\nhttps://www.google.com/search?q=life+cycle+analysis+database\n\n\n"}]]}